[
  {
    "q": "Seorang guru Al-Qur’an Hadits menjelaskan kepada peserta didik tentang pengertian Al-Qur’an sebagai wahyu Allah yang diturunkan kepada Nabi Muhammad saw., perbedaan wahyu dengan ilham, serta ta’lim sebagai proses pengajaran yang terstruktur.\n\nSetelah pembelajaran, guru ingin merumuskan tujuan pembelajaran ranah sikap yang tidak hanya menekankan pemahaman konsep, tetapi juga mendorong peningkatan keimanan, ketakwaan, dan akhlak mulia peserta didik dalam kehidupan sehari-hari.\n\nBerdasarkan deskripsi tersebut, rumusan tujuan pembelajaran ranah sikap yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan pengertian Al-Qur’an, wahyu, ilham, dan ta’lim secara sistematis dan runtut.",
      "Peserta didik dapat membedakan konsep wahyu, ilham, dan ta’lim berdasarkan sumber dan karakteristiknya.",
      "Peserta didik mampu menghafal dalil-dalil Al-Qur’an yang berkaitan dengan wahyu dan proses turunnya Al-Qur’an.",
      "Peserta didik mampu membuat ringkasan materi mengenai kedudukan Al-Qur’an sebagai pedoman hidup.",
      "Peserta didik dapat menyimpulkan perbedaan wahyu dan ilham melalui diskusi kelompok secara lisan maupun tertulis."
    ],
    "a": 3
  },
  {
    "q": "Seorang guru Al-Qur’an Hadits menyampaikan materi Ulum al-Hadis yang mencakup pengertian, ruang lingkup, serta fungsi Ulum al-Hadis dalam menilai kualitas hadis.\n\nGuru tersebut ingin merumuskan tujuan pembelajaran ranah pengetahuan yang tidak hanya menuntut peserta didik memahami konsep, tetapi juga mendorong kemampuan berpikir kritis dalam mengkaji hadis yang beredar di masyarakat.\n\nBerdasarkan pernyataan tersebut, rumusan tujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Mengeluarkan zakat 2,5% dari omzet 1 miliar karena nishab perak sudah terlampaui sejak kontrak pertama.",
      "Menganalogikan pada zakat pertanian (5%) dari sisa hasil netto setiap kali menerima pembayaran kontrak.",
      "Menunggu genap satu tahun (haul) untuk melihat sisa saldo akhir di rekening sebelum dipotong kebutuhan.",
      "Peserta didik mampu menganalisis kualitas sebuah hadis dengan menggunakan prinsip-prinsip Ulum al-Hadis untuk menentukan dapat tidaknya hadis tersebut dijadikan hujjah.",
      "Menghitung zakat 10% dari total pendapatan kotor sebagai bentuk syukur atas kemudahan mendapatkan uang."
    ],
    "a": 3
  },
  {
    "q": "Dalam pembelajaran tentang sejarah pertumbuhan dan penghimpunan hadis, guru menjelaskan bagaimana para sahabat, tabi’in, dan ulama hadis bekerja secara kolektif dalam menjaga, meneliti, dan membukukan hadis.\n\nGuru tersebut ingin merumuskan tujuan pembelajaran ranah keterampilan yang mendorong peserta didik tidak hanya memahami sejarah, tetapi juga memiliki semangat gotong royong sebagaimana dicontohkan para ulama hadis.\n\nRumusan tujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan tahapan sejarah penghimpunan hadis dari masa sahabat hingga kodifikasi.",
      "Peserta didik mampu mengidentifikasi tokoh-tokoh penting dalam sejarah penghimpunan hadis beserta perannya.",
      "Peserta didik mampu menyusun peta konsep sejarah pertumbuhan dan penghimpunan hadis secara berkelompok dengan pembagian tugas yang adil dan saling bekerja sama.",
      "Peserta didik mampu menghafal nama-nama kitab hadis dan penyusunnya secara runtut dan benar.",
      "Peserta didik mampu menyimpulkan latar belakang penghimpunan hadis dalam bentuk tulisan individu."
    ],
    "a": 2
  },
  {
    "q": "Seorang guru Al-Qur’an Hadits mengembangkan materi tentang metode tafsir tematik (maudhu’i) dengan mengangkat tema tradisi keagamaan di masyarakat.\n\nGuru tersebut ingin merumuskan indikator tujuan pembelajaran ranah sikap agar peserta didik memiliki sikap penerimaan terhadap tradisi yang hidup di masyarakat selama tidak bertentangan dengan nilai-nilai Al-Qur’an.\n\nRumusan indikator tujuan pembelajaran ranah sikap yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan langkah-langkah metode tafsir tematik secara runtut dan sistematis.",
      "Peserta didik menunjukkan sikap terbuka dan menghargai tradisi keagamaan masyarakat setelah memahami ayat-ayat Al-Qur’an melalui metode tafsir tematik.",
      "Peserta didik mampu membandingkan metode tafsir tematik dengan metode tafsir tahlili dan ijmali.",
      "Peserta didik mampu mengidentifikasi ayat-ayat Al-Qur’an yang berkaitan dengan tema tradisi keagamaan.",
      "Peserta didik mampu menyusun makalah tentang penerapan metode tafsir tematik dalam kajian sosial keagamaan."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran Al-Qur’an Hadits, guru menjelaskan konsep tawassuth sebagai sikap moderat yang bersumber dari Al-Qur’an dan hadis.\n\nGuru ingin merumuskan indikator tujuan pembelajaran ranah pengetahuan yang tidak hanya menekankan pemahaman konsep, tetapi juga mengembangkan kemampuan berpikir dinamis dan inovatif peserta didik.\n\nRumusan indikator tujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian tawassuth menurut Al-Qur’an dan hadis secara tepat.",
      "Peserta didik mampu menghafal dalil Al-Qur’an dan hadis yang berkaitan dengan konsep tawassuth.",
      "Peserta didik mampu menganalisis penerapan konsep tawassuth dalam berbagai persoalan keagamaan kontemporer dan merumuskan alternatif solusi yang moderat.",
      "Peserta didik mampu menjelaskan perbedaan konsep tawassuth dengan sikap ekstrem kanan dan ekstrem kiri.",
      "Peserta didik mampu mengidentifikasi istilah-istilah kunci yang berkaitan dengan moderasi beragama."
    ],
    "a": 2
  },
  {
    "q": "Seorang guru Al-Qur’an Hadits merencanakan pembelajaran materi nuzul al-Qur’an dengan menggunakan pendekatan Problem Based Learning (PBL).\n\nPeserta didik dihadapkan pada masalah tentang perbedaan pemahaman masyarakat terkait tahapan turunnya Al-Qur’an, baik secara sekaligus maupun berangsur-angsur.\n\nRumusan tujuan pembelajaran yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menghafal peristiwa turunnya Al-Qur’an secara kronologis dari awal hingga akhir.",
      "Peserta didik mampu menyebutkan ayat-ayat Al-Qur’an yang berkaitan dengan peristiwa turunnya wahyu pertama.",
      "Peserta didik mampu menganalisis tahapan dan sejarah turunnya Al-Qur’an serta mengaitkannya dengan konteks sosial masyarakat Arab sesuai karakteristik peserta didik melalui pemecahan masalah.",
      "Peserta didik mampu menuliskan kembali sejarah nuzul al-Qur’an dalam bentuk rangkuman.",
      "Peserta didik mampu menjelaskan pengertian nuzul al-Qur’an menurut para ulama tafsir."
    ],
    "a": 2
  },
  {
    "q": "Dalam pelaksanaan pembelajaran materi hadis dha‘if, seorang guru Al-Qur’an Hadits menggunakan pendekatan Project Based Learning (PjBL).\n\nPeserta didik ditugaskan membuat proyek klasifikasi hadis yang sering beredar di media sosial dengan menganalisis sanad dan matannya.\n\nRumusan materi ajar tentang kriteria hadis dha‘if yang paling tepat adalah …",
    "o": [
      "Hadis dha‘if adalah hadis yang tidak memenuhi satu atau beberapa syarat hadis sahih dan hasan, baik dari segi sanad maupun matan, sehingga perlu dianalisis secara kritis sebelum digunakan sebagai dasar pengamalan.",
      "Hadis dha‘if adalah hadis yang kualitas periwayatannya berada di bawah hadis sahih dan hasan.",
      "Hadis dha‘if merupakan hadis yang periwayatannya tidak sekuat hadis sahih.",
      "Hadis dha‘if adalah hadis yang tidak memenuhi sebagian persyaratan hadis sahih.",
      "Hadis dha‘if merupakan hadis yang memiliki kelemahan pada aspek periwayatan."
    ],
    "a": 0
  },
  {
    "q": "Seorang guru Al-Qur’an Hadits melakukan evaluasi pembelajaran materi keotentikan hadis dengan menggunakan pendekatan Discovery Based Learning (DBL).\n\nPeserta didik diminta menelaah teks hadis melalui proses mengamati, mengelompokkan, dan menarik kesimpulan berdasarkan sanad dan matan.\n\nUraian materi ajar tentang macam-macam hadis yang paling tepat adalah …",
    "o": [
      "Macam-macam hadis terdiri atas hadis sahih, hasan, dan dha‘if yang dipelajari secara umum.",
      "Macam-macam hadis adalah hadis sahih dan dha‘if untuk memudahkan hafalan.",
      "Macam-macam hadis mencakup hadis sahih, hasan, dan dha‘if yang dianalisis berdasarkan keutuhan sanad dan kesesuaian matan melalui proses penemuan peserta didik.",
      "Macam-macam hadis disampaikan guru melalui ceramah langsung.",
      "Macam-macam hadis dijelaskan secara ringkas agar mudah dipahami."
    ],
    "a": 2
  },
  {
    "q": "Dalam praktik pedagogi, seorang guru Al-Qur’an Hadits merencanakan materi kajian tafsir Al-Qur’an secara logis dengan pendekatan TPACK.\n\nGuru ingin menyusun alur materi ajar metode tafsir tematik (maudhu’i) yang sistematis dan sesuai karakteristik peserta didik.\n\nAlur materi ajar yang paling tepat adalah …",
    "o": [
      "Mengumpulkan ayat secara acak lalu menyimpulkan secara umum.",
      "Menentukan tema kajian, mengumpulkan ayat terkait, menganalisis kandungan ayat, dan menyimpulkan pesan tematik dengan dukungan media digital.",
      "Menampilkan video tafsir lalu menguji pemahaman peserta didik.",
      "Menyajikan ayat pilihan lalu mendiskusikan secara bebas.",
      "Menjelaskan pengertian tafsir tematik dan memberi tugas rangkuman."
    ],
    "a": 1
  },
  {
    "q": "Dalam praktik pedagogi, seorang guru Al-Qur’an Hadits melaksanakan pembelajaran konsep tawassuth secara logis dengan pendekatan Deep Learning (DL).\n\nGuru merancang aktivitas pembelajaran agar peserta didik memahami dalil, mengaitkannya dengan realitas kehidupan, serta merefleksikan sikap moderat.\n\nAlur materi ajar yang paling tepat adalah …",
    "o": [
      "Mengamati fenomena sosial, mengkaji dalil Al-Qur’an dan Hadis tentang tawassuth, menganalisis penerapannya, dan merefleksikan sikap moderat dalam kehidupan sehari-hari.",
      "Menjelaskan pengertian tawassuth lalu memberikan latihan soal.",
      "Menyajikan contoh sikap ekstrem lalu menyimpulkan pentingnya moderasi.",
      "Menayangkan video lalu tanya jawab kelas.",
      "Menyampaikan ceramah dan menugaskan rangkuman."
    ],
    "a": 0
  },
  {
    "q": "Seorang guru Al-Qur’an Hadits menjelaskan kepada peserta didik tentang fungsi Al-Qur’an sebagai petunjuk hidup, sumber hukum, dan pedoman akhlak.\n\nGuru ingin menumbuhkan kesadaran peserta didik agar menjadikan Al-Qur’an sebagai rujukan utama dalam bersikap dan bertindak.\n\nIndikator tujuan pembelajaran ranah sikap yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan fungsi Al-Qur’an sebagai pedoman hidup.",
      "Peserta didik mampu menyebutkan dalil tentang fungsi Al-Qur’an.",
      "Peserta didik menunjukkan sikap menjadikan Al-Qur’an sebagai pedoman dalam mengambil keputusan sehari-hari.",
      "Peserta didik mampu menuliskan fungsi Al-Qur’an dalam kehidupan manusia.",
      "Peserta didik mampu menghafal ayat-ayat tentang fungsi Al-Qur’an."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran hadis tentang kejujuran, guru menampilkan beberapa kasus ketidakjujuran yang sering terjadi di lingkungan sekolah.\n\nPeserta didik diminta menganalisis dampak perilaku tersebut berdasarkan kandungan hadis yang dipelajari.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menghafal hadis tentang kejujuran.",
      "Peserta didik mampu menjelaskan arti kata-kata sulit dalam hadis kejujuran.",
      "Peserta didik mampu menganalisis dampak perilaku tidak jujur dalam kehidupan berdasarkan kandungan hadis.",
      "Peserta didik mampu menuliskan kembali teks hadis tentang kejujuran.",
      "Peserta didik mampu menyebutkan contoh perilaku jujur di sekolah."
    ],
    "a": 2
  },
  {
    "q": "Guru Al-Qur’an Hadits menjelaskan pengertian sanad dan matan hadis serta perannya dalam menentukan kualitas hadis.\n\nPeserta didik kemudian diminta mengkaji sebuah hadis populer yang sering beredar di media sosial.\n\nTujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian sanad dan matan.",
      "Peserta didik mampu menghafal contoh sanad hadis.",
      "Peserta didik mampu menganalisis sanad dan matan sebuah hadis untuk menilai kualitasnya secara sederhana.",
      "Peserta didik mampu menjelaskan sejarah kodifikasi hadis.",
      "Peserta didik mampu menuliskan definisi hadis sahih."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran tafsir Al-Qur’an, guru mengajarkan metode tafsir tahlili dengan membahas ayat-ayat tentang toleransi.\n\nGuru berharap peserta didik mampu memahami makna ayat secara mendalam dan mengaplikasikannya dalam kehidupan bermasyarakat.\n\nTujuan pembelajaran yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian tafsir tahlili.",
      "Peserta didik mampu menghafal ayat-ayat Al-Qur’an tentang toleransi.",
      "Peserta didik mampu menganalisis kandungan ayat-ayat toleransi dengan metode tafsir tahlili dan menerapkannya dalam kehidupan sosial.",
      "Peserta didik mampu menuliskan terjemahan ayat tentang toleransi.",
      "Peserta didik mampu menyimpulkan isi ayat secara singkat."
    ],
    "a": 2
  },
  {
    "q": "Guru Al-Qur’an Hadits membahas materi hadis tentang menuntut ilmu sebagai kewajiban setiap muslim.\n\nUntuk menumbuhkan motivasi belajar peserta didik, guru ingin merumuskan tujuan pembelajaran ranah sikap.\n\nRumusan tujuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menghafal hadis tentang menuntut ilmu.",
      "Peserta didik mampu menjelaskan makna hadis tentang menuntut ilmu.",
      "Peserta didik menunjukkan sikap gemar belajar dan menghargai ilmu sebagai bentuk pengamalan hadis.",
      "Peserta didik mampu menuliskan teks hadis tentang menuntut ilmu.",
      "Peserta didik mampu menyebutkan perawi hadis tentang menuntut ilmu."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran Al-Qur’an Hadits tentang perilaku adil, guru memberikan studi kasus ketidakadilan dalam kehidupan sehari-hari.\n\nPeserta didik diminta mencari solusi berdasarkan nilai-nilai Al-Qur’an dan hadis.\n\nTujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian adil.",
      "Peserta didik mampu menghafal ayat dan hadis tentang keadilan.",
      "Peserta didik mampu merumuskan solusi terhadap permasalahan ketidakadilan berdasarkan nilai Al-Qur’an dan hadis.",
      "Peserta didik mampu menjelaskan sejarah konsep keadilan dalam Islam.",
      "Peserta didik mampu menuliskan ayat-ayat tentang keadilan."
    ],
    "a": 2
  },
  {
    "q": "Guru menjelaskan materi Ulumul Qur’an tentang asbabun nuzul ayat.\n\nPeserta didik diminta mengaitkan latar belakang turunnya ayat dengan konteks permasalahan masa kini.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menghafal pengertian asbabun nuzul.",
      "Peserta didik mampu menyebutkan contoh asbabun nuzul.",
      "Peserta didik mampu menganalisis hubungan antara asbabun nuzul ayat dengan konteks permasalahan kontemporer.",
      "Peserta didik mampu menuliskan ayat-ayat yang memiliki asbabun nuzul.",
      "Peserta didik mampu menjelaskan sejarah turunnya Al-Qur’an."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran hadis tentang persaudaraan (ukhuwah), guru menggunakan metode diskusi kelompok.\n\nPeserta didik diminta memecahkan konflik sederhana berdasarkan kandungan hadis.\n\nTujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menghafal hadis tentang ukhuwah.",
      "Peserta didik mampu menjelaskan arti ukhuwah.",
      "Peserta didik mampu menyelesaikan konflik sederhana dengan mengacu pada nilai-nilai ukhuwah dalam hadis.",
      "Peserta didik mampu menuliskan teks hadis ukhuwah.",
      "Peserta didik mampu menyebutkan perawi hadis ukhuwah."
    ],
    "a": 2
  },
  {
    "q": "Guru Al-Qur’an Hadits menjelaskan materi tentang larangan ghibah dalam Al-Qur’an dan hadis.\n\nGuru ingin membentuk karakter peserta didik agar menjaga lisan dalam pergaulan.\n\nIndikator tujuan pembelajaran ranah sikap yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan pengertian ghibah.",
      "Peserta didik mampu menghafal ayat dan hadis tentang larangan ghibah.",
      "Peserta didik menunjukkan sikap menghindari ghibah dan menjaga lisan dalam kehidupan sehari-hari.",
      "Peserta didik mampu menuliskan dalil tentang ghibah.",
      "Peserta didik mampu menyebutkan contoh perbuatan ghibah."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran tafsir, guru membahas ayat-ayat Al-Qur’an tentang amanah.\n\nPeserta didik diminta mengaitkan kandungan ayat dengan tugas dan tanggung jawab mereka sebagai pelajar.\n\nTujuan pembelajaran yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menghafal ayat-ayat tentang amanah.",
      "Peserta didik mampu menjelaskan arti amanah.",
      "Peserta didik mampu menganalisis penerapan nilai amanah dalam kehidupan peserta didik berdasarkan kandungan ayat.",
      "Peserta didik mampu menuliskan terjemahan ayat tentang amanah.",
      "Peserta didik mampu menyebutkan sebab turunnya ayat tentang amanah."
    ],
    "a": 2
  },
{
  "q": "Guru Al-Qur’an Hadits menjelaskan materi tentang fungsi hadis sebagai sumber hukum Islam setelah Al-Qur’an.\n\nPeserta didik diminta mengkaji contoh permasalahan kontemporer yang tidak dijelaskan secara rinci dalam Al-Qur’an.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal pengertian hadis.",
    "Peserta didik mampu menyebutkan macam-macam hadis.",
    "Peserta didik mampu menganalisis peran hadis dalam menjelaskan hukum Islam terhadap permasalahan yang tidak dijelaskan secara rinci dalam Al-Qur’an.",
    "Peserta didik mampu menuliskan dalil tentang kedudukan hadis.",
    "Peserta didik mampu menjelaskan sejarah periwayatan hadis."
  ],
  "a": 2
},
{
  "q": "Dalam pembelajaran hadis tentang toleransi, guru menghadirkan perbedaan pendapat (ikhtilaf) di kalangan ulama.\n\nPeserta didik diarahkan agar bersikap bijak dalam menyikapi perbedaan tersebut.\n\nIndikator tujuan pembelajaran ranah sikap yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menjelaskan pengertian ikhtilaf.",
    "Peserta didik mampu menyebutkan contoh perbedaan pendapat ulama.",
    "Peserta didik menunjukkan sikap menghargai perbedaan pendapat sebagai bagian dari khazanah keilmuan Islam.",
    "Peserta didik mampu menghafal hadis tentang toleransi.",
    "Peserta didik mampu menuliskan teks hadis tentang ikhtilaf."
  ],
  "a": 2
},
{
  "q": "Guru Al-Qur’an Hadits menjelaskan materi tentang hadis sahih, hasan, dan dha‘if.\n\nPeserta didik diminta mengelompokkan beberapa contoh hadis berdasarkan kualitasnya.\n\nTujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menyebutkan pengertian hadis sahih, hasan, dan dha‘if.",
    "Peserta didik mampu menghafal kriteria hadis sahih.",
    "Peserta didik mampu mengelompokkan hadis berdasarkan kualitasnya dengan memperhatikan sanad dan matannya.",
    "Peserta didik mampu menjelaskan sejarah pembukuan hadis.",
    "Peserta didik mampu menuliskan definisi hadis dha‘if."
  ],
  "a": 2
},
{
  "q": "Dalam pembelajaran tafsir Al-Qur’an, guru membahas ayat-ayat tentang keadilan sosial.\n\nPeserta didik diminta mengaitkan kandungan ayat dengan fenomena ketimpangan sosial di lingkungan sekitar.\n\nTujuan pembelajaran yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal ayat-ayat tentang keadilan.",
    "Peserta didik mampu menjelaskan arti keadilan sosial.",
    "Peserta didik mampu menganalisis penerapan nilai keadilan sosial dalam kehidupan masyarakat berdasarkan kandungan ayat Al-Qur’an.",
    "Peserta didik mampu menuliskan terjemahan ayat tentang keadilan.",
    "Peserta didik mampu menyebutkan sebab turunnya ayat keadilan."
  ],
  "a": 2
},
{
  "q": "Guru Al-Qur’an Hadits menyampaikan materi tentang larangan bersikap sombong (takabbur) dalam Al-Qur’an dan hadis.\n\nGuru ingin membentuk karakter rendah hati pada peserta didik.\n\nTujuan pembelajaran ranah sikap yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menjelaskan pengertian takabbur.",
    "Peserta didik mampu menghafal dalil tentang larangan takabbur.",
    "Peserta didik menunjukkan sikap rendah hati dan menjauhi perilaku sombong dalam kehidupan sehari-hari.",
    "Peserta didik mampu menuliskan ayat tentang takabbur.",
    "Peserta didik mampu menyebutkan contoh perilaku sombong."
  ],
  "a": 2
},
{
  "q": "Dalam pembelajaran Ulumul Hadis, guru menjelaskan pentingnya periwayatan hadis yang bersambung (ittisal sanad).\n\nPeserta didik diminta menelaah contoh hadis dengan sanad yang berbeda-beda.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal istilah-istilah dalam Ulumul Hadis.",
    "Peserta didik mampu menyebutkan pengertian sanad.",
    "Peserta didik mampu menganalisis pentingnya ketersambungan sanad dalam menentukan kualitas hadis.",
    "Peserta didik mampu menuliskan contoh sanad hadis.",
    "Peserta didik mampu menjelaskan sejarah Ulumul Hadis."
  ],
  "a": 2
},
{
  "q": "Guru Al-Qur’an Hadits menggunakan metode diskusi untuk membahas ayat-ayat tentang tanggung jawab manusia sebagai khalifah di bumi.\n\nPeserta didik diminta merumuskan tindakan nyata menjaga lingkungan.\n\nTujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal ayat tentang khalifah.",
    "Peserta didik mampu menjelaskan pengertian khalifah.",
    "Peserta didik mampu merancang tindakan nyata menjaga lingkungan sebagai wujud tanggung jawab khalifah di bumi.",
    "Peserta didik mampu menuliskan terjemahan ayat tentang khalifah.",
    "Peserta didik mampu menyebutkan tugas manusia sebagai khalifah."
  ],
  "a": 2
},
{
  "q": "Dalam pembelajaran hadis tentang disiplin waktu, guru mengaitkannya dengan kebiasaan peserta didik di sekolah.\n\nGuru ingin menanamkan nilai kedisiplinan melalui pemahaman hadis.\n\nIndikator tujuan pembelajaran ranah sikap yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal hadis tentang disiplin.",
    "Peserta didik mampu menjelaskan makna disiplin waktu.",
    "Peserta didik menunjukkan sikap disiplin dalam memanfaatkan waktu sebagai pengamalan nilai hadis.",
    "Peserta didik mampu menuliskan teks hadis tentang disiplin.",
    "Peserta didik mampu menyebutkan contoh disiplin waktu."
  ],
  "a": 2
},
{
  "q": "Guru menjelaskan materi tafsir tentang ayat-ayat Al-Qur’an yang berkaitan dengan kerja keras.\n\nPeserta didik diminta mengaitkan makna ayat dengan sikap belajar mereka.\n\nTujuan pembelajaran yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal ayat tentang kerja keras.",
    "Peserta didik mampu menjelaskan arti kerja keras.",
    "Peserta didik mampu menganalisis pentingnya sikap kerja keras dalam belajar berdasarkan kandungan ayat Al-Qur’an.",
    "Peserta didik mampu menuliskan terjemahan ayat tentang kerja keras.",
    "Peserta didik mampu menyebutkan sebab turunnya ayat kerja keras."
  ],
  "a": 2
},
{
  "q": "Dalam pembelajaran hadis tentang tolong-menolong, guru memberikan studi kasus bencana alam.\n\nPeserta didik diminta menentukan sikap yang tepat sesuai kandungan hadis.\n\nTujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal hadis tentang tolong-menolong.",
    "Peserta didik mampu menjelaskan pengertian tolong-menolong.",
    "Peserta didik mampu menentukan dan merancang bentuk tindakan tolong-menolong sesuai nilai hadis dalam situasi nyata.",
    "Peserta didik mampu menuliskan teks hadis tentang tolong-menolong.",
    "Peserta didik mampu menyebutkan perawi hadis tentang tolong-menolong."
  ],
  "a": 2
},
  {
  "q": "Guru Al-Qur’an Hadits menjelaskan materi tentang kedudukan Al-Qur’an sebagai sumber utama ajaran Islam.\n\nPeserta didik diminta mengaitkan kandungan Al-Qur’an dengan perilaku sehari-hari di lingkungan sekolah.\n\nTujuan pembelajaran ranah sikap yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menjelaskan kedudukan Al-Qur’an dalam Islam.",
    "Peserta didik mampu menghafal dalil tentang kedudukan Al-Qur’an.",
    "Peserta didik menunjukkan sikap menjadikan Al-Qur’an sebagai pedoman dalam bersikap dan bertindak sehari-hari.",
    "Peserta didik mampu menuliskan ayat tentang kedudukan Al-Qur’an.",
    "Peserta didik mampu menyebutkan fungsi Al-Qur’an."
  ],
  "a": 2
},
{
  "q": "Dalam pembelajaran hadis tentang amanah, guru memberikan contoh pelanggaran amanah yang sering terjadi di masyarakat.\n\nPeserta didik diminta menilai perilaku tersebut berdasarkan kandungan hadis.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal hadis tentang amanah.",
    "Peserta didik mampu menjelaskan arti amanah.",
    "Peserta didik mampu menganalisis dampak perilaku tidak amanah dalam kehidupan berdasarkan kandungan hadis.",
    "Peserta didik mampu menuliskan teks hadis tentang amanah.",
    "Peserta didik mampu menyebutkan perawi hadis tentang amanah."
  ],
  "a": 2
},
{
  "q": "Guru Al-Qur’an Hadits menjelaskan materi tentang macam-macam tafsir Al-Qur’an.\n\nPeserta didik diminta membandingkan metode tafsir ijmali, tahlili, dan maudhu’i.\n\nTujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menyebutkan pengertian masing-masing metode tafsir.",
    "Peserta didik mampu menghafal jenis-jenis tafsir.",
    "Peserta didik mampu membandingkan metode tafsir ijmali, tahlili, dan maudhu’i berdasarkan karakteristiknya.",
    "Peserta didik mampu menuliskan contoh tafsir Al-Qur’an.",
    "Peserta didik mampu menjelaskan sejarah perkembangan tafsir."
  ],
  "a": 2
},
{
  "q": "Dalam pembelajaran Al-Qur’an Hadits tentang larangan berbuat zalim, guru mengaitkannya dengan fenomena perundungan (bullying) di sekolah.\n\nPeserta didik diminta merumuskan sikap yang tepat sesuai nilai Al-Qur’an dan hadis.\n\nTujuan pembelajaran yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal ayat dan hadis tentang larangan zalim.",
    "Peserta didik mampu menjelaskan pengertian zalim.",
    "Peserta didik mampu menganalisis dan menentukan sikap anti perundungan berdasarkan nilai Al-Qur’an dan hadis.",
    "Peserta didik mampu menuliskan terjemahan ayat tentang zalim.",
    "Peserta didik mampu menyebutkan contoh perbuatan zalim."
  ],
  "a": 2
},
{
  "q": "Guru Al-Qur’an Hadits menjelaskan materi hadis tentang etos kerja dalam Islam.\n\nPeserta didik diminta mengaitkan kandungan hadis dengan sikap belajar dan bekerja keras.\n\nTujuan pembelajaran ranah sikap yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal hadis tentang etos kerja.",
    "Peserta didik mampu menjelaskan arti etos kerja.",
    "Peserta didik menunjukkan sikap kerja keras, disiplin, dan tanggung jawab sebagai pengamalan hadis.",
    "Peserta didik mampu menuliskan teks hadis tentang etos kerja.",
    "Peserta didik mampu menyebutkan perawi hadis tentang etos kerja."
  ],
  "a": 2
},
{
  "q": "Dalam pembelajaran Ulumul Qur’an, guru menjelaskan perbedaan ayat Makkiyah dan Madaniyah.\n\nPeserta didik diminta mengelompokkan beberapa ayat berdasarkan ciri-cirinya.\n\nTujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal pengertian Makkiyah dan Madaniyah.",
    "Peserta didik mampu menyebutkan ciri-ciri ayat Makkiyah dan Madaniyah.",
    "Peserta didik mampu mengelompokkan ayat Makkiyah dan Madaniyah berdasarkan ciri dan konteks turunnya.",
    "Peserta didik mampu menuliskan contoh ayat Makkiyah.",
    "Peserta didik mampu menjelaskan sejarah turunnya Al-Qur’an."
  ],
  "a": 2
},
{
  "q": "Guru Al-Qur’an Hadits menjelaskan materi tentang pentingnya menjaga persatuan dan kesatuan umat.\n\nPeserta didik diminta mengaitkan materi dengan kondisi keberagaman di Indonesia.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal ayat tentang persatuan.",
    "Peserta didik mampu menjelaskan arti persatuan dan kesatuan.",
    "Peserta didik mampu menganalisis pentingnya persatuan umat dalam kehidupan berbangsa berdasarkan nilai Al-Qur’an dan hadis.",
    "Peserta didik mampu menuliskan terjemahan ayat tentang persatuan.",
    "Peserta didik mampu menyebutkan sebab turunnya ayat persatuan."
  ],
  "a": 2
},
{
  "q": "Dalam pembelajaran hadis tentang sikap sabar, guru memberikan contoh permasalahan yang sering dialami remaja.\n\nPeserta didik diminta menentukan sikap yang tepat sesuai kandungan hadis.\n\nTujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal hadis tentang sabar.",
    "Peserta didik mampu menjelaskan arti sabar.",
    "Peserta didik mampu menentukan sikap sabar dalam menghadapi permasalahan sesuai kandungan hadis.",
    "Peserta didik mampu menuliskan teks hadis tentang sabar.",
    "Peserta didik mampu menyebutkan perawi hadis tentang sabar."
  ],
  "a": 2
},
{
  "q": "Guru menjelaskan materi tafsir Al-Qur’an tentang ayat-ayat yang mendorong sikap optimis dan tidak putus asa.\n\nPeserta didik diminta mengaitkan kandungan ayat dengan motivasi belajar.\n\nTujuan pembelajaran yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal ayat tentang optimisme.",
    "Peserta didik mampu menjelaskan arti optimis.",
    "Peserta didik mampu menganalisis pentingnya sikap optimis dalam belajar berdasarkan kandungan ayat Al-Qur’an.",
    "Peserta didik mampu menuliskan terjemahan ayat tentang optimisme.",
    "Peserta didik mampu menyebutkan sebab turunnya ayat optimisme."
  ],
  "a": 2
},
{
  "q": "Dalam pembelajaran hadis tentang menepati janji, guru mengaitkannya dengan perilaku peserta didik di sekolah.\n\nPeserta didik diminta menilai dan memperbaiki sikap yang tidak sesuai dengan nilai hadis.\n\nTujuan pembelajaran ranah sikap yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal hadis tentang menepati janji.",
    "Peserta didik mampu menjelaskan arti menepati janji.",
    "Peserta didik menunjukkan sikap menepati janji dalam kehidupan sehari-hari sebagai pengamalan hadis.",
    "Peserta didik mampu menuliskan teks hadis tentang menepati janji.",
    "Peserta didik mampu menyebutkan perawi hadis tentang menepati janji."
  ],
  "a": 2
},
  {
  "q": "Guru Al-Qur’an Hadits menjelaskan materi tentang perintah berbuat baik kepada orang tua (birrul walidain).\n\nPeserta didik diminta mengaitkan kandungan ayat dan hadis dengan sikap mereka di rumah.\n\nTujuan pembelajaran ranah sikap yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal ayat dan hadis tentang birrul walidain.",
    "Peserta didik mampu menjelaskan pengertian birrul walidain.",
    "Peserta didik menunjukkan sikap hormat, patuh, dan berbuat baik kepada orang tua dalam kehidupan sehari-hari.",
    "Peserta didik mampu menuliskan dalil tentang birrul walidain.",
    "Peserta didik mampu menyebutkan contoh birrul walidain."
  ],
  "a": 2
},
{
  "q": "Dalam pembelajaran hadis tentang larangan berbohong, guru mengaitkannya dengan kejujuran dalam pergaulan.\n\nPeserta didik diminta menilai dampak perilaku berbohong dalam kehidupan sosial.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal hadis tentang larangan berbohong.",
    "Peserta didik mampu menjelaskan arti bohong.",
    "Peserta didik mampu menganalisis dampak negatif perilaku berbohong dalam kehidupan sosial berdasarkan kandungan hadis.",
    "Peserta didik mampu menuliskan teks hadis tentang larangan berbohong.",
    "Peserta didik mampu menyebutkan perawi hadis tentang larangan berbohong."
  ],
  "a": 2
},
{
  "q": "Guru Al-Qur’an Hadits menjelaskan materi tafsir tentang ayat-ayat Al-Qur’an yang mendorong sikap dermawan.\n\nPeserta didik diminta mengaitkan kandungan ayat dengan kepedulian sosial.\n\nTujuan pembelajaran yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal ayat tentang kedermawanan.",
    "Peserta didik mampu menjelaskan arti dermawan.",
    "Peserta didik mampu menganalisis pentingnya sikap dermawan dalam kehidupan sosial berdasarkan kandungan ayat Al-Qur’an.",
    "Peserta didik mampu menuliskan terjemahan ayat tentang dermawan.",
    "Peserta didik mampu menyebutkan sebab turunnya ayat dermawan."
  ],
  "a": 2
},
{
  "q": "Dalam pembelajaran hadis tentang menjaga kebersihan, guru mengaitkannya dengan kebiasaan hidup sehat.\n\nPeserta didik diminta merancang perilaku hidup bersih sesuai kandungan hadis.\n\nTujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal hadis tentang kebersihan.",
    "Peserta didik mampu menjelaskan arti kebersihan.",
    "Peserta didik mampu merancang dan menerapkan perilaku hidup bersih sesuai nilai hadis dalam kehidupan sehari-hari.",
    "Peserta didik mampu menuliskan teks hadis tentang kebersihan.",
    "Peserta didik mampu menyebutkan perawi hadis tentang kebersihan."
  ],
  "a": 2
},
{
  "q": "Guru Al-Qur’an Hadits menjelaskan materi tentang larangan berprasangka buruk (su’uzan).\n\nPeserta didik diminta mengaitkan materi dengan pergaulan sehari-hari.\n\nTujuan pembelajaran ranah sikap yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal ayat dan hadis tentang su’uzan.",
    "Peserta didik mampu menjelaskan pengertian su’uzan.",
    "Peserta didik menunjukkan sikap berpikir positif dan menghindari prasangka buruk dalam pergaulan.",
    "Peserta didik mampu menuliskan dalil tentang su’uzan.",
    "Peserta didik mampu menyebutkan contoh perilaku su’uzan."
  ],
  "a": 2
},
{
  "q": "Dalam pembelajaran Ulumul Qur’an, guru menjelaskan hikmah diturunkannya Al-Qur’an secara berangsur-angsur.\n\nPeserta didik diminta mengaitkan hikmah tersebut dengan proses belajar.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal pengertian nuzulul Qur’an.",
    "Peserta didik mampu menyebutkan peristiwa turunnya Al-Qur’an.",
    "Peserta didik mampu menganalisis hikmah turunnya Al-Qur’an secara berangsur-angsur terhadap perkembangan umat Islam.",
    "Peserta didik mampu menuliskan sejarah turunnya Al-Qur’an.",
    "Peserta didik mampu menjelaskan ayat pertama yang turun."
  ],
  "a": 2
},
{
  "q": "Guru Al-Qur’an Hadits menjelaskan materi hadis tentang tanggung jawab individu.\n\nPeserta didik diminta mengaitkan kandungan hadis dengan tugas mereka sebagai pelajar.\n\nTujuan pembelajaran ranah sikap yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal hadis tentang tanggung jawab.",
    "Peserta didik mampu menjelaskan arti tanggung jawab.",
    "Peserta didik menunjukkan sikap bertanggung jawab dalam menjalankan tugas sebagai pelajar.",
    "Peserta didik mampu menuliskan teks hadis tentang tanggung jawab.",
    "Peserta didik mampu menyebutkan perawi hadis tentang tanggung jawab."
  ],
  "a": 2
},
{
  "q": "Dalam pembelajaran tafsir Al-Qur’an, guru membahas ayat-ayat tentang larangan berlebih-lebihan (israf).\n\nPeserta didik diminta mengaitkan kandungan ayat dengan pola hidup sederhana.\n\nTujuan pembelajaran yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal ayat tentang israf.",
    "Peserta didik mampu menjelaskan arti israf.",
    "Peserta didik mampu menganalisis pentingnya hidup sederhana berdasarkan kandungan ayat Al-Qur’an.",
    "Peserta didik mampu menuliskan terjemahan ayat tentang israf.",
    "Peserta didik mampu menyebutkan sebab turunnya ayat israf."
  ],
  "a": 2
},
{
  "q": "Guru Al-Qur’an Hadits menjelaskan materi hadis tentang menjaga persaudaraan.\n\nPeserta didik diminta menyelesaikan konflik sederhana sesuai kandungan hadis.\n\nTujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal hadis tentang persaudaraan.",
    "Peserta didik mampu menjelaskan arti persaudaraan.",
    "Peserta didik mampu menyelesaikan konflik sederhana dengan mengedepankan nilai persaudaraan sesuai hadis.",
    "Peserta didik mampu menuliskan teks hadis tentang persaudaraan.",
    "Peserta didik mampu menyebutkan perawi hadis tentang persaudaraan."
  ],
  "a": 2
},
{
  "q": "Dalam pembelajaran Al-Qur’an Hadits, guru menjelaskan pentingnya bersyukur atas nikmat Allah.\n\nPeserta didik diminta mengaitkan kandungan ayat dan hadis dengan kehidupan sehari-hari.\n\nTujuan pembelajaran ranah sikap yang paling tepat adalah …",
  "o": [
    "Peserta didik mampu menghafal ayat dan hadis tentang syukur.",
    "Peserta didik mampu menjelaskan pengertian syukur.",
    "Peserta didik menunjukkan sikap bersyukur dalam perkataan dan perbuatan sebagai pengamalan nilai Al-Qur’an dan hadis.",
    "Peserta didik mampu menuliskan dalil tentang syukur.",
    "Peserta didik mampu menyebutkan contoh sikap syukur."
  ],
  "a": 2
}
]

