[
  {
    "q": "1. Disajikan deskripsi materi tentang Pengertian Al-Quran, Wahyu, Ilham, dan Ta’lim, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah sikap yang paling sesuai dengan indikator tujuan supaya peserta didik dapat meningkatkan keimanan, ketakwaan dan akhlak mulia. Dalam pembelajaran Qur’an Hadis, guru menyajikan deskripsi tentang Al-Qur’an sebagai wahyu Allah yang diturunkan kepada Nabi Muhammad saw. sebagai petunjuk hidup manusia. Guru menjelaskan fungsi Al-Qur’an sebagai hudā, furqān, dan sumber nilai pembentuk akhlak individu serta kehidupan sosial. Selanjutnya, guru mengaitkan tujuan pendidikan Qur’an Hadis dengan tantangan kehidupan masyarakat Indonesia yang majemuk, seperti perbedaan latar belakang budaya, agama, dan pandangan sosial, serta munculnya sikap intoleran di ruang publik. Peserta didik diminta menelaah kembali rumusan tujuan pembelajaran Qur’an Hadis yang selama ini digunakan di sekolah. Berdasarkan stimulus tersebut, evaluasi yang PALING TEPAT terhadap rumusan tujuan pembelajaran Qur’an Hadis adalah...",
    "o": [
      "Tujuan pembelajaran sebaiknya difokuskan pada kemampuan membaca dan menghafal Al-Qur’an secara benar",
      "Tujuan pembelajaran cukup menekankan penguasaan konsep wahyu dan sejarah turunnya Al-Qur’an",
      "Tujuan pembelajaran perlu diarahkan pada pemahaman teks Al-Qur’an tanpa mengaitkannya dengan realitas sosial",
      "Tujuan pembelajaran Qur’an Hadis harus dievaluasi agar tidak hanya bersifat kognitif, tetapi juga membentuk sikap religius dan sosial peserta didik",
      "Tujuan pembelajaran Qur’an Hadis sebaiknya diseragamkan tanpa mempertimbangkan konteks kebangsaan"
    ],
    "a": 3
  },
  {
    "q": "2. Disajikan pernyataan materi tentang pemahaman Ulum al-Hadis, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan indikator supaya peserta didik mampu berpikir kritis. Guru Qur’an Hadis menjelaskan konsep dasar Ulum al-Hadis, khususnya kajian sanad dan matan sebagai dasar untuk menilai keotentikan hadis. Pembelajaran dikaitkan dengan fenomena maraknya penyebaran konten hadis di media sosial yang sering kali dipotong, tidak jelas sumbernya, atau disalahpahami konteksnya. Guru kemudian meminta peserta didik merancang cara agar prinsip-prinsip Ulum al-Hadis dapat diterapkan dalam kehidupan digital sehari-hari sebagai upaya menjaga kemurnian ajaran Islam. Tindakan yang paling sesuai dengan tujuan tersebut adalah...",
    "o": [
      "Menghindari penggunaan media sosial agar tidak terpapar hadis palsu",
      "Menghafalkan klasifikasi hadis untuk kepentingan akademik",
      "Menyerahkan penilaian keabsahan hadis sepenuhnya kepada tokoh agama",
      "Membatasi pembahasan hadis hanya di ruang kelas",
      "Mengembangkan sikap literasi digital keagamaan dengan memverifikasi sanad, sumber, dan konteks hadis sebelum menyebarkannya"
    ],
    "a": 4
  },
  {
    "q": "3. Disajikan pernyataan materi tentang sejarah pertumbuhan dan penghimpunan hadis, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai dengan indikator supaya peserta didik memiliki semangat gotong royong. Dalam pembelajaran Qur’an Hadis, dosen menyajikan pernyataan materi tentang sejarah pertumbuhan dan penghimpunan hadis, mulai dari periwayatan secara lisan pada masa Nabi saw., upaya verifikasi oleh para sahabat, hingga kodifikasi hadis secara sistematis pada masa tabi‘in dan ulama hadis. Dosen menekankan bahwa proses penghimpunan hadis tidak dilakukan secara individual, melainkan melalui kerja kolektif, musyawarah, dan saling verifikasi, yang mencerminkan nilai gotong royong dalam tradisi keilmuan Islam. Berdasarkan materi tersebut, dosen meminta mahasiswa merumuskan tujuan pembelajaran ranah keterampilan yang tidak hanya mengukur pemahaman konsep sejarah hadis, tetapi juga menumbuhkan semangat gotong royong peserta didik dalam proses pembelajaran. Rumusan tujuan pembelajaran ranah keterampilan yang sesuai dengan indikator adalah …",
    "o": [
      "Peserta didik mampu bekerja secara kolaboratif menyusun peta proses penghimpunan hadis berdasarkan sumber rujukan yang sahih sebagai wujud semangat gotong royong",
      "Peserta didik mampu menganalisis perbedaan periwayatan hadis pada masa sahabat dan tabi‘in",
      "Peserta didik mampu memahami pentingnya penghimpunan hadis dalam Islam",
      "Peserta didik mampu menyebutkan tokoh-tokoh penting dalam kodifikasi hadis",
      "Peserta didik mampu menjelaskan tahapan sejarah penghimpunan hadis secara runtut"
    ],
    "a": 0
  },
  {
    "q": "4. Disajikan deskripsi kasus pengembangan materi tentang metode tafsir tematik, mahasiswa dapat menentukan rumusan indikator tujuan pembelajaran ranah sikap yang paling sesuai dengan materi supaya peserta didik memiliki sikap penerimaan terhadap tradisi. Dalam pengembangan materi Qur’an Hadis, seorang dosen menyajikan metode tafsir tematik (maudhu‘i) untuk membahas tema tertentu dalam Al-Qur’an dengan mengumpulkan ayat-ayat yang relevan. Dalam proses pembelajaran, dosen menekankan bahwa metode tafsir tematik tidak muncul secara tiba-tiba, tetapi merupakan bagian dari tradisi keilmuan Islam yang berkembang melalui kontribusi para ulama lintas generasi. Namun, sebagian peserta didik cenderung menganggap metode tafsir klasik kurang relevan dan lebih memilih pendekatan tafsir modern tanpa mempertimbangkan akar tradisinya. Oleh karena itu, dosen perlu merumuskan indikator tujuan pembelajaran ranah sikap yang mendorong peserta didik memiliki sikap terbuka dan menerima tradisi keilmuan Islam dalam memahami Al-Qur’an. Rumusan indikator tujuan pembelajaran ranah sikap yang sesuai dengan materi adalah …",
    "o": [
      "Peserta didik mampu menjelaskan langkah-langkah metode tafsir tematik",
      "Peserta didik menunjukkan sikap menghargai dan menerima metode tafsir tematik sebagai bagian dari tradisi keilmuan Islam",
      "Peserta didik mampu membandingkan tafsir tematik dengan metode tafsir lainnya",
      "Peserta didik mampu mengidentifikasi tokoh-tokoh pengembang tafsir tematik",
      "Peserta didik mampu menyusun makalah tentang penerapan tafsir tematik"
    ],
    "a": 1
  },
  {
    "q": "5. Disajikan deskripsi materi tentang konsep tawassuth dalam al-Quran dan hadis, mahasiswa dapat menentukan rumusan indikator tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan materi supaya peserta didik memiliki kemampuan berpikir dinamis dan inovatif. Guru menyajikan deskripsi materi tentang konsep tawassuth (moderasi) dalam Islam sebagai sikap beragama yang seimbang, tidak ekstrem, dan tetap berpegang pada prinsip ajaran. Guru mengaitkan konsep tersebut dengan tantangan kehidupan berbangsa di Indonesia yang majemuk serta perkembangan teknologi informasi yang mempengaruhi pola pikir dan sikap keagamaan generasi muda. Analisis yang paling tepat terhadap konsep tawassuth dalam konteks tersebut adalah …",
    "o": [
      "Tawassuth berarti mengurangi ketegasan dalam beragama",
      "Moderasi beragama melemahkan identitas keislaman",
      "Tawassuth hanya relevan dalam konteks sosial tertentu",
      "Tawassuth mendorong sikap beragama yang seimbang, adaptif, dan konstruktif dalam kehidupan kebangsaan",
      "Tawassuth bertentangan dengan kemajuan teknologi"
    ],
    "a": 3
  },
  {
    "q": "6. Disajikan deskripsi aktivitas pembelajaran guru dalam perencanaan tujuan pembelajaran materi nuzul al-Qur'an dengan pendekatan PBL, mahasiswa dapat menganalisis materi ajar tahapan atau sejarah turunnya Al-Quran berdasarkan struktur keilmuan pada perencanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik. Dalam mata kuliah Qur’an Hadis, dosen merencanakan pembelajaran materi Nuzul al-Qur’an dengan pendekatan Problem Based Learning (PBL). Mahasiswa diajak mengkaji sebuah permasalahan awal, yaitu beragamnya pemahaman masyarakat tentang tahapan turunnya Al-Qur’an (secara ijmālī dan tafrīqī) serta implikasinya terhadap pemahaman wahyu dan konteks sosial-historisnya. Dalam perencanaan pembelajaran, dosen menyusun tujuan agar mahasiswa tidak hanya mengetahui peristiwa Nuzul al-Qur’an secara kronologis, tetapi mampu menganalisis struktur keilmuan Ulum al-Qur’an, seperti perbedaan tahapan turunnya wahyu, periode Makkiyah–Madaniyah, dan relevansinya bagi pengembangan materi ajar. Perencanaan tersebut juga mempertimbangkan karakteristik mahasiswa yang heterogen, baik dari latar belakang pendidikan, kemampuan analitis, maupun pengalaman belajar sebelumnya. Berdasarkan stimulus tersebut, analisis yang PALING TEPAT terhadap perencanaan tujuan pembelajaran materi Nuzul al-Qur’an dengan pendekatan PBL adalah …",
    "o": [
      "Tujuan pembelajaran cukup diarahkan pada penguasaan definisi dan kronologi Nuzul al-Qur’an",
      "Materi Nuzul al-Qur’an sebaiknya disampaikan secara ceramah agar runtut dan mudah dipahami",
      "Pendekatan PBL kurang sesuai karena materi Nuzul al-Qur’an bersifat historis",
      "Tujuan pembelajaran difokuskan pada hafalan tahapan turunnya Al-Qur’an tanpa analisis keilmuan",
      "Tujuan pembelajaran perlu dirumuskan agar mahasiswa mampu menganalisis tahapan dan sejarah Nuzul al-Qur’an berdasarkan struktur keilmuan Ulum al-Qur’an serta sesuai dengan karakteristik mahasiswa"
    ],
    "a": 4
  },
  {
    "q": "7. Disajikan deskripsi aktivitas guru dalam pelaksanaan tujuan pembelajaran materi hadis dha'if dengan pendekatan PjBL, mahasiswa dapat menganalisis materi ajar kriteria hadis dhaif berdasarkan struktur keilmuan pada pelaksanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik. Dalam pelaksanaan pembelajaran Qur’an Hadis pada materi hadis ḍa‘īf, dosen menerapkan pendekatan Project Based Learning (PjBL). Dosen membagi mahasiswa ke dalam beberapa kelompok dan menugaskan mereka menganalisis contoh hadis yang beredar di masyarakat dan media digital. Setiap kelompok diminta menyusun produk berupa klasifikasi hadis berdasarkan kriteria ke-ḍa‘īf-an, seperti keterputusan sanad, kelemahan perawi, atau cacat pada matan, dengan merujuk pada struktur keilmuan Ulum al-Hadis. Selama pelaksanaan pembelajaran, dosen berperan sebagai fasilitator yang memberi penguatan konsep, sementara mahasiswa dengan kemampuan analitis yang beragam menunjukkan tingkat pemahaman yang berbeda dalam mengidentifikasi kriteria hadis ḍa‘īf. Berdasarkan stimulus tersebut, analisis yang sesuai terhadap materi ajar dan pelaksanaan tujuan pembelajaran hadis ḍa‘īf dengan pendekatan PjBL adalah …",
    "o": [
      "Materi hadis ḍa‘īf sebaiknya disampaikan melalui ceramah agar kriteria keilmuan tidak disalahpahami",
      "Pendekatan PjBL kurang sesuai karena kriteria hadis ḍa‘īf bersifat teoretis",
      "Pelaksanaan pembelajaran cukup menekankan hasil proyek tanpa memperhatikan proses analisis mahasiswa",
      "Kriteria hadis ḍa‘īf cukup dipahami melalui hafalan istilah keilmuan",
      "Pelaksanaan PjBL telah tepat karena mendorong mahasiswa menganalisis kriteria hadis ḍa‘īf berdasarkan struktur keilmuan Ulum al-Hadis serta menyesuaikan dengan karakteristik mahasiswa"
    ],
    "a": 4
  },
  {
    "q": "8. Disajikan narasi kasus guru melakukan evaluasi pembelajaran materi keotentikan hadis dengan pendekatan DBL, mahasiswa dapat menguraikan materi ajar macam-macam hadis dalam evaluasi tujuan pembelajaran sesuai dengan karakteristik peserta didik. Dalam pembelajaran Qur’an Hadis pada materi keotentikan hadis, seorang guru menerapkan pendekatan Discovery Based Learning (DBL). Peserta didik diajak menelusuri berbagai contoh hadis dari sumber yang berbeda, kemudian mengidentifikasi tingkat keotentikannya berdasarkan kriteria sanad dan matan. Pada tahap evaluasi pembelajaran, guru ingin menilai sejauh mana peserta didik mampu menguraikan macam-macam hadis serta memahami perbedaan karakteristik hadis ṣaḥīḥ, ḥasan, dan ḍa‘īf. Guru juga mempertimbangkan karakteristik peserta didik yang beragam, baik dari kemampuan analitis maupun latar belakang pemahaman keagamaan. Berdasarkan stimulus tersebut, bentuk evaluasi pembelajaran yang mencerminkan tujuan pembelajaran adalah …",
    "o": [
      "Tes hafalan definisi hadis ṣaḥīḥ, ḥasan, dan ḍa‘īf",
      "Ulangan tertulis yang menekankan istilah-istilah Ulum al-Hadis",
      "Tugas analisis yang meminta peserta didik menguraikan perbedaan macam-macam hadis berdasarkan tingkat keotentikannya",
      "Penilaian akhir berupa rangkuman materi dari buku teks",
      "Tes pilihan ganda yang mengukur kronologi periwayatan hadis"
    ],
    "a": 2
  },
  {
    "q": "9. Disajikan pernyataan praktik pedagogi tentang perencanaan materi kajian tafsir al-Qur'an secara logis dengan pendekatan TPACK, mahasiswa dapat menentukan alur materi ajar metode tafsir tematik dalam perencanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik. Dalam perencanaan pembelajaran Qur’an Hadis, seorang guru menyusun materi kajian tafsir al-Qur’an dengan metode tematik. Guru mempertimbangkan karakteristik peserta didik yang masih berada pada tahap awal memahami metode tafsir, sehingga diperlukan alur materi yang runtut dan logis. Guru juga memanfaatkan pendekatan TPACK dengan memadukan penguasaan materi tafsir, strategi pembelajaran yang sesuai, serta penggunaan media digital sederhana untuk membantu pemahaman peserta didik. Berdasarkan stimulus tersebut, alur materi ajar metode tafsir tematik yang dapat diterapkan dalam perencanaan tujuan pembelajaran adalah …",
    "o": [
      "Menentukan tema kajian → mengumpulkan ayat-ayat terkait → mengkaji makna ayat → menyimpulkan pesan tematik",
      "Menghafalkan ayat-ayat Al-Qur’an → menentukan tema → menyajikan tafsir → evaluasi",
      "Mengkaji pendapat mufasir → menentukan tema → mengelompokkan ayat → penilaian",
      "Menyajikan tafsir ayat secara langsung → diskusi → penugasan",
      "Menentukan media pembelajaran → evaluasi → penyampaian materi"
    ],
    "a": 0
  },
  {
    "q": "10. Disajikan pernyataan praktik pedagogi tentang pelaksanaan materi ajar konsep tawassuth secara logis dengan pendekatan DL, mahasiswa dapat menentukan alur materi ajar tetang konsep tawassuth dalam al-Quran dan Hadis pada pelaksanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik. Dalam pelaksanaan pembelajaran Qur’an Hadis, seorang guru mengajarkan konsep tawassuth (moderasi) berdasarkan ayat-ayat Al-Qur’an dan hadis yang relevan. Guru menerapkan pendekatan Discovery Learning (DL) dengan melibatkan peserta didik dalam kegiatan mengamati teks ayat dan hadis, mengidentifikasi pesan utama, serta menemukan makna tawassuth secara bertahap. Peserta didik yang diajar memiliki karakteristik masih berada pada tahap awal memahami konsep moderasi beragama, sehingga guru perlu menyusun alur materi ajar yang logis dan bertahap agar tujuan pembelajaran dapat tercapai secara optimal. Berdasarkan stimulus tersebut, alur materi ajar yang dapat diterapkan guru dalam pelaksanaan tujuan pembelajaran adalah …",
    "o": [
      "Menyampaikan definisi tawassuth → memberikan evaluasi → diskusi",
      "Menghafalkan ayat dan hadis → penugasan → penilaian akhir",
      "Menyajikan ceramah tentang moderasi → tanya jawab",
      "Mengamati ayat dan hadis tentang tawassuth → mengidentifikasi pesan moderasi → menyimpulkan makna tawassuth dalam kehidupan sehari-hari",
      "Memberikan rangkuman konsep tawassuth → tes tertulis"
    ],
    "a": 3
  },
  {
    "q": "11. Disajikan pernyataan praktik pedagogi tentang pelaksanaan materi ajar hermeneutik secara logis dengan model pelayanan konseling, mahasiswa dapat menentukan alur materi ajar Hermeneutik dalam Kajian al-Qur'an dalam mengevaluasi tujuan. [NOTE: Pertanyaan ini tampaknya tidak lengkap dalam sumber file]",
    "o": [
      "Teks pilihan 1",
      "Teks pilihan 2",
      "Teks pilihan 3",
      "Teks pilihan 4",
      "Teks pilihan 5"
    ],
    "a": 0
  },
  {
    "q": "12. Pertanyaan nomor 12 tidak ditemukan dalam file lampiran.",
    "o": [
      "Teks pilihan 1",
      "Teks pilihan 2",
      "Teks pilihan 3",
      "Teks pilihan 4",
      "Teks pilihan 5"
    ],
    "a": 0
  },
  {
    "q": "13. Pertanyaan nomor 13 tidak ditemukan dalam file lampiran.",
    "o": [
      "Teks pilihan 1",
      "Teks pilihan 2",
      "Teks pilihan 3",
      "Teks pilihan 4",
      "Teks pilihan 5"
    ],
    "a": 0
  },
  {
    "q": "14. Pertanyaan nomor 14 tidak ditemukan dalam file lampiran.",
    "o": [
      "Teks pilihan 1",
      "Teks pilihan 2",
      "Teks pilihan 3",
      "Teks pilihan 4",
      "Teks pilihan 5"
    ],
    "a": 0
  },
  {
    "q": "15. Pertanyaan nomor 15 tidak ditemukan dalam file lampiran.",
    "o": [
      "Teks pilihan 1",
      "Teks pilihan 2",
      "Teks pilihan 3",
      "Teks pilihan 4",
      "Teks pilihan 5"
    ],
    "a": 0
  },
  {
    "q": "16. Disajikan kasus tentang perkembangan tafsir al-Qur'an, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah pengetahuan yang sesuai dengan indikator supaya peserta didik mampu berpikir kritis. Dalam pembelajaran Qur’an Hadis, guru menyajikan kasus tentang perkembangan tafsir Al-Qur’an, mulai dari tafsir pada masa sahabat yang cenderung ijmālī hingga tafsir modern yang lebih tematik dan kontekstual. Guru ingin peserta didik memahami bahwa perbedaan pendekatan tafsir dipengaruhi oleh konteks zaman dan kebutuhan umat. Berdasarkan materi tersebut, rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan indikator berpikir kritis adalah …",
    "o": [
      "Peserta didik mampu menyebutkan tokoh-tokoh mufasir klasik dan modern",
      "Peserta didik mampu menghafal tahapan sejarah perkembangan tafsir",
      "Peserta didik mampu menganalisis latar belakang historis dan sosiologis yang mempengaruhi corak penafsiran Al-Qur’an",
      "Peserta didik mampu menjelaskan definisi tafsir dan takwil",
      "Peserta didik mampu mengidentifikasi kitab-kitab tafsir yang masyhur"
    ],
    "a": 2
  },
  {
    "q": "17. Disajikan narasi tentang jenis-jenis hadis, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah keterampilan yang sesuai dengan indikator supaya peserta didik memiliki semangat gotong royong. Guru Qur’an Hadis menyajikan narasi tentang jenis-jenis hadis berdasarkan kualitasnya (ṣaḥīḥ, ḥasan, dan ḍa‘īf). Guru menekankan pentingnya verifikasi hadis agar umat terhindar dari pemahaman yang keliru. Guru ingin pembelajaran tidak hanya kognitif, tetapi juga memupuk nilai gotong royong melalui aktivitas bersama. Rumusan tujuan pembelajaran ranah keterampilan yang tepat sesuai dengan indikator adalah …",
    "o": [
      "Peserta didik mampu menyebutkan kriteria hadis ṣaḥīḥ",
      "Peserta didik mampu bekerja sama dalam kelompok untuk membuat infografis klasifikasi hadis dan contohnya",
      "Peserta didik mampu menjelaskan sejarah pembukuan hadis",
      "Peserta didik mampu menghafal 10 hadis tentang keutamaan ilmu",
      "Peserta didik mampu menulis esai tentang perawi hadis"
    ],
    "a": 1
  },
  {
    "q": "18. Disajikan stimulus materi tentang metode tafsir, mahasiswa dapat menentukan tujuan sikap yang tepat supaya peserta didik memiliki sikap disiplin dalam memahami Al-Qur'an. Guru menyajikan materi tentang berbagai metode tafsir (tahlili, ijmali, muqarin, maudhu‘i). Guru ingin menekankan bahwa memahami Al-Qur’an memerlukan kedisiplinan metode agar tidak terjadi salah tafsir. Rumusan tujuan sikap yang tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan langkah-langkah metode tahlili",
      "Peserta didik mampu membandingkan metode tafsir tahlili dan maudhu‘i",
      "Peserta didik mampu membiasakan diri menggunakan metode tafsir yang tepat dan sistematis dalam memahami ayat",
      "Peserta didik mampu menyebutkan jenis-jenis metode tafsir",
      "Peserta didik mampu menyusun makalah tafsir"
    ],
    "a": 2
  },
  {
    "q": "19. Disajikan kasus tentang penggunaan media sosial, mahasiswa dapat menentukan tujuan pengetahuan yang menuntut berpikir kritis tentang etika berkomunikasi sesuai hadis. Guru menyajikan kasus tentang maraknya hoax dan ujaran kebencian di media sosial. Guru ingin siswa menganalisis kasus tersebut berdasarkan hadis tentang menjaga lisan dan kebenaran informasi. Rumusan tujuan pengetahuan yang tepat adalah …",
    "o": [
      "Peserta didik mampu menghafal hadis tentang menjaga lisan",
      "Peserta didik mampu menjelaskan pengertian hoax",
      "Peserta didik mampu menganalisis dampak penyebaran berita bohong di media sosial ditinjau dari hadis",
      "Peserta didik mampu menyebutkan macam-macam hadis",
      "Peserta didik mampu memperagakan cara berkomunikasi yang baik"
    ],
    "a": 2
  },
  {
    "q": "20. Disajikan materi tentang perilaku toleran, mahasiswa dapat menentukan tujuan sikap yang meningkatkan solidaritas antarumat. Rumusan tujuan sikap yang tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan pengertian toleransi",
      "Peserta didik mampu menyebutkan dalil tentang toleransi",
      "Peserta didik mampu menunjukkan sikap menghormati perbedaan dan solidaritas sosial dalam kehidupan sehari-hari",
      "Peserta didik mampu menghafal ayat tentang toleransi",
      "Peserta didik mampu menulis esai tentang toleransi"
    ],
    "a": 2
  },
  {
    "q": "21. Disajikan materi tentang kewajiban menuntut ilmu, mahasiswa dapat menentukan tujuan keterampilan yang membangun semangat gotong royong. Rumusan tujuan keterampilan yang tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan ayat tentang ilmu",
      "Peserta didik mampu menjelaskan keutamaan menuntut ilmu",
      "Peserta didik mampu mensimulasikan kegiatan tutor sebaya (tutor sebaya) dalam kelompok belajar",
      "Peserta didik mampu menghafal hadis menuntut ilmu",
      "Peserta didik mampu menulis makalah tentang ilmu"
    ],
    "a": 2
  },
  {
    "q": "22. Disajikan materi tentang etika lingkungan dalam Islam, mahasiswa dapat menentukan tujuan sikap yang meningkatkan kepedulian terhadap lingkungan. Rumusan tujuan sikap yang tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan pengertian ekologi Islam",
      "Peserta didik mampu menyebutkan dalil tentang lingkungan",
      "Peserta didik mampu menunjukkan sikap peduli dan bertanggung jawab terhadap kebersihan dan kelestarian lingkungan",
      "Peserta didik mampu menghafal ayat tentang lingkungan",
      "Peserta didik mampu menulis poster lingkungan"
    ],
    "a": 2
  },
  {
    "q": "23. Disajikan materi tentang sejarah Islam Nusantara, mahasiswa dapat menentukan tujuan pengetahuan yang menuntut berpikir dinamis. Rumusan tujuan yang tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan tokoh Islam Nusantara",
      "Peserta didik mampu menjelaskan sejarah masuknya Islam",
      "Peserta didik mampu menganalisis peran Islam dalam membangun kebudayaan Nusantara",
      "Peserta didik mampu menghafal tahun-tahun sejarah",
      "Peserta didik mampu menyebutkan kerajaan Islam"
    ],
    "a": 2
  },
  {
    "q": "24. Disajikan materi tentang pernikahan, mahasiswa dapat menentukan tujuan keterampilan yang mendorong tanggung jawab sosial. Rumusan tujuan keterampilan yang tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan rukun nikah",
      "Peserta didik mampu menjelaskan syarat nikah",
      "Peserta didik mampu merancang kegiatan sosialisasi mengenai pentingnya pendewasaan usia perkawinan",
      "Peserta didik mampu menghafal ayat pernikahan",
      "Peserta didik mampu menulis laporan tentang pernikahan"
    ],
    "a": 2
  },
  {
    "q": "25. Disajikan materi tentang ekonomi syariah, mahasiswa dapat menentukan tujuan pengetahuan yang menuntut berpikir kritis. Rumusan tujuan yang tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan prinsip ekonomi Islam",
      "Peserta didik mampu menjelaskan definisi bank syariah",
      "Peserta didik mampu menganalisis perbedaan sistem bagi hasil syariah dan sistem bunga konvensional",
      "Peserta didik mampu menghafal istilah ekonomi",
      "Peserta didik mampu menyebutkan tokoh ekonomi"
    ],
    "a": 2
  },
  {
    "q": "26. Disajikan materi tentang zakat, mahasiswa dapat menentukan tujuan sikap yang tepat supaya peserta didik memiliki sikap jujur dan amanah. Rumusan tujuan yang tepat adalah …",
    "o": [
      "Peserta didik mampu menghitung zakat",
      "Peserta didik mampu menjelaskan pengertian zakat",
      "Peserta didik mampu membiasakan diri bersikap jujur dan amanah dalam mengelola atau menyalurkan zakat",
      "Peserta didik mampu menyebutkan mustahiq zakat",
      "Peserta didik mampu mendemonstrasikan penyerahan zakat"
    ],
    "a": 2
  },
  {
    "q": "27. Disajikan materi tentang waris, mahasiswa dapat menentukan tujuan keterampilan yang membangun kemampuan berpikir terstruktur. Rumusan tujuan yang tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan pengertian waris",
      "Peserta didik mampu menyebutkan ahli waris",
      "Peserta didik mampu mensimulasikan pembagian warisan berdasarkan ilmu faraidh dengan terstruktur",
      "Peserta didik mampu menghafal dalil waris",
      "Peserta didik mampu menulis laporan tentang waris"
    ],
    "a": 2
  },
  {
    "q": "28. Disajikan materi tentang haji, mahasiswa dapat menentukan tujuan sikap yang meningkatkan kekhusyukan dan persaudaraan ibadah. Rumusan tujuan yang tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan perbedaan haji dan umrah",
      "Peserta didik mampu menyebutkan rukun haji",
      "Peserta didik mampu menunjukkan sikap khusyuk, sabar, dan semangat persaudaraan dalam simulasi ibadah haji",
      "Peserta didik mampu menghafal bacaan haji",
      "Peserta didik mampu memperagakan manasik haji"
    ],
    "a": 2
  },
  {
    "q": "29. Disajikan materi tentang moderasi beragama, mahasiswa dapat menentukan tujuan pengetahuan yang menuntut analisis. Rumusan tujuan yang tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan pengertian moderasi",
      "Peserta didik mampu menyebutkan contoh sikap moderat",
      "Peserta didik mampu menganalisis ayat-ayat Al-Qur’an tentang konsep wasathiyah dalam kehidupan berbangsa",
      "Peserta didik mampu menghafal dalil moderasi",
      "Peserta didik mampu menyebutkan prinsip moderasi"
    ],
    "a": 2
  },
  {
    "q": "30. Disajikan materi tentang akhlak terpuji, mahasiswa dapat menentukan tujuan sikap yang meningkatkan kedisiplinan dan tanggung jawab. Rumusan tujuan yang tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan jenis akhlak terpuji",
      "Peserta didik mampu menyebutkan manfaat akhlak terpuji",
      "Peserta didik mampu membiasakan diri disiplin dan bertanggung jawab dalam kehidupan sekolah dan masyarakat",
      "Peserta didik mampu memperagakan akhlak terpuji",
      "Peserta didik mampu menghafal ayat akhlak"
    ],
    "a": 2
  },
  {
    "q": "31. Disajikan materi tentang perilaku jujur dalam kehidupan sehari-hari, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah sikap yang paling sesuai dengan indikator tujuan supaya peserta didik dapat meningkatkan keimanan, ketakwaan dan akhlak mulia. Guru menyajikan deskripsi tentang perilaku jujur yang didasarkan pada ayat Al-Qur’an dan hadis. Guru menjelaskan dampak positif kejujuran terhadap ketenangan jiwa dan kepercayaan sosial, serta mengaitkannya dengan tantangan perilaku tidak jujur di lingkungan sekolah dan masyarakat. Peserta didik diminta menganalisis situasi yang menguji kejujuran. Berdasarkan stimulus tersebut, rumusan tujuan pembelajaran ranah sikap yang paling sesuai adalah…",
    "o": [
      "Peserta didik mampu menghafal dalil tentang kejujuran",
      "Peserta didik mampu menjelaskan dampak negatif berbohong",
      "Peserta didik mampu menunjukkan perilaku jujur dalam perkataan dan perbuatan sehari-hari",
      "Peserta didik mampu mengidentifikasi contoh perilaku tidak jujur",
      "Peserta didik mampu menceritakan kisah sahabat yang jujur"
    ],
    "a": 2
  },
  {
    "q": "32. Disajikan pernyataan materi tentang konsep dasar Asmaul Husna, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan indikator supaya peserta didik mampu berpikir kritis. Dalam sebuah pembelajaran tentang Asmaul Husna, seorang guru mengajukan pertanyaan-pertanyaan analitis kepada peserta didik, seperti: \"Apa makna Al-Hakim (Maha Bijaksana) dalam kehidupan bermasyarakat?\" atau \"Bagaimana sifat Ar-Rahim (Maha Penyayang) dapat diinternalisasikan dalam perilaku sosial?\". Guru tersebut bertujuan agar peserta didik tidak hanya menghafal nama-nama Allah, tetapi juga berpikir kritis tentang nilai-nilai yang terkandung di dalamnya dan penerapannya. Berdasarkan pendekatan tersebut, rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai adalah:",
    "o": [
      "Peserta didik mampu menghafal nama-nama Asmaul Husna dengan baik.",
      "Peserta didik mampu mendefinisikan arti setiap Asmaul Husna.",
      "Peserta didik mampu mengidentifikasi hubungan antara sifat-sifat Asmaul Husna dengan perilaku manusia.",
      "Peserta didik mampu mendemonstrasikan pelafalan Asmaul Husna dengan tartil.",
      "Peserta didik mampu menyusun daftar Asmaul Husna berdasarkan kategori sifat."
    ],
    "a": 2
  },
  {
    "q": "33. Disajikan narasi tentang perilaku gotong royong, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah keterampilan yang sesuai dengan indikator supaya peserta didik memiliki semangat gotong royong. Guru Qur’an Hadis menyajikan narasi tentang pentingnya saling membantu dalam kebaikan berdasarkan ayat Al-Qur’an. Guru ingin pembelajaran tidak hanya kognitif, tetapi juga memupuk nilai gotong royong melalui aktivitas bersama. Rumusan tujuan pembelajaran ranah keterampilan yang tepat sesuai dengan indikator adalah …",
    "o": [
      "Peserta didik mampu menjelaskan makna tolong menolong",
      "Peserta didik mampu mensimulasikan kerja sama dalam kegiatan sosial di lingkungan sekolah",
      "Peserta didik mampu menyebutkan dalil tentang kerja sama",
      "Peserta didik mampu menghafal ayat tentang saling membantu",
      "Peserta didik mampu menulis esai tentang gotong royong"
    ],
    "a": 1
  },
  {
    "q": "34. Disajikan stimulus materi tentang perilaku menghargai waktu, mahasiswa dapat menentukan tujuan sikap yang tepat supaya peserta didik memiliki sikap disiplin dalam memanfaatkan waktu. Guru menyajikan materi tentang pentingnya waktu dalam pandangan Al-Qur’an dan hadis. Guru ingin menekankan bahwa memanfaatkan waktu secara efektif adalah bagian dari ketakwaan. Rumusan tujuan sikap yang tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan pengertian waktu",
      "Peserta didik mampu menyebutkan dalil tentang waktu",
      "Peserta didik mampu membiasakan diri disiplin dalam memanfaatkan waktu untuk kegiatan produktif",
      "Peserta didik mampu mengidentifikasi contoh membuang waktu",
      "Peserta didik mampu menceritakan kisah tokoh yang menghargai waktu"
    ],
    "a": 2
  },
  {
    "q": "35. Disajikan kasus tentang konflik antarteman, mahasiswa dapat menentukan tujuan pengetahuan yang menuntut berpikir kritis tentang penyelesaian konflik sesuai hadis. Guru menyajikan kasus tentang perselisihan di antara siswa. Guru ingin siswa menganalisis kasus tersebut berdasarkan hadis tentang perdamaian dan persaudaraan. Rumusan tujuan pengetahuan yang tepat adalah …",
    "o": [
      "Peserta didik mampu menghafal hadis tentang perdamaian",
      "Peserta didik mampu menjelaskan pengertian konflik",
      "Peserta didik mampu menganalisis solusi penyelesaian konflik antarteman berdasarkan nilai-nilai hadis",
      "Peserta didik mampu menyebutkan macam-macam hadis tentang persaudaraan",
      "Peserta didik mampu memperagakan cara meminta maaf"
    ],
    "a": 2
  },
  {
    "q": "36. Disajikan materi tentang kewajiban berbakti kepada orang tua, mahasiswa dapat menentukan tujuan sikap yang meningkatkan rasa hormat dan tanggung jawab. Rumusan tujuan sikap yang tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan pengertian berbakti",
      "Peserta didik mampu menyebutkan dalil tentang orang tua",
      "Peserta didik mampu menunjukkan sikap hormat, patuh, dan tanggung jawab kepada orang tua dalam kehidupan sehari-hari",
      "Peserta didik mampu menghafal ayat tentang orang tua",
      "Peserta didik mampu menulis kisah inspiratif tentang orang tua"
    ],
    "a": 2
  },
  {
    "q": "37. Disajikan materi tentang bahaya perilaku bullying, mahasiswa dapat menentukan tujuan pengetahuan yang menuntut berpikir kritis tentang dampak sosial. Rumusan tujuan pengetahuan yang tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian bullying",
      "Peserta didik mampu menjelaskan jenis-jenis bullying",
      "Peserta didik mampu menganalisis dampak negatif bullying terhadap psikologis dan sosial korban berdasarkan nilai Al-Qur’an",
      "Peserta didik mampu menghafal ayat tentang larangan merendahkan orang lain",
      "Peserta didik mampu menyebutkan dasar hukum tentang bullying"
    ],
    "a": 2
  },
  {
    "q": "38. Disajikan materi tentang etika berkomunikasi, mahasiswa dapat menentukan tujuan keterampilan yang membangun semangat santun dan sopan. Rumusan tujuan keterampilan yang tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan dalil tentang etika berbicara",
      "Peserta didik mampu menjelaskan adab berbicara kepada orang yang lebih tua",
      "Peserta didik mampu mensimulasikan etika berkomunikasi yang santun dan sopan dalam diskusi kelompok",
      "Peserta didik mampu menghafal hadis tentang lisan",
      "Peserta didik mampu menulis esai tentang adab berbicara"
    ],
    "a": 2
  },
  {
    "q": "39. Disajikan materi tentang perilaku sabar, mahasiswa dapat menentukan tujuan sikap yang meningkatkan ketabahan menghadapi ujian. Rumusan tujuan sikap yang tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan pengertian sabar",
      "Peserta didik mampu menyebutkan jenis-jenis sabar",
      "Peserta didik mampu menunjukkan sikap sabar dan tabah dalam menghadapi kesulitan atau ujian dalam kehidupan",
      "Peserta didik mampu menghafal ayat tentang sabar",
      "Peserta didik mampu menceritakan kisah nabi yang sabar"
    ],
    "a": 2
  },
  {
    "q": "40. Disajikan materi tentang perilaku syukur, mahasiswa dapat menentukan tujuan pengetahuan yang menuntut berpikir kritis tentang nikmat Allah. Rumusan tujuan pengetahuan yang tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan dalil tentang syukur",
      "Peserta didik mampu menjelaskan pengertian syukur",
      "Peserta didik mampu menganalisis bentuk-bentuk syukur atas nikmat Allah dalam kehidupan sehari-hari",
      "Peserta didik mampu menghafal ayat tentang syukur",
      "Peserta didik mampu menyebutkan contoh syukur"
    ],
    "a": 2
  },
  {
    "q": "41. Disajikan materi tentang perilaku amanah, mahasiswa dapat menentukan tujuan keterampilan yang mendorong tanggung jawab dalam tugas. Rumusan tujuan keterampilan yang tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan rukun amanah",
      "Peserta didik mampu menjelaskan definisi amanah",
      "Peserta didik mampu merancang kegiatan kepanitiaan di sekolah yang menuntut tanggung jawab dan amanah",
      "Peserta didik mampu menghafal ayat amanah",
      "Peserta didik mampu menulis laporan tentang amanah"
    ],
    "a": 2
  },
  {
    "q": "42. Disajikan materi tentang perilaku toleran, mahasiswa dapat menentukan tujuan pengetahuan yang menuntut berpikir kritis tentang keberagaman. Rumusan tujuan pengetahuan yang tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan pengertian toleransi",
      "Peserta didik mampu menyebutkan dalil tentang perbedaan",
      "Peserta didik mampu menganalisis pentingnya sikap toleransi dalam menjaga persatuan dan kesatuan di masyarakat majemuk",
      "Peserta didik mampu menghafal ayat tentang toleransi",
      "Peserta didik mampu menyebutkan contoh toleransi"
    ],
    "a": 2
  },
  {
    "q": "43. Disajikan materi tentang perilaku disiplin, mahasiswa dapat menentukan tujuan sikap yang tepat supaya peserta didik memiliki sikap disiplin dalam beribadah. Rumusan tujuan yang tepat adalah …",
    "o": [
      "Peserta didik mampu menghitung waktu shalat",
      "Peserta didik mampu menjelaskan waktu ibadah",
      "Peserta didik mampu membiasakan diri disiplin dalam melaksanakan ibadah tepat waktu",
      "Peserta didik mampu menyebutkan manfaat ibadah",
      "Peserta didik mampu mendemonstrasikan gerakan shalat"
    ],
    "a": 2
  },
  {
    "q": "44. Disajikan materi tentang perilaku hemat, mahasiswa dapat menentukan tujuan keterampilan yang membangun kemampuan berpikir terstruktur tentang pengelolaan sumber daya. Rumusan tujuan keterampilan yang tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan pengertian hemat",
      "Peserta didik mampu menyebutkan dalil tentang boros",
      "Peserta didik mampu mensimulasikan pengelolaan uang jajan secara hemat dan terstruktur",
      "Peserta didik mampu menghafal ayat tentang hemat",
      "Peserta didik mampu menulis laporan tentang penggunaan uang"
    ],
    "a": 2
  },
  {
    "q": "45. Disajikan materi tentang perilaku kasih sayang, mahasiswa dapat menentukan tujuan sikap yang meningkatkan solidaritas antarmanusia. Rumusan tujuan sikap yang tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan pengertian kasih sayang",
      "Peserta didik mampu menyebutkan dalil tentang kasih sayang",
      "Peserta didik mampu menunjukkan sikap kasih sayang dan empati kepada sesama makhluk",
      "Peserta didik mampu menghafal ayat tentang kasih sayang",
      "Peserta didik mampu menceritakan kisah tentang kasih sayang"
    ],
    "a": 2
  },
  {
    "q": "46. Disajikan materi tentang perilaku optimis, mahasiswa dapat menentukan tujuan pengetahuan yang menuntut berpikir kritis tentang harapan. Rumusan tujuan pengetahuan yang tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan pengertian optimis",
      "Peserta didik mampu menyebutkan manfaat optimis",
      "Peserta didik mampu menganalisis pentingnya sikap optimis dalam menghadapi tantangan hidup berdasarkan nilai Islam",
      "Peserta didik mampu menghafal ayat tentang harapan",
      "Peserta didik mampu menyebutkan contoh optimis"
    ],
    "a": 2
  },
  {
    "q": "47. Disajikan materi tentang perilaku pemaaf, mahasiswa dapat menentukan tujuan keterampilan yang mendorong perdamaian. Rumusan tujuan keterampilan yang tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan rukun maaf",
      "Peserta didik mampu menyebutkan dalil tentang memaafkan",
      "Peserta didik mampu merancang skenario drama tentang penyelesaian konflik dengan sikap pemaaf",
      "Peserta didik mampu menghafal ayat tentang maaf",
      "Peserta didik mampu menulis cerita tentang pemaaf"
    ],
    "a": 2
  },
  {
    "q": "48. Disajikan materi tentang perilaku tanggung jawab, mahasiswa dapat menentukan tujuan pengetahuan yang menuntut berpikir kritis tentang kewajiban. Rumusan tujuan pengetahuan yang tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan pengertian tanggung jawab",
      "Peserta didik mampu menyebutkan jenis-jenis tanggung jawab",
      "Peserta didik mampu mengevaluasi dampak perilaku bertanggung jawab terhadap diri sendiri dan orang lain",
      "Peserta didik mampu menghafal dalil tentang tanggung jawab",
      "Peserta didik mampu menyebutkan contoh tanggung jawab"
    ],
    "a": 2
  },
  {
    "q": "49. Disajikan materi tentang perilaku rendah hati (tawadhu), mahasiswa dapat menentukan tujuan keterampilan yang meningkatkan kepedulian sosial. Rumusan tujuan keterampilan yang tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan pengertian rendah hati",
      "Peserta didik mampu menyebutkan tanda-tanda sombong",
      "Peserta didik mampu memperagakan perilaku rendah hati dalam interaksi sosial sehari-hari",
      "Peserta didik mampu menghafal ayat tentang rendah hati",
      "Peserta didik mampu menyebutkan lawan kata rendah hati"
    ],
    "a": 2
  },
  {
    "q": "50. Disajikan materi tentang perilaku berani (syaja'ah), mahasiswa dapat menentukan tujuan sikap yang meningkatkan keberanian menegakkan kebenaran. Rumusan tujuan sikap yang tepat adalah …",
    "o": [
      "Peserta didik mampu menjelaskan pengertian berani",
      "Peserta didik mampu menyebutkan dalil tentang keberanian",
      "Peserta didik mampu menunjukkan sikap berani menegakkan kebenaran dan keadilan dalam kehidupan sekolah",
      "Peserta didik mampu menghafal ayat tentang berani",
      "Peserta didik mampu menulis esai tentang berani"
    ],
    "a": 2
  }
]
