[
  {
    "q": "Seorang guru menjelaskan kedudukan Al-Qur'an sebagai pedoman utama dalam ajaran Islam, kemudian memberikan contoh perbedaan antara wahyu, ilham, dan bimbingan (ta'lim) dalam berbagai situasi kehidupan modern. Setelah itu, peserta didik diajak melakukan refleksi tentang pentingnya menjadikan Al-Qur'an sebagai rujukan perilaku sehari-hari. Tujuan pembelajaran yang paling sesuai dengan rangkaian kegiatan tersebut adalah:",
    "o": [
      "Peserta didik mampu mengidentifikasi perbedaan konsep wahyu, ilham, dan ta'lim dengan tepat.",
      "Peserta didik mampu menyebutkan definisi dasar tentang Al-Qur'an serta jenis-jenis petunjuk Allah.",
      "Peserta didik mampu memperkuat keimanan, ketakwaan, dan perilaku terpuji melalui pemahaman terhadap fungsi Al-Qur'an.",
      "Peserta didik mampu membuat ringkasan materi mengenai kedudukan Al-Qur'an sebagai pedoman hidup.",
      "Peserta didik mampu mengumpulkan sumber pustaka terkait konsep wahyu, ilham, dan bimbingan dalam Islam."
    ],
    "a": 3
  },
  {
    "q": "Berdasarkan kisi-kisi tentang pernyataan materi pemahaman Ulum al-Hadis, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan indikator supaya peserta didik mampu berpikir kritis.",
    "o": [
      "Peserta didik mampu menghafal definisi Ulum al-Hadis.",
      "Peserta didik mampu menyalin sejarah perkembangan hadis.",
      "Peserta didik mampu menganalisis keotentikan hadis menggunakan kaidah Ulum al-Hadis.",
      "Peserta didik mampu menyebutkan nama-nama perawi hadis.",
      "Peserta didik mampu membuat poster tentang hadis."
    ],
    "a": 3
  },
  {
    "q": "Berdasarkan kisi-kisi tentang pernyataan materi sejarah pertumbuhan dan penghimpunan hadis, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai dengan indikator supaya peserta didik memiliki semangat gotong royong.",
    "o": [
      "Peserta didik mampu menuliskan sejarah pertumbuhan hadis.",
      "Peserta didik mampu membaca buku sejarah hadis.",
      "Peserta didik mampu membuat proyek pameran lini masa sejarah penghimpunan hadis secara berkelompok.",
      "Peserta didik mampu menjawab soal tentang sejarah hadis.",
      "Peserta didik mampu mendengarkan ceramah tentang sejarah hadis."
    ],
    "a": 3
  },
  {
    "q": "Berdasarkan kisi-kisi tentang deskripsi kasus pengembangan materi metode tafsir tematik, mahasiswa dapat menentukan rumusan indikator tujuan pembelajaran ranah sikap yang paling sesuai dengan materi supaya peserta didik memiliki sikap penerimaan terhadap tradisi.",
    "o": [
      "Peserta didik mampu menjelaskan pengertian tafsir tematik.",
      "Peserta didik mampu menghargai keragaman penafsiran ayat Al-Qur'an dalam konteks budaya masyarakat.",
      "Peserta didik mampu menyebutkan langkah-langkah tafsir tematik.",
      "Peserta didik mampu membuat ringkasan metode tafsir.",
      "Peserta didik mampu menghafal ayat-ayat bertema tertentu."
    ],
    "a": 2
  },
  {
    "q": "Berdasarkan kisi-kisi tentang diskripsi materi konsep tawassuth dalam al-Quran dan hadis, mahasiswa dapat menentukan rumusan indikator tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan materi supaya peserta didik memiliki kemampuan berpikir dinamis dan inovatif.",
    "o": [
      "Peserta didik mampu menghafal pengertian tawassuth.",
      "Peserta didik mampu menyebutkan dalil tentang tawassuth.",
      "Peserta didik mampu menganalisis contoh perilaku tawassuth dalam kehidupan modern.",
      "Peserta didik mampu menyalin ayat tentang tawassuth.",
      "Peserta didik mampu menggambar simbol keseimbangan."
    ],
    "a": 3
  },
  {
    "q": "Berdasarkan kisi-kisi tentang deskripsi aktivitas pembelajaran guru dalam perencanaan materi nuzul alQur'an dengan pendekatan PBL, mahasiswa dapat menganalisis materi ajar tahapan atau sejarah turunnya AlQuran berdasarkan struktur keilmuan pada perencanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik.",
    "o": [
      "Peserta didik mampu menghafal tahun turunnya Al-Qur'an.",
      "Peserta didik mampu menyebutkan tempat turunnya Al-Qur'an.",
      "Peserta didik mampu memecahkan masalah perbedaan pendapat tentang ayat pertama yang turun.",
      "Peserta didik mampu menyalin sejarah nuzul al-Qur'an.",
      "Peserta didik mampu membaca cerita nuzul al-Qur'an."
    ],
    "a": 3
  },
  {
    "q": "Berdasarkan kisi-kisi tentang deskripsi aktivitas guru dalam pelaksanaan pembelajaran materi hadis dha'if dengan pendekatan PjBL, mahasiswa dapat menganalisis materi ajar kriteria hadis dhaif berdasarkan struktur keilmuan pada pelaksanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik.",
    "o": [
      "Peserta didik mampu menghafal definisi hadis dhaif.",
      "Peserta didik mampu menyebutkan jenis-jenis hadis dhaif.",
      "Peserta didik mampu membuat proyek infografis tentang kriteria hadis dhaif dan dampaknya.",
      "Peserta didik mampu menyalin hadis dhaif.",
      "Peserta didik mampu membaca buku tentang hadis."
    ],
    "a": 3
  },
  {
    "q": "Berdasarkan kisi-kisi tentang narasi kasus guru melakukan evaluasi pembelajaran materi keotentikan hadis dengan pendekatan DBL, mahasiswa dapat menguraikan materi ajar macam-macam hadis dalam evaluasi tujuan pembelajaran sesuai dengan karakteristik peserta didik.",
    "o": [
      "Peserta didik mampu mengevaluasi keotentikan sebuah hadis berdasarkan sanad dan matan menggunakan kasus nyata.",
      "Peserta didik mampu menyebutkan macam-macam hadis.",
      "Peserta didik mampu menghafal pengertian hadis sahih.",
      "Peserta didik mampu menyalin materi keotentikan hadis.",
      "Peserta didik mampu membaca hadis di depan kelas."
    ],
    "a": 1
  },
  {
    "q": "Berdasarkan kisi-kisi tentang pernyataan praktik pedagogi tentang perencanaan materi kajian tafsir al-Qur'an secara logis dengan pendekatan TPACK, mahasiswa dapat menentukan alur materi ajar metode tafsir tematik dalam perencanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik.",
    "o": [
      "Peserta didik mampu menyusun alur penafsiran ayat bertema tertentu menggunakan aplikasi digital.",
      "Peserta didik mampu menghafal langkah tafsir tematik.",
      "Peserta didik mampu menyebutkan tokoh tafsir.",
      "Peserta didik mampu membaca tafsir secara manual.",
      "Peserta didik mampu menyalin ayat tafsir."
    ],
    "a": 1
  },
  {
    "q": "Berdasarkan kisi-kisi tentang pernyataan praktik pedagogi tentang pelaksanaan materi ajar konsep tawassuth secara logis dengan pendekatan DL, mahasiswa dapat menentukan alur materi ajar tetang konsep tawassuth dalam al-Quran dan Hadis pada pelaksanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik.",
    "o": [
      "Peserta didik mampu menghafal dalil tawassuth.",
      "Peserta didik mampu menyebutkan perilaku tawassuth.",
      "Peserta didik mampu menyalin materi tawassuth.",
      "Peserta didik mampu merancang alur penyelesaian masalah sosial kontemporer dengan menerapkan nilai tawassuth.",
      "Peserta didik mampu membaca buku tentang tawassuth."
    ],
    "a": 4
  },
  {
    "q": "Disajikan pernyataan praktik pedagogi tentang pelaksanaan materi ajar hermeneutik secara logis dengan model pelayanan konseling, mahasiswa dapat menentukan alur materi ajar Hermeneutik dalam Kajian al-Qur'an dalam mengevaluasi tujuan pembelajaran sesuai dengan karakteristik peserta didik.",
    "o": [
      "Mengabaikan konteks sejarah dalam penafsiran.",
      "Melakukan refleksi diri tentang bagaimana hermeneutik membantu memahami teks ayat dalam situasi konseling.",
      "Menghafal definisi hermeneutik.",
      "Menulis ulang ayat-ayat Al-Qur'an.",
      "Membaca buku sejarah penafsiran saja."
    ],
    "a": 2
  },
  {
    "q": "Disajikan pernyataan praktik pedagogi tentang pelaksanaan program penguatan profile pelajar pancasila (P5) secara logis, mahasiswa dapat menentukan pengembangan materi ajar nilai-nilai P5 dalam merencanakan tujuan pembelajaran sesuai dengan karakteristik peserta didik.",
    "o": [
      "Membuat materi yang hanya berfokus pada teori Pancasila.",
      "Mengembangkan proyek yang relevan dengan lingkungan sekolah dan kehidupan sehari-hari.",
      "Mengurangi interaksi sosial antar siswa.",
      "Menghafal sila-sila Pancasila.",
      "Memfokuskan pada ujian tertulis saja."
    ],
    "a": 2
  },
  {
    "q": "Disajikan pernyataan praktik pedagogi tentang pelaksanaan program Penguatan profile pelajar rahmatan lil alami (PPRA) secara logis, mahasiswa dapat menentukan pengembangan materi ajar nilai-nilai PPRA dalam melaksanakan tujuan pembelajaran sesuai dengan karakteristik peserta didik.",
    "o": [
      "Menggunakan materi yang bersifat teoritis dan kaku.",
      "Mengaitkan nilai PPRA dengan kehidupan sehari-hari melalui diskusi dan contoh nyata.",
      "Menghafal istilah-istilah PPRA.",
      "Membatasi diskusi tentang perbedaan pendapat.",
      "Fokus pada hafalan ayat tanpa aplikasi."
    ],
    "a": 2
  },
  {
    "q": "Disajikan pernyataan praktik pedagogi atau praktek di masyarakat tentang imlementasi nilai-nilai moderasi beragama secara logis, mahasiswa dapat menentukan pengembangan materi ajar niali-nilai Islam sebagai agama moderat atau wasathiyah yang tepat sesuai dengan implementasi moderasi beragama dalam mengevaluasi tujuan pembelajaran sesuai dengan karakteristik peserta didik.",
    "o": [
      "Membuat materi yang menekankan pada satu pandangan saja.",
      "Mengembangkan kasus tentang toleransi dan keseimbangan dalam kehidupan bermasyarakat.",
      "Menghafal definisi moderasi beragama.",
      "Menghindari topik tentang keragaman budaya.",
      "Membatasi interaksi dengan kelompok berbeda."
    ],
    "a": 2
  },
  {
    "q": "Disajikan pernyataan praktik pedagogi atau praktek di masyarakat tentang alasan imlementasi nilai-nilai moderasi beragama, mahasiswa dapat menilai pegembangan materi ajar Islam sebagai agama moderat atau wasathiyah dengan alasan yang tepat sesuai dengan implementasi moderasi beragama.",
    "o": [
      "Untuk membatasi kebebasan beragama.",
      "Untuk menghindari pembahasan tentang hukum Islam.",
      "Untuk menciptakan keseragaman pendapat.",
      "Untuk membangun kerukunan dan pemahaman yang seimbang di tengah keragaman.",
      "Untuk mengutamakan budaya lokal daripada agama."
    ],
    "a": 4
  },
  {
    "q": "Disajikan deskripsi penerapan pembelajaran dengan materi Konsep Ayat dan Surat Makkiyah dan Madaniyah sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan materi pembelajaran.",
    "o": [
      "Ceramah tentang sejarah surah.",
      "Hafalan surah Makkiyah dan Madaniyah.",
      "Analisis kasus perbedaan konteks sosial surah dan relevansinya saat ini.",
      "Menulis ulang ayat-ayat Al-Qur'an.",
      "Membaca buku sejarah Islam."
    ],
    "a": 3
  },
  {
    "q": "Disajikan pernyataan penerapan pembelajaran dengan materi Perbedaan Al-Qur'an, Hadis Nabawi, atau Hadis Qudsi sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan pengetahuan pedagogik.",
    "o": [
      "Diskusi kelompok menganalisis studi kasus untuk membedakan ketiganya.",
      "Ceramah tentang definisi dan contoh.",
      "Menghafal contoh hadis qudsi.",
      "Menyalin teks ayat dan hadis.",
      "Mengerjakan soal pilihan ganda."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi kasus penerapan pembelajaran dengan materi Metode Takhrij Hadis sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan pengetahuan teknologi.",
    "o": [
      "Membaca buku teks takhrij hadis.",
      "Menghafal langkah-langkah takhrij.",
      "Menggunakan aplikasi digital untuk mencari dan memverifikasi sanad hadis.",
      "Menyalin hasil takhrij dari buku.",
      "Ceramah tentang sejarah perawi."
    ],
    "a": 3
  },
  {
    "q": "Disajikan deskripsi kasus penerapan pembelajaran dengan materi Metode Tafsir Kontekstual sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis perbedaan individu sesuai dengan materi pembelajaran.",
    "o": [
      "Metode ceramah seragam untuk semua siswa.",
      "Memberikan tugas yang sama tanpa melihat kemampuan.",
      "Menggunakan pendekatan yang disesuaikan dengan minat dan gaya belajar siswa dalam menganalisis kasus.",
      "Menghafal langkah tafsir.",
      "Membaca tafsir secara konvensional."
    ],
    "a": 3
  },
  {
    "q": "Disajikan pernyataan kasus penerapan pembelajaran dengan materi ajar Konsep Tasamuh dalam al-Quran dan Hadis sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis perbedaan individu sesuai dengan pengetahuan pedagogi.",
    "o": [
      "Ceramah tentang arti tasamuh.",
      "Hafalan ayat tentang tasamuh.",
      "Proyek kelompok dengan peran berbeda sesuai potensi masing-masing siswa dalam simulasi toleransi.",
      "Menyalin teks hadis.",
      "Tes tertulis tentang tasamuh."
    ],
    "a": 3
  },
  {
    "q": "Disajikan pernyataan penerapan pembelajaran dengan materi Konsep Tawazun dalam al-Quran dan Hadis sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis perbedaan individu sesuai dengan pengetahuan teknologi.",
    "o": [
      "Menggunakan aplikasi video konferensi untuk diskusi kelompok tanpa materi visual.",
      "Menggunakan kuis interaktif dan simulasi digital yang disesuaikan dengan kecepatan belajar masing-masing siswa.",
      "Menyuruh siswa membaca buku teks secara mandiri.",
      "Ceramah satu arah mengenai konsep tawazun.",
      "Menyalin definisi tawazun dari internet."
    ],
    "a": 2
  },
  {
    "q": "Disajikan narasi kasus penerapan pembelajaran dengan materi Pendekatan Semantik dalam Kajian al-Qur'an sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis pembelajaran mendalam sesuai dengan materi pembelajaran.",
    "o": [
      "Menghafal kosakata bahasa Arab dalam Al-Qur'an.",
      "Menyalin ayat-ayat Al-Qur'an beserta artinya.",
      "Analisis mendalam terhadap makna kata kunci dalam ayat untuk memahami pesan moral dan konteks sosialnya.",
      "Mengerjakan soal pilihan ganda tentang sejarah tafsir.",
      "Mendengarkan ceramah tentang semantik."
    ],
    "a": 3
  },
  {
    "q": "Disajikan narasi kasus penerapan pembelajaran dengan materi Wawasan Kebangsaan dalam Perspektif al-Qur'an dan Hadis sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis pembelajaran mendalam sesuai dengan pengetahuan pedagogi.",
    "o": [
      "Diskusi mendalam mengenai interpretasi ayat tentang persatuan dan aplikasinya dalam mengatasi isu toleransi saat ini.",
      "Hafalan dalil-dalil tentang cinta tanah air.",
      "Membuat kliping berita tentang kebangsaan.",
      "Mengerjakan tes tertulis tentang sejarah Indonesia.",
      "Ceramah tentang sejarah masuknya Islam."
    ],
    "a": 1
  },
  {
    "q": "Disajikan kasus penerapan pembelajaran dengan materi Pengertian Pendidikan Karakter sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis pembelajaran mendalam sesuai dengan pengetahuan teknologi.",
    "o": [
      "Menyalin definisi pendidikan karakter dari internet.",
      "Membaca e-book tentang karakter.",
      "Menggunakan simulasi virtual atau game edukasi untuk memecahkan dilema moral berdasarkan nilai karakter Islami.",
      "Hafalan definisi karakter.",
      "Mengerjakan kuis daring tentang pengertian karakter."
    ],
    "a": 3
  },
  {
    "q": "Disajikan kasus penerapan pembelajaran dengan materi Kajian Historis Moderasi Beragama di Indonesia sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis TPACK sesuai dengan materi pembelajaran.",
    "o": [
      "Menggunakan lini masa digital interaktif (timeline) untuk menganalisis perkembangan toleransi di Indonesia berdasarkan data sejarah.",
      "Menyalin sejarah moderasi beragama.",
      "Ceramah tentang tokoh-tokoh moderasi.",
      "Membaca buku sejarah secara konvensional.",
      "Hafalan tahun-tahun penting dalam sejarah."
    ],
    "a": 1
  },
  {
    "q": "Berdasarkan hal tersebut, strategi pembelajaran yang paling tepat untuk materi Qashas adalah:",
    "o": [
      "Menggunakan pendekatan pembelajaran berbasis masalah (PBL), di mana siswa bekerja dalam kelompok untuk menganalisis kisah-kisah Qashas, mendiskusikan nilai-nilai keadilan dan pembelajaran yang relevan dengan kehidupan sehari-hari, serta memecahkan masalah sosial yang dapat diterapkan dalam konteks zaman sekarang.",
      "Menyajikan ceramah panjang mengenai kisah-kisah Qashash tanpa melibatkan siswa dalam diskusi atau kegiatan interaktif.",
      "Memberikan tugas individu untuk menulis tentang kisah-kisah Qashash dalam Al-Qur'an tanpa mengaitkannya dengan konteks kehidupan modern atau mengembangkan pemikiran kritis.",
      "Memberikan ujian tertulis mengenai kisah-kisah Qashash tanpa melibatkan diskusi atau pendekatan yang membahas penerapan nilai-nilai tersebut dalam kehidupan nyata.",
      "Menggunakan film atau media lain untuk memperkenalkan kisah-kisah Qashash, namun tidak memberikan kesempatan bagi siswa untuk berdiskusi atau berpikir kritis tentang relevansi nilai-nilai tersebut."
    ],
    "a": 1
  },
  {
    "q": "Berdasarkan hal tersebut, strategi pembelajaran yang paling tepat untuk digunakan agar materi pemahaman tentang struktur hadis lebih relevan dengan perkembangan zaman adalah:",
    "o": [
      "Pembelajaran berbasis teknologi dengan menggunakan aplikasi digital untuk mengidentifikasi hadis-hadis yang relevan dengan isu zaman sekarang.",
      "Pembelajaran berbasis masalah (Problem-Based Learning) dengan menganalisis kasus sosial kontemporer yang terkait dengan hadis.",
      "Pembelajaran kooperatif tipe Think-Pair-Share untuk mendiskusikan makna hadis dan struktur sanad dalam konteks modern.",
      "Pembelajaran berbasis proyek (Project-Based Learning) dengan mengajak siswa untuk membuat proyek tentang penerapan hadis dalam kehidupan sehari-hari.",
      "Pembelajaran tradisional dengan mengutamakan hafalan dan pemahaman teks hadis klasik."
    ],
    "a": 4
  },
  {
    "q": "Berdasarkan hal tersebut, strategi pembelajaran yang paling tepat untuk membuat materi takhrij hadis lebih relevan dengan perkembangan zaman adalah:",
    "o": [
      "Pembelajaran berbasis proyek (Project-Based Learning) dengan meminta siswa untuk membuat karya ilmiah tentang metode takhrij hadis.",
      "Pembelajaran berbasis teknologi dengan menggunakan aplikasi untuk mengidentifikasi hadis-hadis sahih dan dha'if.",
      "Pembelajaran kooperatif tipe Jigsaw yang membagi materi tentang takhrij hadis dalam kelompok kecil untuk dipelajari bersama.",
      "Pembelajaran berbasis tantangan (Design-Based Learning) yang melibatkan siswa dalam menyelesaikan masalah yang berkaitan dengan autentikasi hadis di era digital.",
      "Pembelajaran berbasis masalah (Problem-Based Learning) dengan membahas kasus-kasus sosial yang membutuhkan analisis hadis."
    ],
    "a": 4
  },
  {
    "q": "Pertanyaan: Berdasarkan situasi tersebut, strategi pembelajaran yang paling efektif untuk membantu siswa memahami tafsir kontemporer adalah:",
    "o": [
      "Pembelajaran berbasis teknologi dengan menggunakan aplikasi untuk mempelajari tafsir kontemporer dan aplikasi praktisnya.",
      "Pembelajaran berbasis proyek (Project-Based Learning) dengan meminta siswa untuk mengeksplorasi tafsir kontemporer dalam konteks isu sosial saat ini.",
      "Pembelajaran Deep Learning dengan menggunakan teknologi untuk menganalisis dan mengaitkan tafsir kontemporer dengan masalah-masalah global.",
      "Pembelajaran kooperatif tipe Jigsaw untuk mendiskusikan berbagai pendekatan tafsir kontemporer dalam kelompok kecil.",
      "Pembelajaran berbasis masalah (Problem-Based Learning) dengan membahas kasus-kasus sosial yang membutuhkan pendekatan tafsir kontemporer."
    ],
    "a": 1
  },
  {
    "q": "Pertanyaan: Model pembelajaran yang paling efektif untuk mengajarkan nilai tawassuth dalam konteks era digital adalah:",
    "o": [
      "Model Pembelajaran Kooperatif dengan teknik Think-Pair-Share untuk mendiskusikan penerapan konsep tawassuth.",
      "Model Pembelajaran Berbasis Masalah (Problem-Based Learning) untuk menyelesaikan masalah terkait keseimbangan dalam kehidupan modern.",
      "Model Pembelajaran Berbasis Proyek (Project-Based Learning) dengan mengajak siswa untuk merancang proyek yang mengimplementasikan prinsip tawassuth dalam kehidupan sehari-hari.",
      "Model Pembelajaran Berpendekatan TPACK untuk mengintegrasikan teknologi, pedagogi, dan konten dalam memahami konsep tawassuth secara aplikatif.",
      "Model Pembelajaran Inkuiri dengan pendekatan yang berfokus pada eksplorasi nilai tawassuth dalam kehidupan sosial."
    ],
    "a": 4
  },
  {
    "q": "Pertanyaan: Berdasarkan situasi tersebut, strategi pembelajaran yang paling efektif untuk memadukan nilai tasamuh dengan pemanfaatan teknologi adalah:",
    "o": [
      "Pembelajaran berbasis tantangan (Design-Based Learning) dengan menantang siswa untuk menciptakan solusi teknologi yang mempromosikan tasamuh dalam masyarakat.",
      "Pembelajaran berbasis proyek (Project-Based Learning) dengan meminta siswa membuat kampanye media sosial tentang tasamuh.",
      "Pembelajaran berbasis masalah (Problem-Based Learning) dengan membahas kasus-kasus pelanggaran tasamuh di internet.",
      "Pembelajaran berbasis teknologi dengan menggunakan aplikasi untuk mempelajari materi tasamuh dan aplikasinya.",
      "Pembelajaran konvensional dengan ceramah tentang pentingnya tasamuh."
    ],
    "a": 1
  },
  {
    "q": "Pertanyaan: Berdasarkan situasi tersebut, strategi pembelajaran yang paling tepat untuk materi tentang konsep wawasan kebangsaan adalah:",
    "o": [
      "Pembelajaran kooperatif tipe Jigsaw untuk mempelajari konsep wawasan kebangsaan secara mendalam dalam kelompok kecil.",
      "Pembelajaran berbasis masalah (Problem-Based Learning) dengan menganalisis isu-isu kebangsaan terkini dan relevansinya dengan wawasan kebangsaan.",
      "Pembelajaran berbasis teknologi dengan menggunakan media interaktif untuk mempelajari konsep wawasan kebangsaan secara visual.",
      "Pembelajaran berbasis proyek (Project-Based Learning) dengan mengajak siswa membuat proyek tentang penerapan wawasan kebangsaan.",
      "Pembelajaran konvensional dengan ceramah tentang pentingnya wawasan kebangsaan."
    ],
    "a": 2
  },
  {
    "q": "Pertanyaan: Berdasarkan situasi tersebut, strategi pembelajaran yang paling tepat untuk materi pemahaman tentang pendidikan karakter adalah:",
    "o": [
      "Pembelajaran berbasis proyek (Project-Based Learning) dengan mengajak siswa membuat proyek tentang penerapan pendidikan karakter.",
      "Pembelajaran berbasis masalah (Problem-Based Learning) dengan menganalisis kasus-kasus pelanggaran karakter di sekolah.",
      "Pembelajaran berbasis teknologi dengan menggunakan media interaktif untuk mempelajari karakter secara visual.",
      "Pembelajaran kooperatif tipe Jigsaw untuk mempelajari konsep pendidikan karakter dalam kelompok kecil.",
      "Pembelajaran konvensional dengan ceramah tentang pentingnya pendidikan karakter."
    ],
    "a": 1
  },
  {
    "q": "Pertanyaan: Berdasarkan situasi tersebut, strategi pembelajaran yang paling tepat untuk materi pemahaman tentang sejarah moderasi beragama di Indonesia adalah:",
    "o": [
      "Pembelajaran konvensional dengan ceramah tentang sejarah moderasi beragama.",
      "Pembelajaran berbasis teknologi dengan menggunakan media interaktif untuk mempelajari sejarah secara visual.",
      "Pembelajaran berbasis proyek (Project-Based Learning) dengan mengajak siswa membuat proyek tentang sejarah moderasi beragama.",
      "Pembelajaran berbasis tantangan (Design-Based Learning) yang melibatkan siswa dalam menyelesaikan masalah tentang sejarah moderasi beragama.",
      "Pembelajaran kooperatif tipe Jigsaw untuk mempelajari sejarah moderasi beragama dalam kelompok kecil."
    ],
    "a": 3
  },
  {
    "q": "Berdasarkan hal tersebut, metode yang paling tepat digunakan untuk mencapai tujuan pembelajaran adalah:",
    "o": [
      "Metode ceramah interaktif.",
      "Metode diskusi kelompok kecil.",
      "Metode proyek pembelajaran (Project-Based Learning).",
      "Metode demonstrasi.",
      "Metode inkuiri terbimbing."
    ],
    "a": 3
  },
  {
    "q": "Berdasarkan hal tersebut, metode yang paling tepat digunakan untuk mencapai tujuan pembelajaran adalah:",
    "o": [
      "Metode ceramah interaktif.",
      "Metode diskusi kelompok kecil.",
      "Metode proyek pembelajaran (Project-Based Learning).",
      "Metode demonstrasi.",
      "Metode inkuiri terbimbing."
    ],
    "a": 3
  },
  {
    "q": "Berdasarkan hal tersebut, metode yang paling tepat digunakan untuk mencapai tujuan pembelajaran adalah:",
    "o": [
      "Metode ceramah interaktif.",
      "Metode diskusi kelompok kecil.",
      "Metode proyek pembelajaran (Project-Based Learning).",
      "Metode demonstrasi.",
      "Metode inkuiri terbimbing."
    ],
    "a": 3
  },
  {
    "q": "Berdasarkan hal tersebut, metode yang paling tepat digunakan untuk mencapai tujuan pembelajaran adalah:",
    "o": [
      "Metode ceramah interaktif.",
      "Metode diskusi kelompok kecil.",
      "Metode proyek pembelajaran (Project-Based Learning).",
      "Metode demonstrasi.",
      "Metode inkuiri terbimbing."
    ],
    "a": 3
  },
  {
    "q": "Berdasarkan hal tersebut, metode yang paling tepat digunakan untuk mencapai tujuan pembelajaran adalah:",
    "o": [
      "Metode ceramah interaktif.",
      "Metode diskusi kelompok kecil.",
      "Metode proyek pembelajaran (Project-Based Learning).",
      "Metode demonstrasi.",
      "Metode inkuiri terbimbing."
    ],
    "a": 3
  },
  {
    "q": "Berdasarkan hal tersebut, metode yang paling tepat digunakan untuk mencapai tujuan pembelajaran adalah:",
    "o": [
      "Metode ceramah interaktif.",
      "Metode diskusi kelompok kecil.",
      "Metode proyek pembelajaran (Project-Based Learning).",
      "Metode demonstrasi.",
      "Metode inkuiri terbimbing."
    ],
    "a": 3
  },
  {
    "q": "Berdasarkan contoh studi kasus pada materi pengembangan soal evaluasi, manakah yang merupakan rumusan indikator tujuan pembelajaran ranah sikap yang sesuai?",
    "o": [
      "Peserta didik dapat menyebutkan jenis-jenis hadis dengan benar.",
      "Peserta didik dapat menunjukkan rasa syukur atas nikmat turunnya Al-Qur'an.",
      "Peserta didik dapat membuat makalah tentang sejarah takhrij.",
      "Peserta didik dapat menghafal surat Makkiyah.",
      "Peserta didik dapat menjelaskan pengertian tasamuh."
    ],
    "a": 2
  },
  {
    "q": "Seorang guru ingin menerapkan metode pembelajaran berbasis proyek (PjBL) pada materi hadis dhaif. Kegiatan manakah yang paling sesuai?",
    "o": [
      "Siswa mencatat jenis hadis dhaif dari buku teks.",
      "Siswa membuat infografis tentang kriteria hadis dhaif dan mempresentasikannya.",
      "Siswa mendengarkan ceramah guru tentang sejarah hadis.",
      "Siswa menghafal satu hadis dhaif.",
      "Siswa mengerjakan tes objektif tentang hadis dhaif."
    ],
    "a": 2
  },
  {
    "q": "Manakah rumusan indikator yang menunjukkan kemampuan berpikir kritis pada materi Ulumul Hadis?",
    "o": [
      "Peserta didik mampu menyalin pengertian hadis sahih.",
      "Peserta didik mampu menyebutkan nama imam perawi hadis.",
      "Peserta didik mampu menganalisis keotentikan hadis menggunakan kaidah ulumul hadis.",
      "Peserta didik mampu membaca hadis dengan lancar.",
      "Peserta didik mampu menghafal definisi sanad."
    ],
    "a": 3
  },
  {
    "q": "Dalam merencanakan pembelajaran Tafsir Tematik dengan pendekatan TPACK, aktivitas manakah yang paling relevan?",
    "o": [
      "Menggunakan papan tulis untuk menulis langkah-langkah tafsir.",
      "Menggunakan aplikasi digital atau situs web kredibel untuk mencari ayat-ayat bertema.",
      "Membaca buku tafsir secara konvensional.",
      "Menyalin ayat dari Mushaf cetak.",
      "Menghafal langkah tafsir tematik."
    ],
    "a": 2
  },
  {
    "q": "Apa alasan utama penerapan nilai-nilai moderasi beragama di sekolah?",
    "o": [
      "Untuk menghilangkan perbedaan antarumat beragama.",
      "Untuk menanamkan sikap radikal sejak dini.",
      "Untuk membangun kerukunan dan pemahaman yang seimbang di tengah keragaman.",
      "Untuk membatasi pergaulan siswa.",
      "Untuk fokus pada satu pandangan keagamaan saja."
    ],
    "a": 3
  },
  {
    "q": "Manakah rumusan tujuan pembelajaran ranah keterampilan yang sesuai untuk materi sejarah penghimpunan hadis?",
    "o": [
      "Peserta didik dapat menjelaskan pengertian penghimpunan hadis.",
      "Peserta didik dapat menyebutkan tahun penghimpunan hadis.",
      "Peserta didik dapat membuat peta konsep sejarah penghimpunan hadis.",
      "Peserta didik dapat menghafal nama perawi hadis.",
      "Peserta didik dapat mengidentifikasi hadis sahih."
    ],
    "a": 3
  },
  {
    "q": "Pendekatan pembelajaran apa yang paling tepat untuk mengaitkan ayat Al-Qur'an dengan isu perundungan digital?",
    "o": [
      "Metode ceramah.",
      "Pendekatan tafsir kontekstual.",
      "Hafalan ayat saja.",
      "Menyalin tafsir klasik.",
      "Diskusi tentang sejarah nuzulul quran."
    ],
    "a": 2
  },
  {
    "q": "Indikator sikap yang sesuai dengan nilai tawassuth (moderat) adalah...",
    "o": [
      "Bersikap ekstrem dalam beragama.",
      "Tidak peduli dengan perbedaan pendapat.",
      "Menunjukkan sikap toleran dan seimbang dalam beragama.",
      "Hanya berteman dengan yang satu pemahaman.",
      "Menolak budaya lokal."
    ],
    "a": 3
  },
  {
    "q": "Contoh kegiatan pembelajaran untuk menanamkan nilai tasamuh (toleransi) adalah...",
    "o": [
      "Debat untuk memenangkan pendapat sendiri.",
      "Diskusi kelompok menghormati perbedaan pendapat tentang tafsir.",
      "Hafalan dalil tanpa diskusi.",
      "Ceramah satu arah.",
      "Tes tertulis tentang pengertian tasamuh."
    ],
    "a": 2
  },
  {
    "q": "Berdasarkan materi pada PDF, masalah utama guru Gen Z adalah...",
    "o": [
      "Kurang buku teks.",
      "Ketidakmampuan menggunakan komputer.",
      "Tantangan menciptakan interaksi mendalam antara siswa dan materi.",
      "Terlalu banyak diskusi.",
      "Kurang ruang kelas."
    ],
    "a": 3
  }
]
