[
  {
    "q": "Seorang guru menjelaskan tentang makna Al-Qur'an sebagai wahyu Allah yang menjadi pedoman hidup umat Islam, serta membedakan antara wahyu, ilham, dan ta’lim dalam kehidupan sehari-hari. Setelah itu, peserta didik diajak merenungkan pentingnya berpegang teguh pada Al-Qur'an dalam setiap aspek kehidupan. Tujuan pembelajaran yang paling tepat berdasarkan aktivitas tersebut adalah:",
    "o": [
      "Peserta didik mampu membedakan antara wahyu, ilham, dan ta’lim dengan kritis.",
      "Peserta didik mampu menghafal definisi Al-Qur'an, wahyu, ilham, dan ta’lim.",
      "Peserta didik mampu meningkatkan keimanan, ketakwaan, dan akhlak mulia melalui pemahaman tentang Al-Qur'an.",
      "Peserta didik mampu menulis ringkasan materi tentang Al-Qur'an dan wahyu.",
      "Peserta didik mampu mengumpulkan referensi tentang konsep wahyu dan ilham."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran Ulum al-Hadis, guru meminta peserta didik untuk membandingkan berbagai pandangan ulama tentang definisi hadis shahih. Diskusi berlangsung kritis dan peserta didik diajak mengevaluasi pendapat yang paling sesuai dengan konteks saat ini. Tujuan pembelajaran yang paling sesuai adalah:",
    "o": [
      "Peserta didik mampu menghafal definisi Ulum al-Hadis dari berbagai ulama.",
      "Peserta didik mampu menganalisis definisi Ulum al-Hadis secara kritis.",
      "Peserta didik mampu membedakan Ulum al-Hadis dan Ulum al-Qur’an.",
      "Peserta didik mampu menyalin teori Ulum al-Hadis dari buku referensi.",
      "Peserta didik mampu menyebutkan contoh hadis-hadis dalam Ulum al-Hadis."
    ],
    "a": 1
  },
  {
    "q": "Saat membahas sejarah pertumbuhan dan penghimpunan hadis, guru membagi peserta didik dalam kelompok untuk meneliti tokoh-tokoh yang berjasa dalam kodifikasi hadis. Setiap kelompok harus bekerja sama menyusun poster tentang hasil temuannya. Tujuan pembelajaran yang sesuai adalah:",
    "o": [
      "Peserta didik mampu menghafal nama-nama tokoh kodifikasi hadis.",
      "Peserta didik mampu membuat laporan individu tentang sejarah hadis.",
      "Peserta didik mampu mengembangkan semangat gotong royong melalui kerja kelompok dalam memahami sejarah hadis.",
      "Peserta didik mampu menyalin biografi tokoh hadis.",
      "Peserta didik mampu merangkum sejarah hadis dari buku teks."
    ],
    "a": 2
  },
  {
    "q": "Saat mempelajari metode tafsir tematik, guru mengajak peserta didik untuk menelaah berbagai tradisi lokal yang diwarnai nilai-nilai keislaman. Peserta didik kemudian diajak untuk menghargai keberagaman tradisi dalam kerangka tafsir Al-Qur'an. Tujuan pembelajaran yang paling tepat adalah:",
    "o": [
      "Peserta didik mampu menghafal metode tafsir tematik.",
      "Peserta didik mampu membandingkan tradisi lokal dan Arab.",
      "Peserta didik mampu mengembangkan sikap penerimaan terhadap tradisi lokal melalui pendekatan tafsir tematik.",
      "Peserta didik mampu menulis laporan tradisi berdasarkan tafsir.",
      "Peserta didik mampu menyalin ayat-ayat Al-Qur'an yang berhubungan dengan tradisi."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran konsep tawassuth, guru meminta peserta didik mengaitkan nilai moderasi Islam dengan berbagai persoalan kontemporer, seperti teknologi informasi dan globalisasi. Peserta didik didorong untuk berpikir terbuka dan inovatif. Indikator tujuan pembelajaran yang paling sesuai adalah:",
    "o": [
      "Peserta didik mampu menghafal ayat tentang tawassuth.",
      "Peserta didik mampu berpikir dinamis dan inovatif dalam memahami konsep tawassuth.",
      "Peserta didik mampu mengkritik konsep tawassuth secara umum.",
      "Peserta didik mampu mengumpulkan dalil-dalil tentang moderasi.",
      "Peserta didik mampu mendiskusikan makna tawassuth secara pasif."
    ],
    "a": 1
  },
  {
    "q": "Guru merancang proyek di mana peserta didik harus membuat peta perjalanan sejarah nuzul al-Qur'an. Setiap tahapan turunnya Al-Qur'an dikaitkan dengan peristiwa penting dalam kehidupan Nabi Muhammad SAW. Analisis materi ajar yang paling tepat adalah:",
    "o": [
      "Menjelaskan urutan nuzul al-Qur'an tanpa proyek.",
      "Menuliskan tahapan sejarah nuzul al-Qur'an dari buku.",
      "Menganalisis tahapan nuzul al-Qur'an berdasarkan pendekatan PBL sesuai struktur keilmuan dan karakteristik peserta didik.",
      "Menghafal tahapan nuzul al-Qur'an secara runtut.",
      "Menyusun soal tentang nuzul al-Qur'an."
    ],
    "a": 2
  },
  {
    "q": "Guru mengarahkan peserta didik untuk membuat proyek klasifikasi hadis berdasarkan kriteria ke-dha'ifan hadis, meliputi cacat sanad, matan, dan perawi. Analisis materi ajar yang paling tepat adalah:",
    "o": [
      "Menghafal kriteria hadis dha'if.",
      "Menulis ulang kriteria hadis dha'if dari buku.",
      "Menganalisis materi kriteria hadis dha'if berbasis proyek sesuai struktur keilmuan dan karakteristik peserta didik.",
      "Membaca ringkasan hadis dha'if.",
      "Mengidentifikasi hadis dha'if secara teori."
    ],
    "a": 2
  },
  {
    "q": "Guru memberikan studi kasus tentang berbagai hadis, lalu meminta peserta didik mengevaluasi keotentikan hadis tersebut dengan metode DBL (Discovery Based Learning). Materi ajar yang diuraikan dalam evaluasi tersebut adalah:",
    "o": [
      "Macam-macam hadis berdasarkan kualitas sanad dan matan.",
      "Hafalan matan hadis-habis pilihan.",
      "Ringkasan tentang sanad dan matan hadis.",
      "Penyalinan daftar hadis shahih.",
      "Penulisan kembali isi kitab hadis."
    ],
    "a": 0
  },
  {
    "q": "Guru menyusun perencanaan pembelajaran tafsir tematik berbasis teknologi dan literasi digital. Peserta didik diarahkan menelusuri tema sosial dalam Al-Qur'an dengan dukungan platform digital. Alur materi ajar yang dirancang adalah:",
    "o": [
      "Membaca buku teks tafsir saja.",
      "Membuat proyek tafsir tanpa teknologi.",
      "Merancang alur materi ajar metode tafsir tematik dengan pendekatan TPACK yang logis dan sesuai karakteristik peserta didik.",
      "Menyalin metode tafsir dari kitab klasik.",
      "Membandingkan tafsir tanpa pemanfaatan teknologi."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran konsep tawassuth, guru mempraktikkan metode diskusi aktif di mana peserta didik mengaitkan nilai tawassuth dengan permasalahan keberagaman di lingkungan sekitar. Alur materi ajar yang sesuai adalah:",
    "o": [
      "Menjelaskan konsep tawassuth secara ceramah penuh.",
      "Menganalisis konsep tawassuth dalam diskusi aktif berbasis Discovery Learning (DL).",
      "Menyalin ayat-ayat tentang tawassuth.",
      "Menghafal makna tawassuth dari buku teks.",
      "Membaca teks tawassuth tanpa diskusi."
    ],
    "a": 1
  },
  {
    "q": "Seorang dosen mengajarkan materi tentang hermeneutik dalam kajian Al-Qur'an, dengan pendekatan pelayanan konseling. Mahasiswa dibimbing untuk memahami cara-cara memaknai teks Al-Qur'an dengan perspektif yang kontekstual dan personal, serta berdiskusi tentang penerapan nilai-nilai tersebut dalam kehidupan sehari-hari. Tujuan pembelajaran yang paling tepat adalah:",
    "o": [
      "Mahasiswa mampu menghafal definisi hermeneutik dalam kajian Al-Qur'an.",
      "Mahasiswa mampu menjelaskan alur materi ajar hermeneutik dengan pendekatan konseling.",
      "Mahasiswa mampu mempraktikkan konseling berbasis hermeneutik dalam kajian Al-Qur'an.",
      "Mahasiswa mampu mengembangkan alur materi ajar hermeneutik sesuai dengan kebutuhan karakteristik peserta didik.",
      "Mahasiswa mampu menulis ringkasan materi tentang hermeneutik dan konseling."
    ],
    "a": 3
  },
  {
    "q": "Dalam perencanaan pembelajaran, seorang guru mengintegrasikan nilai-nilai Pancasila dalam pembelajaran berbasis proyek. Peserta didik diajak untuk menyusun kegiatan yang mempromosikan nilai-nilai Pancasila seperti gotong royong, keadilan, dan kerukunan dalam masyarakat. Pengembangan materi ajar yang sesuai adalah:",
    "o": [
      "Peserta didik mampu menghafal nilai-nilai Pancasila.",
      "Peserta didik mampu merencanakan tujuan pembelajaran berdasarkan nilai-nilai Pancasila.",
      "Peserta didik mampu menulis esai tentang nilai-nilai Pancasila dalam konteks kehidupan sosial.",
      "Peserta didik mampu mengembangkan materi ajar yang sesuai dengan penguatan profil pelajar Pancasila.",
      "Peserta didik mampu menyusun laporan tentang nilai Pancasila."
    ],
    "a": 3
  },
  {
    "q": "Seorang guru merancang pelajaran untuk menguatkan profil pelajar rahmatan lil alami (PPRA). Materi pembelajaran difokuskan pada sikap saling menghormati antar umat beragama, serta menjaga keharmonisan sosial dalam kehidupan multikultural. Pengembangan materi ajar yang sesuai adalah:",
    "o": [
      "Peserta didik mampu menghafal nilai-nilai PPRA.",
      "Peserta didik mampu merencanakan tujuan pembelajaran berdasarkan nilai-nilai PPRA.",
      "Peserta didik mampu menulis laporan tentang implementasi nilai-nilai PPRA.",
      "Peserta didik mampu mengembangkan materi ajar sesuai dengan penguatan profil pelajar rahmatan lil alami.",
      "Peserta didik mampu mengidentifikasi nilai PPRA dalam kehidupan sehari-hari."
    ],
    "a": 3
  },
  {
    "q": "Dalam sebuah diskusi kelas, peserta didik dibimbing untuk menganalisis dan menerapkan nilai-nilai Islam sebagai agama moderat dalam berbagai situasi sosial, dengan tujuan menciptakan toleransi dan kerukunan antar umat beragama. Pengembangan materi ajar yang tepat dalam evaluasi tujuan pembelajaran adalah:",
    "o": [
      "Peserta didik mampu menilai penerapan nilai-nilai moderasi beragama dalam kehidupan sehari-hari.",
      "Peserta didik mampu menjelaskan perbedaan antara moderasi beragama dan ekstremisme.",
      "Peserta didik mampu menghafal definisi moderasi beragama.",
      "Peserta didik mampu mengembangkan materi ajar yang mencakup sikap toleransi antar umat beragama.",
      "Peserta didik mampu berdiskusi tentang dasar hukum Islam terkait moderasi beragama."
    ],
    "a": 0
  },
  {
    "q": "Seorang guru mengajak peserta didik untuk berdiskusi tentang alasan mengapa moderasi beragama penting dalam kehidupan masyarakat multikultural, dengan fokus pada cara-cara mengimplementasikan nilai-nilai Islam sebagai agama moderat dalam kehidupan sehari-hari. Tujuan evaluasi yang tepat adalah:",
    "o": [
      "Peserta didik mampu mengidentifikasi alasan mengapa moderasi beragama penting.",
      "Peserta didik mampu menyusun esai tentang moderasi beragama.",
      "Peserta didik mampu mengembangkan argumen logis tentang moderasi beragama berdasarkan teks Al-Qur'an dan Hadis.",
      "Peserta didik mampu memberikan alasan yang tepat terkait moderasi beragama dalam konteks sosial.",
      "Peserta didik mampu mengkritisi konsep moderasi beragama."
    ],
    "a": 3
  },
  {
    "q": "Seorang guru merancang pembelajaran dengan pendekatan berbasis masalah (PBL) untuk membahas konsep ayat dan surat Makkiyah dan Madaniyah. Peserta didik diajak untuk menelusuri perbedaan dan konteks turunnya ayat-ayat tersebut, serta penerapannya dalam kehidupan. Rancangan pembelajaran yang paling sesuai adalah:",
    "o": [
      "Peserta didik mampu menghafal perbedaan ayat Makkiyah dan Madaniyah.",
      "Peserta didik mampu menyusun soal ujian tentang ayat-ayat Makkiyah dan Madaniyah.",
      "Peserta didik mampu merancang pembelajaran berbasis masalah sesuai dengan konsep ayat Makkiyah dan Madaniyah.",
      "Peserta didik mampu mendiskusikan perbedaan ayat Makkiyah dan Madaniyah.",
      "Peserta didik mampu menyimpulkan konsep ayat Makkiyah dan Madaniyah."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran berbasis masalah (PBL), guru meminta peserta didik untuk membedakan antara Al-Qur'an, Hadis Nabawi, dan Hadis Qudsi dengan cara mendiskusikan perbedaan karakteristik dan fungsinya dalam kehidupan umat Islam. Rancangan pembelajaran yang tepat adalah:",
    "o": [
      "Peserta didik mampu menghafal perbedaan antara Al-Qur'an dan Hadis.",
      "Peserta didik mampu menyusun laporan tentang perbedaan Al-Qur'an, Hadis Nabawi, dan Hadis Qudsi.",
      "Peserta didik mampu mendiskusikan perbedaan Al-Qur'an, Hadis Nabawi, dan Hadis Qudsi dengan pendekatan PBL.",
      "Peserta didik mampu mengidentifikasi perbedaan Al-Qur'an dan Hadis Nabawi.",
      "Peserta didik mampu merangkum materi Al-Qur'an dan Hadis."
    ],
    "a": 2
  },
  {
    "q": "Dalam kelas yang menggunakan pendekatan PBL, peserta didik diminta untuk mengkaji metode takhrij hadis, yakni mengidentifikasi keshahihan hadis melalui jalur periwayatannya. Mahasiswa harus bekerja dalam kelompok untuk menyusun penelitian terkait takhrij hadis tertentu. Rancangan pembelajaran yang paling sesuai adalah:",
    "o": [
      "Peserta didik mampu menghafal metode takhrij hadis.",
      "Peserta didik mampu merancang proyek tentang takhrij hadis menggunakan pendekatan PBL.",
      "Peserta didik mampu menyusun soal ujian tentang takhrij hadis.",
      "Peserta didik mampu mengidentifikasi hadis-hadis yang tidak sahih.",
      "Peserta didik mampu menganalisis sanad hadis melalui metode takhrij."
    ],
    "a": 1
  },
  {
    "q": "Seorang guru menggunakan pendekatan PBL untuk membahas tafsir kontekstual, di mana peserta didik diminta untuk menganalisis tafsir ayat-ayat Al-Qur'an berdasarkan konteks sosial, politik, dan budaya saat ini. Rancangan pembelajaran yang sesuai adalah:",
    "o": [
      "Peserta didik mampu menghafal tafsir kontekstual.",
      "Peserta didik mampu membandingkan tafsir klasik dan kontekstual.",
      "Peserta didik mampu merancang proyek berbasis PBL dalam memahami tafsir kontekstual.",
      "Peserta didik mampu menulis esai tentang tafsir kontekstual.",
      "Peserta didik mampu mendiskusikan tafsir ayat-ayat Al-Qur'an."
    ],
    "a": 2
  },
  {
    "q": "Guru merancang pembelajaran berbasis perbedaan individu untuk membahas konsep tasamuh (toleransi) dalam Al-Qur'an dan Hadis. Peserta didik diajak untuk menilai bagaimana konsep tasamuh diterapkan dalam kehidupan multikultural dengan memperhatikan latar belakang sosial yang berbeda. Rancangan pembelajaran yang paling tepat adalah:",
    "o": [
      "Peserta didik mampu menghafal konsep tasamuh dalam Al-Qur'an dan Hadis.",
      "Peserta didik mampu mendiskusikan konsep tasamuh dengan pendekatan berbasis perbedaan individu.",
      "Peserta didik mampu menulis laporan tentang tasamuh dalam Al-Qur'an dan Hadis.",
      "Peserta didik mampu mengidentifikasi ayat-ayat tentang tasamuh.",
      "Peserta didik mampu mengkritisi konsep tasamuh."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran mengenai konsep Tawazun dalam al-Qur'an dan Hadis, seorang guru menggunakan teknologi digital untuk memperkenalkan materi tersebut dengan memanfaatkan berbagai platform pembelajaran interaktif. Peserta didik diberikan kesempatan untuk belajar secara mandiri dan mendalam, dengan fokus pada keseimbangan dalam kehidupan pribadi dan sosial. Rancangan pembelajaran yang paling sesuai adalah:",
    "o": [
      "Menggunakan pembelajaran tatap muka konvensional dengan buku teks.",
      "Membagi materi menjadi sesi pendek dan memberi tugas harian.",
      "Menggunakan pembelajaran berbasis perbedaan individu dengan teknologi pembelajaran yang mendalam.",
      "Menggunakan diskusi kelas untuk membahas konsep Tawazun tanpa bantuan teknologi.",
      "Menggunakan materi video dan audio tanpa interaksi peserta didik."
    ],
    "a": 2
  },
  {
    "q": "Dalam suatu kelas yang membahas pendekatan semantik dalam kajian al-Qur'an, guru meminta peserta didik untuk menggali makna ayat-ayat tertentu dengan memanfaatkan berbagai sumber penafsiran dan analisis bahasa. Peserta didik juga diminta untuk mengeksplorasi makna dalam konteks historis dan sosial. Rancangan pembelajaran yang paling sesuai adalah:",
    "o": [
      "Pembelajaran berbasis seminar dengan penjelasan teoritis.",
      "Pembelajaran berbasis pemahaman mendalam dan eksplorasi teks al-Qur'an.",
      "Pembelajaran berbasis presentasi hasil penelitian.",
      "Pembelajaran berbasis hafalan ayat-ayat al-Qur'an.",
      "Pembelajaran berbasis pengalaman pribadi peserta didik."
    ],
    "a": 1
  },
  {
    "q": "Seorang guru mengajak peserta didik untuk mendalami wawasan kebangsaan melalui perspektif al-Qur'an dan Hadis. Pembelajaran difokuskan pada nilai-nilai kebangsaan dan bagaimana teks-teks suci tersebut dapat diterapkan dalam kehidupan berbangsa dan bernegara. Rancangan pembelajaran yang tepat adalah:",
    "o": [
      "Pembelajaran berbasis diskusi kelas untuk memahami wawasan kebangsaan.",
      "Pembelajaran berbasis pemahaman mendalam dengan analisis teks-teks al-Qur'an dan Hadis.",
      "Pembelajaran berbasis pembuatan proyek kebangsaan.",
      "Pembelajaran berbasis pembacaan materi saja tanpa diskusi.",
      "Pembelajaran berbasis pendekatan kritis terhadap politik."
    ],
    "a": 1
  },
  {
    "q": "Seorang guru merancang pembelajaran tentang pendidikan karakter yang mengaitkan konsep-konsep dalam al-Qur'an dan Hadis. Peserta didik diajak untuk menggali nilai-nilai karakter yang diajarkan oleh Islam dan mengaplikasikannya dalam kehidupan sehari-hari. Rancangan pembelajaran yang paling sesuai adalah:",
    "o": [
      "Pembelajaran berbasis penghafalan ayat-ayat al-Qur'an terkait karakter.",
      "Pembelajaran berbasis pengalaman pribadi peserta didik dalam menggali karakter.",
      "Pembelajaran berbasis pembelajaran mendalam dengan diskusi tentang nilai-nilai karakter.",
      "Pembelajaran berbasis tugas kelompok tanpa bimbingan guru.",
      "Pembelajaran berbasis presentasi tentang karakter tanpa diskusi."
    ],
    "a": 2
  },
  {
    "q": "Seorang dosen merancang pembelajaran dengan materi kajian historis moderasi beragama di Indonesia, menggunakan teknologi untuk mengakses berbagai sumber dan literatur secara digital. Peserta didik diminta untuk menganalisis bagaimana moderasi beragama telah berkembang di Indonesia dengan pendekatan teknologi yang mendukung. Rancangan pembelajaran yang sesuai adalah:",
    "o": [
      "Pembelajaran berbasis teks dan ceramah saja.",
      "Pembelajaran berbasis penggunaan teknologi untuk akses literatur moderasi beragama.",
      "Pembelajaran berbasis diskusi kelas tanpa teknologi.",
      "Pembelajaran berbasis membaca buku teks moderasi beragama tanpa aplikasi teknologi.",
      "Pembelajaran berbasis pendekatan klasik tanpa melibatkan sumber digital."
    ],
    "a": 1
  },
  {
    "q": "Seorang guru ingin mengajarkan konsep 'Hadis sebagai Sumber Hukum Islam' menggunakan metode Project Based Learning (PjBL). Proyek yang paling tepat agar peserta didik dapat mengaplikasikan hadis dalam kehidupan sehari-hari adalah...",
    "o": [
      "Membuat makalah tentang sejarah kodifikasi hadis.",
      "Menghafal 5 hadis tentang kebersihan lingkungan.",
      "Membuat infografis tentang hadis-hadis ekonomi syariah dan mengunggahnya ke media sosial.",
      "Mengerjakan soal latihan mengenai jenis-jenis hadis.",
      "Membaca buku teks hadis di perpustakaan."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran tafsir tentang 'Demokrasi', guru meminta peserta didik untuk menganalisis ayat-ayat terkait musyawarah, kemudian membandingkannya dengan praktik demokrasi di Indonesia. Pendekatan ini bertujuan agar peserta didik mampu...",
    "o": [
      "Menghafal ayat-ayat tentang musyawarah secara utuh.",
      "Menyalin tafsir ayat dari kitab tafsir klasik.",
      "Berpikir kritis dalam mengkontekstualisasikan nilai Al-Qur'an dengan kehidupan berbangsa.",
      "Memahami kelemahan sistem demokrasi barat.",
      "Menyebutkan tokoh-tokoh yang terlibat dalam musyawarah."
    ],
    "a": 2
  },
  {
    "q": "Guru Qur'an Hadis menggunakan pendekatan TPACK (Technological Pedagogical Content Knowledge) untuk menjelaskan materi 'Ilmu Tajwid' mengenai hukum bacaan mad. Kegiatan yang menunjukkan pendekatan tersebut adalah...",
    "o": [
      "Guru menjelaskan teori mad menggunakan papan tulis.",
      "Guru menyuruh siswa membaca buku paket secara bergantian.",
      "Guru menggunakan aplikasi pendeteksi tajwid di smartphone untuk menganalisis bacaan siswa.",
      "Guru memberikan kuis tertulis di kertas.",
      "Guru meminta siswa menghafal macam-macam mad."
    ],
    "a": 2
  },
  {
    "q": "Dalam materi 'Kewajiban Menuntut Ilmu', guru menemukan sebagian peserta didik memiliki gaya belajar kinestetik. Kegiatan pembelajaran yang sesuai dengan karakteristik peserta didik tersebut adalah...",
    "o": [
      "Mendengarkan ceramah guru tentang keutamaan ilmu.",
      "Membaca ayat dan terjemahan tentang ilmu.",
      "Membuat dan mempresentasikan *role playing* (bermain peran) tentang kisah penuntut ilmu.",
      "Menonton video dokumenter tentang tokoh ilmuwan muslim.",
      "Mengerjakan soal esai tentang hukum menuntut ilmu."
    ],
    "a": 2
  },
  {
    "q": "Untuk mengevaluasi tujuan pembelajaran 'Menganalisis Hadis tentang Etika Berbicara', guru melakukan penilaian autentik berupa...",
    "o": [
      "Tes tulis pilihan ganda.",
      "Penilaian jurnal refleksi perilaku peserta didik saat berdiskusi di kelas.",
      "Ujian lisan hafalan matan hadis.",
      "Tes identifikasi perawi hadis.",
      "Ujian akhir semester tertulis."
    ],
    "a": 1
  },
  {
    "q": "Guru Qur'an Hadis ingin menanamkan sikap toleransi (Tasamuh) sesuai materi tafsir. Langkah refleksi tujuan pembelajaran yang paling tepat adalah...",
    "o": [
      "Meminta siswa menghafal definisi tasamuh.",
      "Membuat soal ujian tentang sejarah toleransi.",
      "Meminta siswa menuliskan pengalaman mereka menghargai perbedaan di sekolah.",
      "Menjelaskan dasar hukum tasamuh dalam Al-Qur'an.",
      "Meminta siswa menyebutkan contoh perilaku tidak toleran."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran berbasis HOTS (Higher Order Thinking Skills), guru memberikan kasus tentang berita hoax di media sosial dan meminta peserta didik menganalisisnya berdasarkan hadis tentang kewajiban *tabayyun*. Kegiatan ini melatih kemampuan...",
    "o": [
      "Mengingat hadis tentang hoax.",
      "Memahami bahaya hoax.",
      "Mengevaluasi informasi berdasarkan prinsip hadis.",
      "Menyalin hadis tentang tabayyun.",
      "Mendefinisikan pengertian hoax."
    ],
    "a": 2
  },
  {
    "q": "Guru menggunakan media video tentang kerukunan antarumat beragama untuk mengawali materi tafsir ayat tentang toleransi. Langkah ini bertujuan untuk...",
    "o": [
      "Memenuhi kewajiban penggunaan teknologi.",
      "Menghemat waktu penjelasan guru.",
      "Membangkitkan motivasi dan mengaitkan materi dengan konteks kehidupan nyata.",
      "Mengganti peran guru sebagai sumber utama.",
      "Membuat suasana kelas menjadi santai."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran 'Hadis tentang Kebersihan', guru menggunakan pendekatan saintifik. Langkah 'Mengomunikasikan' yang tepat dilakukan oleh peserta didik adalah...",
    "o": [
      "Mengamati lingkungan sekolah yang kotor.",
      "Membaca hadis tentang kebersihan.",
      "Mendiskusikan hubungan kebersihan dan iman.",
      "Mempresentasikan hasil proyek pembuatan tempat sampah organik.",
      "Bertanya tentang maksud hadis."
    ],
    "a": 3
  },
  {
    "q": "Guru Qur'an Hadis merancang asesmen formatif dengan menggunakan kuis interaktif berbasis aplikasi (seperti Kahoot) di akhir sesi pembelajaran. Tujuan penggunaan aplikasi ini adalah...",
    "o": [
      "Sebagai pengganti ujian akhir semester.",
      "Untuk memberikan nilai tambah kepada siswa yang cepat.",
      "Memberikan umpan balik instan (immediate feedback) mengenai pemahaman siswa.",
      "Menunjukkan bahwa guru menguasai teknologi.",
      "Mengisi waktu luang di akhir pelajaran."
    ],
    "a": 2
  },
  {
    "q": "Materi ajar Qur'an Hadis sering dianggap teoritis. Untuk mengatasi hal tersebut dan meningkatkan keterlibatan peserta didik Gen Z, strategi yang paling tepat adalah...",
    "o": [
      "Menambah jumlah teks yang harus dibaca siswa.",
      "Mengurangi diskusi dan fokus pada ceramah guru.",
      "Menerapkan *gamification* dalam pembelajaran konsep hadis.",
      "Memberikan tugas merangkum buku paket.",
      "Mewajibkan siswa menghafal seluruh isi materi."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran tafsir ayat tentang 'Ekonomi Syariah', guru meminta peserta didik menganalisis fenomena bank keliling di sekitar mereka. Alur tujuan pembelajaran yang paling sesuai adalah...",
    "o": [
      "Menghafal ayat -> Membuat rangkuman -> Tes tulis.",
      "Mengamati kasus -> Menganalisis dengan ayat -> Menyimpulkan hukum.",
      "Membaca tafsir -> Menulis kesimpulan -> Diskusi kelompok.",
      "Tes tulis -> Ceramah guru -> Mengerjakan tugas.",
      "Menonton video -> Mencatat isi video -> Tes lisan."
    ],
    "a": 1
  },
  {
    "q": "Guru menggunakan model *Discovery Learning* pada materi 'Ulumul Qur'an'. Peserta didik diberikan data sejarah turunnya ayat, kemudian diminta merumuskan definisi Makkiyah dan Madaniyah. Langkah ini menunjukkan bahwa guru...",
    "o": [
      "Menjadikan siswa sebagai pusat pembelajaran (student-centered).",
      "Menghemat waktu pengajaran.",
      "Menghindari penggunaan buku teks.",
      "Memaksa siswa menghafal data sejarah.",
      "Mengabaikan gaya belajar siswa."
    ],
    "a": 0
  },
  {
    "q": "Untuk materi 'Hadis Dhaif', guru menyajikan beberapa hadis dan meminta siswa mencari informasi tentang perawi dalam hadis tersebut menggunakan kitab digital *Mausu'ah al-Hadis*. Tindakan guru ini bertujuan untuk...",
    "o": [
      "Membuat siswa sibuk dengan gadget.",
      "Mengurangi peran buku cetak.",
      "Mengembangkan keterampilan literasi digital dan kemampuan *critical thinking* siswa.",
      "Mempermudah siswa menyalin jawaban.",
      "Menunjukkan kecanggihan teknologi."
    ],
    "a": 2
  },
  {
    "q": "Evaluasi pembelajaran pada ranah afektif untuk materi 'Akhlak terhadap Orang Tua' yang paling sesuai untuk generasi Alpha adalah...",
    "o": [
      "Tes tulis pilihan ganda tentang dalil akhlak.",
      "Penilaian diri (*self-assessment*) melalui aplikasi jurnal harian.",
      "Ujian lisan mengenai definisi akhlak.",
      "Tugas membuat makalah tentang sejarah orang tua.",
      "Tes kognitif tentang batasan aurat."
    ],
    "a": 1
  },
  {
    "q": "Sebagai guru profesional, langkah pertama yang dilakukan saat akan merancang pembelajaran Qur'an Hadis di era digital adalah...",
    "o": [
      "Mencari video di YouTube yang relevan.",
      "Membuat kuis di Kahoot.",
      "Menganalisis karakteristik dan kebutuhan belajar peserta didik.",
      "Menyusun evaluasi pembelajaran.",
      "Membaca buku paket untuk menentukan materi."
    ],
    "a": 2
  },
  {
    "q": "Seorang guru menyadari bahwa kelasnya memiliki gaya belajar campuran (visual, auditori, kinestetik). Untuk materi 'Cara Membaca Al-Qur'an', media yang paling efektif digunakan adalah...",
    "o": [
      "Papan tulis.",
      "Buku paket.",
      "Video tutorial tajwid interaktif disertai simulasi praktik.",
      "Peta konsep.",
      "Rekaman suara guru."
    ],
    "a": 2
  },
  {
    "q": "Dalam merancang RPP (Rencana Pelaksanaan Pembelajaran), tujuan pembelajaran harus memenuhi unsur ABCD. Komponen 'C' (Condition) yang tepat dalam pembelajaran Qur'an Hadis adalah...",
    "o": [
      "Melalui diskusi kelompok dan kajian literatur...",
      "Peserta didik mampu menganalisis...",
      "Hadis tentang persaudaraan...",
      "Dengan benar dan tepat...",
      "Di depan kelas..."
    ],
    "a": 0
  },
  {
    "q": "Evaluasi tujuan pembelajaran 'Mempraktikkan Hadis tentang Niat' paling tepat dilakukan melalui...",
    "o": [
      "Tes tulis mengenai pengertian niat.",
      "Observasi perilaku siswa sehari-hari dalam bertindak.",
      "Tes lisan menghafal hadis niat.",
      "Analisis kasus tentang orang yang tidak niat.",
      "Menulis resume tentang sejarah hadis niat."
    ],
    "a": 1
  },
  {
    "q": "Di era AI (Artificial Intelligence), guru Qur'an Hadis harus bertransformasi. Masalah utama yang sering muncul adalah AI memberikan jawaban instan yang tidak akurat. Solusi ilmiah yang tepat adalah...",
    "o": [
      "Melarang penggunaan AI sama sekali.",
      "Menggunakan AI sebagai sumber jawaban tunggal.",
      "Mengajarkan siswa cara memvalidasi jawaban AI dengan merujuk pada kitab tafsir/hadis standar.",
      "Meminta AI mengerjakan semua tugas siswa.",
      "Fokus pada tes tulis manual saja."
    ],
    "a": 2
  },
  {
    "q": "Guru Qur'an Hadis menggunakan teknologi VR (*Virtual Reality*) untuk membawa siswa ke museum sejarah Islam. Hal ini sesuai dengan pembelajaran berbasis masalah (PBL) pada materi sejarah, yaitu...",
    "o": [
      "Siswa menghafal nama museum.",
      "Siswa mengevaluasi keaslian barang museum.",
      "Siswa mengamati dan menganalisis bukti fisik sejarah peradaban Islam secara langsung.",
      "Siswa membuat laporan kunjungan museum.",
      "Siswa mengerjakan soal tes tentang sejarah."
    ],
    "a": 2
  },
  {
    "q": "Untuk meningkatkan kemampuan berpikir kritis siswa dalam materi 'Hukum Waris dalam Al-Qur'an', guru menggunakan metode...",
    "o": [
      "Ceramah.",
      "Hafalan.",
      "Studi kasus.",
      "Pemberian tugas.",
      "Demonstrasi."
    ],
    "a": 2
  },
  {
    "q": "Indikator yang menunjukkan pembelajaran Qur'an Hadis sudah berbasis keterampilan abad 21 (4C) adalah...",
    "o": [
      "Siswa mampu menghafal seluruh hadis.",
      "Siswa mampu berkolaborasi memecahkan masalah sosial berdasarkan ayat.",
      "Siswa mampu menyalin tulisan ayat dengan indah.",
      "Siswa mampu mengerjakan soal ujian dengan cepat.",
      "Siswa mampu diam mendengarkan penjelasan guru."
    ],
    "a": 1
  },
  {
    "q": "Dalam evaluasi hasil belajar, guru menemukan bahwa hasil tes tulis siswa rendah, namun kemampuan praktiknya baik. Tindakan refleksi yang harus dilakukan guru adalah...",
    "o": [
      "Menurunkan standar kelulusan.",
      "Meningkatkan beban tugas tertulis.",
      "Mengubah strategi pembelajaran agar seimbang antara kognitif dan psikomotorik.",
      "Memarahi siswa karena tidak belajar.",
      "Fokus hanya pada nilai praktik."
    ],
    "a": 2
  },
  {
    "q": "Soal: Seorang guru menggunakan AI untuk pembelajaran Qur'an Hadis dengan tujuan memberikan pembelajaran yang bermakna. Masalah yang sering terjadi adalah ketergantungan pada teknologi yang mengurangi interaksi langsung. Solusi yang paling tepat adalah:",
    "o": [
      "Menggunakan teknologi yang lebih sederhana dan langsung.",
      "Menggabungkan AI dengan diskusi tatap muka dan tugas berbasis proyek.",
      "Menggunakan lebih banyak materi cetak dan manual tanpa bantuan teknologi.",
      "Fokus pada penggunaan teknik menghafal secara tradisional.",
      "Mengurangi penggunaan teknologi sepenuhnya dalam pembelajaran."
    ],
    "a": 1
  }
]
