[
  {
    "q": "Rafi, siswa kelas 7, mempelajari materi tentang kondisi kehidupan masyarakat Arab sebelum datangnya Islam yang ditandai dengan ketidakadilan sosial. Guru mengaitkan materi tersebut dengan pentingnya ajaran Islam dalam memperbaiki akhlak dan kehidupan manusia. Tujuan pembelajaran ranah sikap yang paling tepat adalah",
    "o": [
      "Mengidentifikasi bentuk-bentuk ketidakadilan sosial masyarakat Arab pra-Islam",
      "Menjelaskan kondisi ekonomi masyarakat Arab sebelum Islam",
      "Menumbuhkan sikap beriman, bertakwa, dan berakhlak mulia setelah memahami kondisi masyarakat Arab pra-Islam",
      "Membandingkan kehidupan sosial masyarakat Arab sebelum dan sesudah Islam",
      "Menganalisis dampak dakwah Islam terhadap sistem sosial masyarakat Arab"
    ],
    "a": 2
  },
  {
    "q": "Peserta didik mengkaji penentangan terhadap dakwah Nabi Muhammad SAW pada periode Makkah serta menghubungkannya dengan kondisi sosial masyarakat Quraisy. Rumusan tujuan pembelajaran ranah pengetahuan yang paling tepat adalah",
    "o": [
      "Menganalisis keterkaitan antara kondisi sosial masyarakat Quraisy dengan strategi dakwah Nabi Muhammad SAW di Makkah",
      "Menyebutkan tokoh-tokoh Quraisy yang menentang dakwah Nabi Muhammad SAW",
      "Menghafal peristiwa-peristiwa penting dakwah Nabi Muhammad SAW di Makkah",
      "Menjelaskan silsilah Nabi Muhammad SAW",
      "Menyusun urutan waktu dakwah Nabi Muhammad SAW sebelum hijrah"
    ],
    "a": 0
  },
  {
    "q": "Peserta didik berdiskusi kelompok mempelajari kebijakan pemerintahan pada masa Abu Bakar Ash-Shiddiq dan Umar bin Khattab untuk menumbuhkan semangat gotong royong. Tujuan pembelajaran ranah keterampilan yang paling tepat adalah",
    "o": [
      "Menjelaskan kebijakan pemerintahan pada masa Abu Bakar dan Umar bin Khattab",
      "Menghafal kebijakan pemerintahan Khalifah Abu Bakar dan Umar bin Khattab",
      "Membandingkan sistem pemerintahan pada masa Khulafaur Rasyidin",
      "Menyajikan hasil kerja kelompok tentang penerapan nilai kerja sama dalam perancangan konsep pemerintahan Islam",
      "Menganalisis dinamika politik pada masa Khulafaur Rasyidin"
    ],
    "a": 3
  },
  {
    "q": "Dalam pembelajaran tentang teori masuknya Islam ke Indonesia, guru menekankan keterbukaan terhadap interaksi Islam dan budaya lokal. Indikator tujuan pembelajaran ranah sikap yang paling tepat adalah",
    "o": [
      "Menjelaskan teori Gujarat, Persia, dan Arab tentang masuknya Islam ke Indonesia",
      "Mengidentifikasi tokoh-tokoh penyebar Islam di Nusantara",
      "Membandingkan perbedaan teori masuknya Islam ke Indonesia",
      "Menunjukkan sikap menghargai dan menerima keberagaman budaya dalam proses penyebaran Islam di Indonesia",
      "Menganalisis pengaruh budaya lokal terhadap perkembangan Islam di Nusantara"
    ],
    "a": 3
  },
  {
    "q": "Peserta didik menelaah kebijakan dan pembaruan Dinasti Ayyubiyah agar memiliki pola pikir dinamis dan inovatif. Indikator tujuan pembelajaran ranah pengetahuan yang paling sesuai adalah",
    "o": [
      "Menyebutkan tokoh-tokoh penting pada masa Dinasti Ayyubiyah",
      "Menghafal tahun berdirinya dan runtuhnya Dinasti Ayyubiyah",
      "Menjelaskan susunan pemerintahan Dinasti Ayyubiyah",
      "Menganalisis bentuk pembaruan dan inovasi pemerintahan yang diterapkan pada masa Dinasti Ayyubiyah",
      "Mengidentifikasi wilayah kekuasaan Dinasti Ayyubiyah"
    ],
    "a": 3
  },
  {
    "q": "Dalam pembelajaran berbasis proyek, peserta didik mengumpulkan data tentang kehidupan masyarakat Arab pra-Islam dan menyajikannya secara sistematis. Tujuan pembelajaran yang paling tepat adalah",
    "o": [
      "Membandingkan kehidupan masyarakat Arab pra-Islam dan pasca-Islam",
      "Menyusun laporan hasil penelitian tentang berbagai aspek kehidupan masyarakat Arab pra-Islam",
      "Menganalisis kondisi sosial dan politik masyarakat Arab pra-Islam",
      "Menghafal tokoh-tokoh penting masyarakat Arab pra-Islam",
      "Menentukan letak geografis wilayah Jazirah Arab"
    ],
    "a": 1
  },
  {
    "q": "Peserta didik diminta membuat peta konsep kondisi sosial masyarakat Makkah dan Madinah sebelum hijrah Nabi Muhammad SAW. Tujuan pembelajaran yang paling tepat adalah",
    "o": [
      "Menganalisis kondisi sosial masyarakat Makkah dan Madinah sebelum hijrah",
      "Menyusun peta konsep tentang kondisi sosial masyarakat Makkah dan Madinah sebelum hijrah",
      "Mengidentifikasi perubahan sosial masyarakat Arab setelah datangnya Islam",
      "Membandingkan perkembangan ekonomi masyarakat Makkah dan Madinah",
      "Menganalisis strategi dakwah Nabi Muhammad SAW sebelum hijrah"
    ],
    "a": 1
  },
  {
    "q": "Guru ingin mengevaluasi sejauh mana peserta didik mampu menemukan konsep kebijakan Khulafaur Rasyidin secara mandiri melalui Discovery Learning. Cara paling tepat adalah",
    "o": [
      "Menugaskan siswa menulis rangkuman kebijakan Khulafaur Rasyidin",
      "Menggunakan tes tertulis pilihan ganda",
      "Mengadakan tanya jawab singkat",
      "Menyajikan permasalahan atau studi kasus kebijakan Khulafaur Rasyidin untuk dianalisis",
      "Memberikan latihan hafalan"
    ],
    "a": 3
  },
  {
    "q": "Dalam pembelajaran PAI dengan pendekatan TPACK, guru memadukan materi, strategi, dan teknologi untuk menjelaskan perkembangan ilmu pengetahuan pada masa khalifah. Alur penyajian materi yang paling tepat adalah",
    "o": [
      "Memanfaatkan media digital seperti video atau infografis interaktif",
      "Menyampaikan materi melalui ceramah",
      "Menugaskan siswa membuat proyek tanpa teknologi",
      "Menggunakan alat peraga konvensional",
      "Menyajikan materi secara naratif tanpa media"
    ],
    "a": 0
  },
  {
    "q": "Guru menerapkan pembelajaran diferensiasi dalam materi sejarah masuknya Islam ke berbagai wilayah. Alur pembelajaran yang paling tepat adalah",
    "o": [
      "Menjelaskan materi menggunakan satu buku teks",
      "Menyampaikan materi melalui ceramah",
      "Menyediakan beragam sumber dan aktivitas belajar sesuai gaya belajar siswa",
      "Mengelompokkan siswa berdasarkan wilayah",
      "Menilai hasil belajar dengan ujian tertulis saja"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran tentang sistem pemerintahan Dinasti Ayyubiyah, guru menerapkan pendekatan konseling agar peserta didik memahami materi melalui dialog, refleksi, dan penguatan sikap. Alur evaluasi yang paling tepat sesuai pendekatan tersebut adalah",
    "o": [
      "Menyampaikan kembali materi kebijakan Dinasti Ayyubiyah melalui ceramah.",
      "Mengumpulkan data sejarah politik Dinasti Ayyubiyah secara individu.",
      "Menugaskan siswa membuat proyek analisis keruntuhan Dinasti Ayyubiyah.",
      "Melaksanakan diskusi kelompok terarah yang mendorong refleksi dan saling berbagi pandangan.",
      "Memberikan tugas hafalan tentang tokoh-tokoh Dinasti Ayyubiyah."
    ],
    "a": 3
  },
  {
    "q": "Dalam pelaksanaan Program Penguatan Profil Pelajar Pancasila (P5), guru merancang materi ajar agar peserta didik menginternalisasi nilai-nilai Pancasila melalui pengalaman belajar bermakna. Pengembangan materi ajar yang paling tepat adalah",
    "o": [
      "Menyusun materi sejarah perumusan Pancasila secara tekstual.",
      "Mengaitkan nilai-nilai Pancasila dengan aktivitas dan permasalahan dalam kehidupan sehari-hari peserta didik.",
      "Memberikan tes tertulis tentang isi sila-sila Pancasila.",
      "Menugaskan peserta didik menghafal nilai-nilai Pancasila.",
      "Menyajikan materi Pancasila melalui ceramah satu arah."
    ],
    "a": 1
  },
  {
    "q": "Dalam upaya penguatan Profil Pelajar Rahmatan lil ‘Alamin (PPRA), guru mengembangkan materi ajar yang menumbuhkan sikap moderat, toleran, dan peduli terhadap sesama. Pengembangan materi ajar yang paling tepat adalah",
    "o": [
      "Menjelaskan teks-teks klasik tentang Islam rahmatan lil ‘alamin secara teoritis.",
      "Mengajarkan prinsip toleransi dan kasih sayang melalui diskusi kelompok dan refleksi bersama.",
      "Menggunakan video kisah toleransi Islam tanpa tindak lanjut aktivitas belajar.",
      "Menggunakan media massa untuk menyampaikan nilai-nilai Islam secara satu arah.",
      "Mengkaji literatur Islam tanpa mengaitkannya dengan praktik kehidupan sehari-hari."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran tentang moderasi beragama, guru merancang materi ajar agar peserta didik memahami sikap adil, seimbang, dan toleran dalam kehidupan bermasyarakat. Pengembangan materi ajar yang paling tepat adalah",
    "o": [
      "Mengajarkan sejarah moderasi beragama secara teoritis tanpa mengaitkan dengan kehidupan nyata.",
      "Memberikan ujian tertulis untuk mengukur pemahaman konsep moderasi beragama.",
      "Menggunakan studi kasus nyata tentang penerapan moderasi beragama dalam kehidupan sehari-hari.",
      "Menyampaikan ceramah satu arah tanpa melibatkan diskusi siswa.",
      "Menghindari pembahasan dan dialog terkait moderasi beragama."
    ],
    "a": 2
  },
  {
    "q": "Dalam pengajaran moderasi beragama, guru memilih pengembangan materi ajar yang kontekstual dan berbasis kehidupan nyata. Alasan paling tepat atas pemilihan tersebut adalah",
    "o": [
      "Moderasi beragama menekankan keseimbangan antara penguatan iman dan tanggung jawab dalam kehidupan sosial.",
      "Moderasi beragama lebih menekankan pada penguasaan hafalan teks-teks keagamaan.",
      "Moderasi beragama berfokus pada pemahaman ritual keagamaan secara individual.",
      "Moderasi beragama bertujuan membatasi interaksi sosial antarumat beragama.",
      "Moderasi beragama mengutamakan aspek ibadah personal dibandingkan kehidupan bermasyarakat."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran peradaban Arab pra-Islam dengan pendekatan Problem Based Learning (PBL), guru merancang kegiatan belajar yang diawali dengan permasalahan nyata. Rancangan pembelajaran yang paling tepat adalah",
    "o": [
      "Menyampaikan materi peradaban Arab pra-Islam melalui ceramah panjang.",
      "Menyajikan permasalahan kontekstual tentang kehidupan masyarakat Arab pra-Islam untuk dianalisis dan dicari solusinya oleh siswa.",
      "Menggunakan media presentasi satu arah tanpa keterlibatan siswa.",
      "Mengadakan tes hafalan tentang sejarah Arab pra-Islam.",
      "Menugaskan siswa menghafal tokoh-tokoh Arab pra-Islam secara individual."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran tentang peristiwa hijrah Nabi Muhammad SAW dengan pendekatan Problem Based Learning (PBL), rancangan pembelajaran yang paling tepat adalah",
    "o": [
      "Menayangkan video perjalanan hijrah Nabi Muhammad SAW tanpa tindak lanjut diskusi.",
      "Memberikan soal pilihan ganda tentang peristiwa hijrah Nabi Muhammad SAW.",
      "Mengajukan pertanyaan atau permasalahan kontekstual terkait peristiwa hijrah untuk dianalisis dan didiskusikan oleh siswa.",
      "Menyampaikan materi hijrah Nabi Muhammad SAW melalui ceramah tanpa diskusi.",
      "Menggunakan metode ceramah satu arah selama pembelajaran."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran tentang akhir pemerintahan Khulafaur Rasyidin yang didukung teknologi digital, rancangan pembelajaran yang paling tepat adalah",
    "o": [
      "Menugaskan siswa menulis esai tanpa pemanfaatan teknologi.",
      "Menggunakan media atau simulasi berbasis teknologi untuk menggambarkan dan menjelaskan peristiwa akhir pemerintahan Khulafaur Rasyidin.",
      "Memberikan kuis hafalan tentang nama-nama khalifah.",
      "Menyampaikan materi melalui ceramah tanpa melibatkan teknologi pembelajaran.",
      "Menghindari penggunaan teknologi dalam pembelajaran."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran tentang wafatnya Khalifah Utsman bin Affan dan Ali bin Abi Thalib dengan pendekatan diferensiasi, rancangan pembelajaran yang paling tepat adalah",
    "o": [
      "Menyediakan satu jenis video dokumenter yang sama untuk seluruh siswa.",
      "Menyampaikan materi melalui ceramah tanpa mempertimbangkan perbedaan individu.",
      "Memberikan tugas yang sama kepada semua siswa tanpa variasi.",
      "Memberikan tugas pembelajaran yang disesuaikan dengan gaya belajar siswa seperti visual, auditori, dan kinestetik.",
      "Membatasi aktivitas belajar siswa hanya pada kegiatan mendengarkan penjelasan guru."
    ],
    "a": 3
  },
  {
    "q": "Dalam pembelajaran tentang dakwah Walisongo dengan pendekatan dferensiasi, rancangan pembelajaran yang paling tepat adalah",
    "o": [
      "Menugaskan seluruh siswa membuat peta konsep tentang Walisongo secara mandiri.",
      "Menyampaikan materi dakwah Walisongo melalui ceramah satu arah.",
      "Menyediakan berbagai sumber belajar dan aktivitas yang disesuaikan dengan kebutuhan serta karakteristik siswa.",
      "Menggunakan satu buku teks sebagai satu-satunya rujukan pembelajaran.",
      "Menerapkan satu metode pembelajaran tanpa variasi."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran tentang perkembangan ilmu pengetahuan pada masa Dinasti Abbasiyah, guru ingin menumbuhkan sikap apresiatif terhadap kemajuan peradaban Islam. Tujuan pembelajaran ranah sikap yang paling tepat adalah",
    "o": [
      "Menghafal nama-nama ilmuwan pada masa Dinasti Abbasiyah.",
      "Menjelaskan bidang-bidang ilmu yang berkembang pada masa Dinasti Abbasiyah.",
      "Menunjukkan sikap bangga dan menghargai kontribusi peradaban Islam terhadap perkembangan ilmu pengetahuan dunia.",
      "Menganalisis faktor politik yang memengaruhi kemajuan Dinasti Abbasiyah.",
      "Menyusun kronologi berdirinya Dinasti Abbasiyah."
    ],
    "a": 2
  },
  {
    "q": "Peserta didik mempelajari faktor-faktor kemajuan peradaban Islam pada masa Bani Umayyah. Tujuan pembelajaran ranah pengetahuan yang paling tepat adalah",
    "o": [
      "Menyebutkan nama-nama khalifah Bani Umayyah.",
      "Menganalisis faktor-faktor yang menyebabkan kemajuan peradaban Islam pada masa Bani Umayyah.",
      "Menghafal wilayah kekuasaan Dinasti Umayyah.",
      "Menunjukkan sikap toleransi dalam kehidupan bermasyarakat.",
      "Menyajikan peta wilayah kekuasaan Dinasti Umayyah."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran tentang masuk dan berkembangnya Islam di Indonesia, peserta didik diminta menyajikan hasil kajian dalam bentuk presentasi. Tujuan pembelajaran ranah keterampilan yang paling tepat adalah",
    "o": [
      "Menjelaskan teori masuknya Islam ke Indonesia.",
      "Menganalisis peran ulama dalam penyebaran Islam di Indonesia.",
      "Menyajikan hasil kajian tentang perkembangan Islam di Indonesia secara lisan dan sistematis.",
      "Menghafal nama-nama kerajaan Islam di Indonesia.",
      "Membandingkan teori-teori masuknya Islam ke Indonesia."
    ],
    "a": 2
  },
  {
    "q": "Guru menerapkan model Project Based Learning (PjBL) dalam materi kerajaan-kerajaan Islam di Nusantara. Aktivitas pembelajaran yang paling tepat adalah",
    "o": [
      "Memberikan ceramah tentang kerajaan-kerajaan Islam di Nusantara.",
      "Menugaskan siswa menghafal raja-raja Islam di Indonesia.",
      "Mengajak siswa mengerjakan proyek pembuatan laporan atau media tentang salah satu kerajaan Islam di Nusantara.",
      "Memberikan tes tertulis pilihan ganda.",
      "Menyuruh siswa membaca buku teks secara mandiri."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran tentang nilai-nilai keteladanan Nabi Muhammad SAW, guru ingin mengaitkan materi dengan kehidupan peserta didik sehari-hari. Pendekatan pembelajaran yang paling tepat adalah",
    "o": [
      "Pendekatan tekstual dan hafalan.",
      "Pendekatan ceramah satu arah.",
      "Pendekatan kontekstual yang mengaitkan keteladanan Nabi dengan kehidupan nyata.",
      "Pendekatan evaluatif melalui tes tertulis.",
      "Pendekatan individual tanpa diskusi."
    ],
    "a": 2
  },
  {
    "q": "Peserta didik menganalisis peristiwa Perjanjian Hudaibiyah dalam pembelajaran sejarah Islam. Tujuan pembelajaran ranah pengetahuan yang paling tepat adalah",
    "o": [
      "Menghafal isi Perjanjian Hudaibiyah.",
      "Menyusun kronologi perjalanan Nabi Muhammad SAW.",
      "Menganalisis makna dan dampak Perjanjian Hudaibiyah bagi perkembangan Islam.",
      "Menyebutkan tokoh-tokoh Quraisy yang terlibat.",
      "Menjelaskan silsilah Nabi Muhammad SAW."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran tentang kepemimpinan Khulafaur Rasyidin, guru ingin menumbuhkan karakter tanggung jawab dan keadilan. Indikator pencapaian yang paling tepat adalah",
    "o": [
      "Peserta didik mampu menyebutkan nama-nama Khulafaur Rasyidin.",
      "Peserta didik mampu menghafal masa pemerintahan Khulafaur Rasyidin.",
      "Peserta didik mampu menunjukkan sikap adil dan bertanggung jawab dalam kehidupan sehari-hari.",
      "Peserta didik mampu menyusun makalah tentang Khulafaur Rasyidin.",
      "Peserta didik mampu menjelaskan sistem pemerintahan Islam."
    ],
    "a": 2
  },
  {
    "q": "Guru menggunakan media digital interaktif dalam pembelajaran sejarah kebudayaan Islam. Tujuan utama penggunaan media tersebut adalah",
    "o": [
      "Menggantikan peran guru sepenuhnya.",
      "Mempermudah peserta didik menghafal materi.",
      "Meningkatkan motivasi dan pemahaman peserta didik melalui pembelajaran yang menarik.",
      "Mengurangi waktu diskusi di kelas.",
      "Menjadikan pembelajaran bersifat satu arah."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran diferensiasi, guru memberikan pilihan tugas esai, poster, atau presentasi kepada peserta didik. Tujuan utama strategi tersebut adalah",
    "o": [
      "Menyamakan hasil belajar seluruh peserta didik.",
      "Menyesuaikan pembelajaran dengan minat, kebutuhan, dan gaya belajar peserta didik.",
      "Mempermudah guru dalam melakukan penilaian.",
      "Mengurangi aktivitas belajar peserta didik.",
      "Membatasi kreativitas peserta didik."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran sejarah kebudayaan Islam, guru menilai sikap toleransi peserta didik melalui observasi selama diskusi. Teknik penilaian yang digunakan adalah",
    "o": [
      "Tes tertulis.",
      "Penilaian produk.",
      "Penilaian sikap melalui observasi.",
      "Penilaian portofolio.",
      "Penilaian proyek."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran tentang peran ulama dalam perkembangan Islam di Indonesia, guru ingin menumbuhkan sikap menghargai jasa para tokoh penyebar Islam. Tujuan pembelajaran ranah sikap yang paling tepat adalah",
    "o": [
      "Menghafal nama-nama ulama penyebar Islam di Indonesia.",
      "Menjelaskan wilayah dakwah para ulama di Nusantara.",
      "Menunjukkan sikap hormat dan menghargai jasa para ulama dalam menyebarkan Islam.",
      "Menganalisis metode dakwah para ulama di Indonesia.",
      "Menyusun kronologi masuknya Islam ke Indonesia."
    ],
    "a": 2
  },
  {
    "q": "Peserta didik mempelajari strategi dakwah Walisongo yang menyesuaikan dengan budaya lokal. Tujuan pembelajaran ranah pengetahuan yang paling tepat adalah",
    "o": [
      "Menyebutkan nama-nama anggota Walisongo.",
      "Menganalisis strategi dakwah Walisongo yang akomodatif terhadap budaya lokal.",
      "Menghafal tahun berdirinya kerajaan Islam di Jawa.",
      "Menunjukkan sikap toleransi antarumat beragama.",
      "Menyajikan peta wilayah dakwah Walisongo."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran berbasis diskusi tentang kerajaan Samudera Pasai, guru ingin melatih keterampilan komunikasi peserta didik. Tujuan pembelajaran ranah keterampilan yang paling tepat adalah",
    "o": [
      "Menjelaskan sejarah berdirinya Kerajaan Samudera Pasai.",
      "Menghafal raja-raja Kerajaan Samudera Pasai.",
      "Menyampaikan pendapat secara lisan tentang peran Samudera Pasai dalam penyebaran Islam.",
      "Menganalisis faktor runtuhnya Kerajaan Samudera Pasai.",
      "Menyusun laporan tertulis tentang Kerajaan Samudera Pasai."
    ],
    "a": 2
  },
  {
    "q": "Guru menerapkan pendekatan Contextual Teaching and Learning (CTL) dalam materi sejarah kebudayaan Islam. Aktivitas pembelajaran yang paling tepat adalah",
    "o": [
      "Menyampaikan materi melalui ceramah panjang.",
      "Mengaitkan materi sejarah Islam dengan situasi dan permasalahan yang dekat dengan kehidupan peserta didik.",
      "Memberikan latihan soal pilihan ganda secara terus-menerus.",
      "Menugaskan peserta didik menghafal materi.",
      "Menggunakan satu buku teks sebagai sumber utama."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran tentang Piagam Madinah, peserta didik diminta menganalisis nilai-nilai persatuan dan toleransi. Tujuan pembelajaran yang paling tepat adalah",
    "o": [
      "Menghafal isi Piagam Madinah.",
      "Menyebutkan tokoh-tokoh yang terlibat dalam Piagam Madinah.",
      "Menganalisis nilai persatuan dan toleransi yang terkandung dalam Piagam Madinah.",
      "Menyusun kronologi hijrah Nabi Muhammad SAW.",
      "Menjelaskan latar belakang terbentuknya Piagam Madinah."
    ],
    "a": 2
  },
  {
    "q": "Guru menggunakan metode debat dalam pembelajaran sejarah Islam untuk melatih berpikir kritis peserta didik. Tujuan utama penggunaan metode tersebut adalah",
    "o": [
      "Meningkatkan kemampuan menghafal materi sejarah.",
      "Melatih peserta didik menyampaikan dan mempertahankan pendapat secara logis.",
      "Mempermudah guru menyampaikan materi.",
      "Mengurangi interaksi antar peserta didik.",
      "Menyelesaikan materi pembelajaran dengan cepat."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran tentang kepemimpinan Nabi Muhammad SAW di Madinah, indikator pencapaian ranah sikap yang paling tepat adalah",
    "o": [
      "Peserta didik mampu menyebutkan kebijakan Nabi Muhammad SAW.",
      "Peserta didik mampu menghafal peristiwa penting di Madinah.",
      "Peserta didik menunjukkan sikap adil, jujur, dan bertanggung jawab dalam kehidupan sehari-hari.",
      "Peserta didik mampu menganalisis strategi dakwah Nabi Muhammad SAW.",
      "Peserta didik mampu menyusun laporan tertulis."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran sejarah kebudayaan Islam berbasis literasi digital, aktivitas yang paling tepat adalah",
    "o": [
      "Membaca satu buku teks cetak secara mandiri.",
      "Mengumpulkan artikel digital dari berbagai sumber tepercaya dan mendiskusikannya.",
      "Menghafal materi dari modul pembelajaran.",
      "Mendengarkan ceramah guru tanpa diskusi.",
      "Mengerjakan soal pilihan ganda."
    ],
    "a": 1
  },
  {
    "q": "Guru ingin menilai keterampilan kolaborasi peserta didik dalam pembelajaran kelompok. Teknik penilaian yang paling tepat adalah",
    "o": [
      "Tes tertulis.",
      "Penilaian proyek.",
      "Observasi proses kerja kelompok.",
      "Penilaian portofolio individu.",
      "Penilaian hasil akhir saja."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran sejarah Islam, guru memberikan umpan balik secara berkelanjutan selama proses belajar. Tujuan utama pemberian umpan balik tersebut adalah",
    "o": [
      "Menentukan nilai akhir peserta didik.",
      "Meningkatkan motivasi dan memperbaiki proses belajar peserta didik.",
      "Menggantikan peran evaluasi akhir.",
      "Mempercepat penyampaian materi.",
      "Mengurangi tanggung jawab peserta didik."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran tentang nilai keadilan dalam Islam, guru ingin peserta didik mampu menerapkan nilai tersebut dalam kehidupan sekolah. Indikator ranah sikap yang paling tepat adalah",
    "o": [
      "Peserta didik mampu menjelaskan pengertian keadilan dalam Islam.",
      "Peserta didik mampu menyebutkan dalil tentang keadilan.",
      "Peserta didik menunjukkan perilaku adil dalam berinteraksi dengan teman di sekolah.",
      "Peserta didik mampu menganalisis ayat Al-Qur’an tentang keadilan.",
      "Peserta didik mampu menghafal hadis tentang keadilan."
    ],
    "a": 2
  },
  {
    "q": "Peserta didik mempelajari perkembangan seni dan budaya Islam pada masa Dinasti Umayyah. Tujuan pembelajaran ranah pengetahuan yang paling tepat adalah",
    "o": [
      "Menghafal nama-nama bangunan bersejarah Islam.",
      "Menganalisis perkembangan seni dan budaya Islam pada masa Dinasti Umayyah.",
      "Menunjukkan sikap bangga terhadap budaya Islam.",
      "Menyajikan peta wilayah kekuasaan Dinasti Umayyah.",
      "Menyusun laporan perjalanan wisata religi."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran sejarah kebudayaan Islam, peserta didik diminta membuat poster digital. Tujuan pembelajaran ranah keterampilan yang paling tepat adalah",
    "o": [
      "Menjelaskan materi sejarah kebudayaan Islam.",
      "Menghafal peristiwa penting dalam sejarah Islam.",
      "Menyajikan informasi sejarah kebudayaan Islam dalam bentuk visual kreatif.",
      "Menganalisis faktor kemunduran peradaban Islam.",
      "Menunjukkan sikap toleransi dalam diskusi."
    ],
    "a": 2
  },
  {
    "q": "Guru menerapkan pembelajaran kolaboratif dalam materi kepemimpinan Islam. Manfaat utama penerapan pembelajaran tersebut adalah",
    "o": [
      "Meningkatkan kemampuan menghafal peserta didik.",
      "Melatih kerja sama dan tanggung jawab peserta didik dalam kelompok.",
      "Mempermudah guru mengontrol kelas.",
      "Mengurangi aktivitas diskusi peserta didik.",
      "Mempercepat penyampaian materi."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran tentang toleransi antarumat beragama, guru menggunakan studi kasus konflik sosial. Tujuan utama penggunaan studi kasus tersebut adalah",
    "o": [
      "Menambah wawasan peserta didik tentang konflik.",
      "Melatih peserta didik menganalisis masalah dan mencari solusi secara toleran.",
      "Meningkatkan kemampuan menghafal konsep toleransi.",
      "Menyampaikan materi secara cepat.",
      "Menghindari diskusi kelas."
    ],
    "a": 1
  },
  {
    "q": "Peserta didik mempelajari sejarah berdirinya Kerajaan Demak. Tujuan pembelajaran ranah pengetahuan yang paling tepat adalah",
    "o": [
      "Menghafal nama raja-raja Kerajaan Demak.",
      "Menganalisis faktor berdirinya Kerajaan Demak sebagai kerajaan Islam.",
      "Menunjukkan sikap bangga terhadap kerajaan Islam.",
      "Menyajikan drama sejarah Kerajaan Demak.",
      "Menggambar peta wilayah Kerajaan Demak."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran PAI, guru menilai sikap kejujuran peserta didik selama kegiatan ujian. Teknik penilaian yang paling tepat adalah",
    "o": [
      "Tes tertulis.",
      "Penilaian proyek.",
      "Observasi sikap.",
      "Penilaian portofolio.",
      "Penilaian produk."
    ],
    "a": 2
  },
  {
    "q": "Guru memberikan tugas refleksi setelah pembelajaran sejarah Islam. Tujuan utama pemberian tugas refleksi adalah",
    "o": [
      "Menilai kemampuan menghafal peserta didik.",
      "Membantu peserta didik memahami dan memaknai pembelajaran secara mendalam.",
      "Menggantikan evaluasi akhir.",
      "Mengurangi waktu pembelajaran.",
      "Menyeragamkan pendapat peserta didik."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran berbasis proyek, peserta didik diminta bekerja dalam kelompok dengan peran yang berbeda. Tujuan utama pembagian peran tersebut adalah",
    "o": [
      "Mempermudah guru memberikan nilai.",
      "Melatih tanggung jawab dan kerja sama peserta didik.",
      "Menyelesaikan proyek lebih cepat.",
      "Mengurangi diskusi antar peserta didik.",
      "Membatasi kreativitas peserta didik."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran sejarah kebudayaan Islam, guru mengaitkan materi dengan nilai-nilai Profil Pelajar Pancasila. Tujuan utama pengaitan tersebut adalah",
    "o": [
      "Menambah beban materi pembelajaran.",
      "Membentuk peserta didik yang beriman, berkebinekaan, dan berakhlak mulia.",
      "Mempermudah penilaian hasil belajar.",
      "Menggantikan tujuan pembelajaran PAI.",
      "Mengurangi fokus pada materi sejarah."
    ],
    "a": 1
  }
]
