[
  {
    "q": "Disajikan deskripsi materi tentang Kondisi dan Peradaban Jazirah Arab Pra Islam.\n\nSeorang guru merancang beberapa tujuan pembelajaran berikut:\n1. Menganalisis struktur sosial masyarakat Arab pra Islam\n2. Menghargai datangnya Islam sebagai rahmat bagi semesta\n3. Menyajikan video digital tentang perubahan budaya Arab\n4. Menunjukkan sikap menolak perilaku jahiliyah\n5. Mengelompokkan faktor politik pra Islam\n\nBerdasarkan tujuan pembelajaran di atas, ranah sikap yang paling sesuai dengan indikator meningkatkan keimanan, ketakwaan, dan akhlak mulia adalah …",
    "o": [
      "1 dan 3",
      "1 dan 5",
      "2 dan 4",
      "3 dan 5",
      "2 dan 5"
    ],
    "a": 2
  },
  {
    "q": "Sebelum hijrah ke Madinah, Nabi Muhammad SAW menghadapi berbagai tantangan di Mekkah, seperti penentangan kaum Quraisy, tekanan sosial, dan intimidasi terhadap para sahabat.\nMeskipun demikian, beliau tetap konsisten menyampaikan dakwah dengan penuh kesabaran dan strategi yang bijak.\n\nGuru ingin agar siswa tidak sekadar memahami peristiwa sejarah, tetapi juga mampu berpikir kritis terhadap strategi dakwah Nabi Muhammad SAW di Mekkah.\n\nRumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan indikator berpikir kritis adalah …",
    "o": [
      "Peserta didik dapat menghafalkan kronologi dakwah Nabi Muhammad di Mekkah.",
      "Peserta didik dapat membandingkan strategi dakwah Nabi Muhammad dengan tokoh lain.",
      "Peserta didik dapat menjelaskan proses dakwah Nabi Muhammad sebelum hijrah ke Madinah.",
      "Peserta didik dapat menganalisis tantangan dakwah Nabi Muhammad di Mekkah.",
      "Peserta didik dapat menyebutkan nama-nama sahabat yang mendukung Nabi Muhammad di Mekkah."
    ],
    "a": 3
  },
  {
    "q": "Pada masa Khalifah Abu Bakar, sistem pemerintahan dipusatkan untuk menjaga persatuan umat, mengatasi kemurtadan (riddah), dan menyusun strategi pertahanan negara.\nKepemimpinan beliau menekankan kerjasama antarkabilah dalam menjaga stabilitas umat.\n\nGuru ingin menyusun tujuan pembelajaran ranah keterampilan agar peserta didik tidak hanya memahami sejarah, tetapi mampu mengaplikasikan nilai kerjasama dalam aktivitas belajar kolaboratif.\n\nRumusan tujuan pembelajaran ranah keterampilan yang paling sesuai dengan indikator peserta didik memiliki semangat gotong royong adalah …",
    "o": [
      "Peserta didik dapat menyusun laporan tentang strategi politik Abu Bakar dengan rinci.",
      "Peserta didik dapat mempresentasikan hasil analisis sistem pemerintahan Abu Bakar secara individu.",
      "Peserta didik dapat membuat peta konsep digital mengenai pemerintahan Abu Bakar.",
      "Peserta didik dapat merancang proyek kolaboratif berbasis teknologi untuk meneladani Abu Bakar.",
      "Peserta didik dapat menyalin catatan tentang kebijakan Abu Bakar dalam mengatasi riddah."
    ],
    "a": 3
  },
  {
    "q": "Perhatikan penjelasan berikut:\n1. Teori masuknya Islam dari Gujarat dengan bukti tradisi: batu nisan bercorak khas India\n2. Teori masuknya Islam dari Mekkah dengan bukti hubungan ulama dan haji\n3. Teori masuknya Islam dari Persia dengan bukti tradisi Tabot dan Asyura\n4. Teori masuknya Islam dari Cina dengan bukti seni ukir dan kaligrafi\n\nGuru meminta siswa menyusun poster digital kolaboratif yang menampilkan teori masuknya Islam beserta tradisi yang dihasilkannya untuk menumbuhkan sikap penerimaan terhadap keragaman tradisi.\n\nRumusan tujuan pembelajaran ranah sikap yang paling sesuai adalah …",
    "o": [
      "Peserta didik dapat menghafalkan nama-nama teori masuknya Islam di Asia Tenggara.",
      "Peserta didik dapat menyalin ulang tabel teori masuknya Islam dengan bukti tradisinya.",
      "Peserta didik dapat menjelaskan hubungan antara teori masuknya Islam dan bukti sejarahnya.",
      "Peserta didik dapat membuat poster digital kolaboratif penerimaan tradisi masuknya Islam.",
      "Peserta didik dapat menyebutkan contoh tradisi yang berasal dari teori Persia atau Cina."
    ],
    "a": 3
  },
  {
    "q": "Berikut beberapa aspek pemerintahan Dinasti Ayubiyah:\n1) Politik — penguatan militer — stabilitas wilayah\n2) Pendidikan — pendirian madrasah — perkembangan ilmu pengetahuan\n3) Sosial-budaya — toleransi masyarakat multikultural — keharmonisan sosial\n4) Ekonomi — perdagangan internasional — peningkatan kesejahteraan\n\nBerdasarkan data di atas, rumusan indikator tujuan pembelajaran ranah pengetahuan yang paling mencerminkan kemampuan berpikir dinamis dan inovatif adalah …",
    "o": [
      "Mengidentifikasi kebijakan politik Dinasti Ayubiyah yang berhubungan dengan stabilitas wilayah.",
      "Menyusun ringkasan tentang dampak kebijakan sosial Dinasti Ayubiyah terhadap masyarakat multikultural.",
      "Menganalisis hubungan antara kebijakan ekonomi Dinasti Ayubiyah dan kesejahteraan masyarakat.",
      "Merancang model pemerintahan modern Dinasti Ayubiyah berbasis media interaktif.",
      "Menyebutkan manfaat pendirian madrasah pada masa Dinasti Ayubiyah."
    ],
    "a": 2
  },
  {
    "q": "Dalam sebuah kelas, guru membagi siswa menjadi beberapa kelompok dan memberikan akses pada artikel digital serta peta interaktif jazirah Arab.\nSiswa diminta mengidentifikasi masalah utama yang muncul dalam kehidupan bangsa Arab pra-Islam, lalu mendiskusikan bagaimana kondisi tersebut membentuk perilaku sosial mereka.\n\nJika guru ingin merumuskan tujuan pembelajaran yang selaras dengan kegiatan di atas, rumusan yang paling sesuai adalah …",
    "o": [
      "Mengidentifikasi masalah utama dalam kehidupan masyarakat Arab pra-Islam.",
      "Menguraikan bentuk-bentuk kepercayaan bangsa Arab pra-Islam.",
      "Menganalisis sistem kabilah terhadap interaksi sosial Arab pra-Islam.",
      "Menyebutkan bentuk peperangan antar suku di jazirah Arab pra-Islam.",
      "Menghafalkan letak geografis kota-kota penting Arab pra-Islam."
    ],
    "a": 0
  },
  {
    "q": "Guru SKI meminta siswa membuat mind map online tentang kondisi sosio-kultural Madinah pra-Hijrah.\nMind map menunjukkan struktur sosial (Aus, Khazraj, komunitas Yahudi) serta hubungan antar kelompok.\nSiswa diminta menemukan pola dinamika sosial yang melatarbelakangi Piagam Madinah.\n\nTujuan pembelajaran HOTS yang paling tepat adalah …",
    "o": [
      "Menyebutkan kelompok masyarakat yang hidup di Madinah pra-Hijrah.",
      "Menguraikan peran komunitas Yahudi dalam bidang ekonomi Madinah pra-Hijrah.",
      "Menganalisis struktur sosial Madinah pra-Hijrah dan Piagam Madinah.",
      "Menjelaskan kondisi geografis kota Madinah pada masa pra-Hijrah.",
      "Menghafalkan tradisi suku Aus dan Khazraj."
    ],
    "a": 2
  },
  {
    "q": "Seorang guru SKI melakukan evaluasi pembelajaran pada materi Islam masa Khulafaur Rasyidin dengan pendekatan Differentiation Based Learning (DBL).\nPeserta didik dengan kemampuan analitis tinggi diminta menganalisis kebijakan kepemimpinan, sedangkan peserta didik lain diberikan studi kasus sederhana.\n\nRumusan evaluasi tujuan pembelajaran yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan tahun pemerintahan Abu Bakar dan Umar bin Khattab.",
      "Peserta didik mampu menghafal nama-nama kebijakan Abu Bakar dan Umar bin Khattab.",
      "Peserta didik menganalisis kepemimpinan Abu Bakar dan Umar bin Khattab sesuai tingkat kemampuan belajar.",
      "Peserta didik mampu menyalin kembali biografi Abu Bakar dan Umar bin Khattab.",
      "Peserta didik mampu menjawab soal pilihan ganda yang sama tanpa penyesuaian."
    ],
    "a": 2
  },
  {
    "q": "Seorang guru SKI merencanakan pembelajaran tentang perkembangan ilmu pengetahuan pada masa kepemimpinan Utsman bin Affan.\nGuru menggunakan peta konsep digital untuk membantu peserta didik memahami keterkaitan antara kodifikasi Al-Qur'an, administrasi negara, dan sistem pendidikan.\n\nAlur materi ajar yang paling tepat adalah …",
    "o": [
      "Menjelaskan latar belakang sosial politik Utsman bin Affan lalu membandingkannya dengan era modern.",
      "Menguraikan upaya kodifikasi Al-Qur'an, menjelaskan dampaknya terhadap sistem pendidikan, lalu menilai pengaruhnya terhadap perkembangan ilmu pengetahuan.",
      "Mengidentifikasi kebijakan politik Utsman bin Affan dan pengaruhnya pada ekspansi wilayah.",
      "Membahas strategi militer Utsman bin Affan dan mengaitkannya dengan manajemen konflik modern.",
      "Mendeskripsikan silsilah keluarga Utsman bin Affan dan legitimasi kepemimpinannya."
    ],
    "a": 1
  },
  {
    "q": "Seorang guru SKI melaksanakan pembelajaran sejarah masuknya Islam di berbagai wilayah dunia dengan fokus utama Indonesia dan pengayaan wilayah lain.\nPendekatan Deep Learning (DL) digunakan agar peserta didik memahami sebab-akibat dan konteks sosial-budaya.\n\nAlur materi ajar yang paling tepat adalah …",
    "o": [
      "Menyajikan kronologi masuknya Islam di Indonesia saja.",
      "Memulai dengan hafalan tahun dan tokoh masuknya Islam.",
      "Menjelaskan penyebaran Islam secara umum, analisis di Indonesia, lalu membandingkan dengan wilayah lain.",
      "Menampilkan video singkat tanpa diskusi lanjutan.",
      "Menjelaskan satu wilayah secara rinci dan mengabaikan wilayah lain."
    ],
    "a": 2
  },
  {
    "q": "Dalam diskusi kelas berbasis teknologi (Google Jamboard), guru menuliskan tiga faktor penyebab keruntuhan Dinasti Ayyubiyah:\n(1) perebutan kekuasaan antar keluarga,\n(2) lemahnya integrasi politik,\n(3) tekanan dari luar (Perang Salib).\n\nGuru meminta siswa menyusun urutan alur pembelajaran yang logis.\n\nAlur materi ajar yang tepat untuk membantu siswa mengevaluasi tujuan pembelajaran adalah …",
    "o": [
      "Tekanan luar dari Perang Salib → lemahnya integrasi politik → perebutan kekuasaan internal.",
      "Perebutan kekuasaan internal → lemahnya integrasi politik → tekanan luar dari Perang Salib.",
      "Lemahnya integrasi politik → tekanan luar dari Perang Salib → berdirinya Dinasti Mamluk.",
      "Tekanan luar dari Perang Salib → berdirinya Dinasti Mamluk → lemahnya persatuan politik.",
      "Perebutan kekuasaan internal → berdirinya Dinasti Mamluk → konflik sosial Mesir."
    ],
    "a": 1
  },
  {
    "q": "Dalam program P5 bertema \"kebinekaan global\", guru meminta siswa membandingkan sikap toleransi di masyarakat lokal dengan praktik toleransi di negara lain.\nSiswa menuliskan hasil analisisnya di Padlet digital.\n\nPengembangan materi ajar nilai-nilai P5 yang sesuai dalam tujuan pembelajaran adalah …",
    "o": [
      "Siswa dapat mengidentifikasi contoh sikap toleransi dalam masyarakat lokal.",
      "Siswa dapat menganalisis perbedaan dan persamaan praktik toleransi lokal dan global.",
      "Siswa dapat menyebutkan nilai-nilai kebinekaan yang terkandung dalam Pancasila.",
      "Siswa dapat menilai kelebihan sikap toleransi bangsa Indonesia dibanding bangsa lain.",
      "Siswa dapat menjelaskan sejarah kebinekaan Indonesia secara kronologis."
    ],
    "a": 1
  },
  {
    "q": "Seorang guru SKI melaksanakan program PPRA dengan tema kepedulian lingkungan.\nSiswa melakukan observasi kebersihan sekolah, lalu mengunggah laporan hasil analisis dalam bentuk poster digital di Canva.\n\nPengembangan materi ajar PPRA yang paling tepat untuk tujuan pembelajaran adalah …",
    "o": [
      "Siswa dapat menyebutkan aturan kebersihan sekolah dalam bentuk poster.",
      "Siswa dapat mendeskripsikan makna kebersihan menurut Islam.",
      "Siswa dapat menganalisis pentingnya kepedulian lingkungan perspektif Islam.",
      "Siswa dapat menilai kelemahan kebersihan sekolah dibanding sekolah lain.",
      "Siswa dapat menguraikan sejarah kebersihan dalam peradaban Islam."
    ],
    "a": 2
  },
  {
    "q": "Dalam program moderasi beragama di sekolah, guru meminta siswa menyaksikan video pendek tentang praktik gotong royong antar umat beragama di desa.\nSetelah itu, siswa membuat poster digital di Canva yang menunjukkan pesan Islam sebagai agama rahmatan lil 'alamin.\n\nPengembangan materi ajar nilai Islam sebagai agama moderat yang sesuai adalah …",
    "o": [
      "Siswa dapat menyebutkan manfaat gotong royong antar umat beragama.",
      "Siswa dapat menjelaskan ajaran Islam tentang rahmatan lil 'alamin.",
      "Siswa dapat menganalisis praktik gotong royong dengan mengaitkan nilai wasathiyah.",
      "Siswa dapat menilai kelebihan dan kekurangan toleransi di masyarakat modern.",
      "Siswa dapat menguraikan sejarah toleransi antar umat beragama pada masa Nabi."
    ],
    "a": 2
  },
  {
    "q": "Guru SKI mengajak siswa membuat poster digital di Canva setelah menonton video tentang kerja sama lintas agama dalam penanganan bencana alam.\nGuru menekankan bahwa alasan implementasi moderasi beragama harus tampak jelas dalam materi ajar.\n\nAlasan pengembangan materi ajar nilai Islam sebagai agama wasathiyah yang paling sesuai adalah …",
    "o": [
      "Agar siswa dapat menyebutkan contoh kerja sama lintas agama di masyarakat.",
      "Agar siswa mampu menjelaskan pentingnya solidaritas dalam Islam.",
      "Agar siswa dapat menilai kerja sama lintas agama sebagai implementasi moderasi beragama.",
      "Agar siswa memahami sejarah kerja sama umat Islam dengan non-Muslim pada masa Nabi.",
      "Agar siswa menguraikan hikmah musibah dalam perspektif Islam."
    ],
    "a": 2
  },
  {
    "q": "Guru SKI ingin mengajarkan materi Peradaban Bangsa Arab Pra-Islam dengan pendekatan Problem-Based Learning (PBL).\nMasalah otentik yang diberikan adalah konflik antarsuku yang menyebabkan kesenjangan sosial.\nGuru ingin siswa menemukan nilai pentingnya persatuan dan hukum yang adil.\n\nRancangan pembelajaran berbasis masalah yang paling tepat adalah …",
    "o": [
      "Membuat siswa membaca teks tentang konflik antarsuku lalu menghafalnya.",
      "Menugaskan siswa menjelaskan ringkasan sejarah pra-Islam tanpa mengaitkan masalah nyata.",
      "Mengarahkan siswa menganalisis konflik suku pra-Islam, lalu merancang solusinya.",
      "Menyampaikan ceramah tentang sistem sosial Arab pra-Islam tanpa diskusi.",
      "Menugaskan siswa membuat soal pilihan ganda tentang sejarah pra-Islam."
    ],
    "a": 2
  },
  {
    "q": "Dalam kelas PPG, mahasiswa diminta menyusun rancangan pembelajaran dengan pendekatan PBL.\nMasalah yang diberikan adalah tekanan Quraisy di Makkah yang menghambat dakwah Islam.\nGuru berharap siswa menemukan nilai kepemimpinan dan strategi perubahan sosial melalui hijrah.\n\nRancangan pembelajaran berbasis masalah yang paling tepat adalah …",
    "o": [
      "Siswa membuat daftar nama sahabat yang berhijrah bersama Nabi.",
      "Siswa membaca buku cetak tentang hijrah lalu menyalinnya.",
      "Siswa melakukan studi strategi hijrah, lalu menciptakan strategi kepemimpinan.",
      "Guru menyampaikan ceramah tentang strategi Nabi dalam berdakwah.",
      "Siswa mengerjakan soal latihan tertulis tentang alasan hijrah."
    ],
    "a": 2
  },
  {
    "q": "Guru SKI ingin mengajarkan materi Akhir Pemerintahan Khalifah Abu Bakar Ash-Shiddiq dengan Problem-Based Learning (PBL).\nMasalah yang diajukan adalah bagaimana kepemimpinan Abu Bakar dapat menginspirasi penyelesaian masalah kepemimpinan modern.\nGuru ingin hasil belajar diwujudkan dalam produk digital.\n\nRancangan pembelajaran berbasis masalah yang paling tepat adalah …",
    "o": [
      "Siswa diminta menghafalkan kronologi wafatnya Abu Bakar.",
      "Siswa membuat catatan ringkas tentang kebijakan Abu Bakar.",
      "Siswa menganalisis kebijakan Abu Bakar lalu menciptakan infografis kepemimpinannya.",
      "Guru memberikan ceramah panjang tanpa aktivitas siswa.",
      "Siswa menjawab soal pilihan ganda tentang masa pemerintahan Abu Bakar."
    ],
    "a": 2
  },
  {
    "q": "Guru SKI akan mengajarkan materi Akhir Pemerintahan Utsman bin Affan.\nKelas memiliki kemampuan beragam: sebagian unggul keterampilan digital, sebagian unggul diskusi lisan.\nGuru ingin pembelajaran berbasis perbedaan individu melalui produk digital.\n\nRancangan pembelajaran berbasis perbedaan individu yang paling tepat adalah …",
    "o": [
      "Semua siswa wajib membuat catatan ringkas dari buku teks.",
      "Guru membagi kelas menjadi kelompok yang sama tanpa mempertimbangkan kemampuan.",
      "Siswa membuat e-book kepemimpinan Utsman dan podcast diskusi kepemimpinannya.",
      "Guru hanya menjelaskan peristiwa wafat Utsman dengan ceramah.",
      "Semua siswa mengerjakan soal pilihan ganda yang sama."
    ],
    "a": 2
  },
  {
    "q": "Seorang guru SKI akan mengajarkan materi Strategi Dakwah Walisongo di Jawa.\nSiswa beragam: ada yang unggul seni, teknologi, dan menulis.\nGuru ingin pembelajaran berbasis perbedaan individu agar siswa mengkreasi produk sesuai potensinya.\n\nRancangan pembelajaran yang paling tepat adalah …",
    "o": [
      "Semua siswa membuat ringkasan teks dakwah Walisongo.",
      "Siswa membuat poster digital, esai reflektif, dan video animasi dakwah Walisongo.",
      "Semua siswa hanya mendengarkan ceramah guru.",
      "Guru memberikan kuis pilihan ganda yang sama untuk semua siswa.",
      "Semua siswa wajib membuat pidato dengan format yang sama."
    ],
    "a": 1
  },
  {
    "q": "Seorang guru SKI hendak mengajarkan Tradisi Islam Nusantara (sekaten, grebeg maulid, tahlilan).\nPeserta didik di kelas beragam: ada yang unggul desain grafis, ada yang piawai berbicara, dan ada yang suka meneliti sumber sejarah.\nGuru ingin pembelajaran berbasis perbedaan individu dengan teknologi digital.\n\nRancangan pembelajaran yang paling tepat adalah …",
    "o": [
      "Semua siswa diwajibkan menulis makalah tentang sekaten dengan format sama.",
      "Siswa membuat poster digital sekaten dan artikel digital tentang sejarah grebeg maulid.",
      "Semua siswa diminta membuat presentasi PowerPoint dengan isi identik.",
      "Guru ceramah, lalu siswa mencatat tanpa variasi produk.",
      "Semua siswa menghafalkan definisi tradisi Islam Nusantara."
    ],
    "a": 1
  },
  {
    "q": "Seorang guru SKI hendak mengajarkan proses berdirinya Dinasti Umayyah di Damaskus.\nGuru ingin siswa mendalami analisis sebab-akibat, strategi politik, serta dampak sosial yang ditimbulkan.\nGuru memanfaatkan LMS dan sumber primer digital.\n\nRancangan pembelajaran yang paling sesuai adalah …",
    "o": [
      "Siswa membaca buku teks lalu diuji dengan soal pilihan ganda.",
      "Siswa menonton video singkat lalu menghafalkan tahun berdirinya Dinasti Umayyah.",
      "Siswa membuat peta konsep digital interaktif tentang faktor berdirinya Dinasti Umayyah.",
      "Guru ceramah dan siswa mencatat tanpa aktivitas lanjutan.",
      "Siswa menyalin teks sejarah Dinasti Umayyah ke buku tulis."
    ],
    "a": 2
  },
  {
    "q": "Seorang dosen PAI mengajar materi \"Faktor Penyebab Runtuhnya Khalifah Bani Umayyah di Damaskus\".\nMahasiswa masih melihat peristiwa sebatas konflik politik tanpa mengaitkan aspek sosial-ekonomi dan moral.\nDosen ingin pembelajaran mendalam dengan media digital interaktif.\n\nRancangan pembelajaran yang paling tepat adalah …",
    "o": [
      "Menyediakan video dokumenter singkat lalu meminta ringkasan satu paragraf.",
      "Menggunakan e-book statis kronologi sejarah lalu tes pilihan ganda.",
      "Memberikan simulasi digital berbasis peta dinasti dan analisis keterkaitan politik, sosial, dan moral.",
      "Mahasiswa menyalin catatan faktor penyebab dari modul cetak.",
      "Kuliah satu arah dengan PowerPoint berisi poin utama."
    ],
    "a": 2
  },
  {
    "q": "Mahasiswa PPG merancang pembelajaran pendidikan nilai toleransi dengan pendekatan pembelajaran mendalam.\nIa ingin siswa tidak sekadar memahami konsep toleransi, tetapi juga menciptakan karya digital yang mempromosikan nilai tersebut di masyarakat.\n\nProduk pembelajaran yang paling tepat mencerminkan keterpaduan TPACK adalah …",
    "o": [
      "Menyuruh siswa menghafalkan definisi toleransi dari buku teks.",
      "Membuat soal pilihan ganda tentang pentingnya toleransi.",
      "Menugaskan siswa menyusun proyek digital infografis nilai toleransi antarumat beragama.",
      "Menyuruh siswa menyalin kutipan ayat tentang toleransi ke buku tulis.",
      "Mengadakan ceramah satu arah tentang sejarah konflik antaragama."
    ],
    "a": 2
  },
  {
    "q": "Dalam praktik mengajar, mahasiswa PPG merancang pembelajaran moderasi beragama dengan materi \"Pentingnya menghindari sikap ekstremisme dalam kehidupan sehari-hari\".\nGuru ingin siswa mampu menilai dampak positif dan negatif dari konten dakwah di media sosial.\n\nRancangan pembelajaran berbasis TPACK yang paling sesuai adalah …",
    "o": [
      "Meminta siswa menghafalkan definisi ekstremisme.",
      "Mengajak siswa berdiskusi tatap muka tanpa contoh nyata.",
      "Menugaskan siswa membuat poster tentang bahaya ekstremisme tanpa kajian kasus.",
      "Meminta siswa menganalisis konten dakwah di YouTube sesuai nilai moderasi.",
      "Memberikan tes tertulis mengenai ciri-ciri moderasi beragama."
    ],
    "a": 3
  },
  {
    "q": "Mahasiswa PPG mengevaluasi pembelajaran sejarah Islam.\nGuru hanya menyampaikan narasi kondisi politik suku-suku Arab tanpa memberi ruang bagi siswa mengeksplorasi relevansi dengan tantangan kepemimpinan saat ini.\n\nPenggunaan strategi PBL yang paling tepat agar siswa berkarakter unggul adalah …",
    "o": [
      "Mengarahkan siswa menyalin materi dari buku sejarah.",
      "Memberikan lembar latihan soal tentang tokoh politik Arab pra-Islam.",
      "Menyuruh siswa membuat ringkasan timeline sejarah dalam bentuk tabel.",
      "Mengajak siswa studi kasus tentang konflik politik antarsuku di Jazirah Arab.",
      "Menugaskan siswa membaca artikel tanpa penugasan reflektif."
    ],
    "a": 3
  },
  {
    "q": "Dalam pembelajaran sejarah Islam, guru menekankan kronologi peristiwa Hijrah Nabi ke Madinah tanpa memberi ruang refleksi nilai.\nTujuan pembelajaran adalah melatih berpikir kritis dan mengambil teladan.\n\nLangkah Project Based Learning (PjBL) yang paling tepat adalah …",
    "o": [
      "Mengarahkan siswa membuat mind map tokoh-tokoh hijrah.",
      "Menyuruh siswa menyalin teks sejarah ke buku catatan.",
      "Meminta siswa merancang kampanye digital \"Semangat Hijrah untuk Generasi Muda\".",
      "Memberikan kuis tentang perbedaan Makkah dan Madinah.",
      "Meminta siswa menjawab soal uraian tentang pengertian hijrah."
    ],
    "a": 2
  },
  {
    "q": "Dalam kelas SKI, materi strategi dakwah Umar bin Khattab disampaikan hanya melalui membaca teks naratif sehingga monoton.\nDosen ingin menggunakan pendekatan Differentiation Based Learning (DBL) agar pembelajaran lebih aktif.\n\nStrategi pembelajaran berpendekatan DBL yang paling sesuai adalah …",
    "o": [
      "Meminta mahasiswa menuliskan ringkasan panjang tentang keberanian Umar bin Khattab.",
      "Menyuruh mahasiswa mencari artikel jurnal lalu mempresentasikan.",
      "Mengarahkan sebagian mahasiswa merancang digital storytelling berbeda dari yang lainnya.",
      "Memberikan kuis online tentang fakta sejarah Umar bin Khattab.",
      "Menugaskan mahasiswa menonton film tentang Umar bin Khattab secara pasif."
    ],
    "a": 2
  },
  {
    "q": "Guru SKI menyajikan strategi dakwah Utsman bin Affan dan Ali bin Abi Thalib dengan ceramah satu arah.\nPeserta didik kurang antusias karena materi tidak dikaitkan dengan perkembangan zaman dan gaya belajar beragam.\nGuru ingin menggunakan Differentiated Learning (DL).\n\nModel pembelajaran yang paling tepat adalah …",
    "o": [
      "Guru ceramah rinci dan meminta siswa mencatat.",
      "Guru memberi soal pilihan ganda yang sama tanpa penyesuaian.",
      "Guru mengelompokkan siswa berdasarkan minat dan gaya belajar lalu memberi proyek dakwah kontekstual.",
      "Guru menugaskan siswa menghafal strategi dakwah untuk diuji.",
      "Guru menayangkan video dakwah tanpa diskusi lanjutan."
    ],
    "a": 2
  },
  {
    "q": "Guru ingin menyajikan materi pemikiran tokoh Islam kontemporer seperti Quraish Shihab.\nMateri yang digunakan masih berupa teks cetak lama dan kurang relevan dengan digitalisasi tafsir Al-Qur'an.\nGuru berusaha mengintegrasikan TPACK agar pembelajaran adaptif.\n\nAktivitas pembelajaran yang paling tepat adalah …",
    "o": [
      "Siswa mendengarkan ceramah guru tanpa diskusi.",
      "Siswa membaca biografi tokoh dalam buku teks saja.",
      "Siswa membandingkan tafsir cetak Quraish Shihab dengan tafsir digital Al-Mishbah.",
      "Guru memberikan latihan hafalan karya Quraish Shihab.",
      "Siswa menyalin kutipan tafsir tanpa diskusi lanjutan."
    ],
    "a": 2
  },
  {
    "q": "Materi sejarah Islam di Asia Tenggara diajarkan dengan hafalan nama tokoh dan tahun.\nSiswa bosan karena tidak ada kaitan dengan perkembangan zaman.\nGuru ingin menerapkan model pembelajaran berbasis pelayanan bimbingan konseling untuk memfasilitasi pemahaman nilai keteladanan tokoh.\n\nStrategi pembelajaran paling tepat berbasis TPACK adalah …",
    "o": [
      "Guru memberikan tes hafalan tentang nama tokoh penyebar Islam.",
      "Siswa mengkaji kisah penyebar Islam secara digital yang merefleksikan kepemimpinan.",
      "Guru menuliskan garis waktu sejarah di papan tulis untuk disalin siswa.",
      "Siswa diminta menghafalkan daftar tahun penyebaran Islam.",
      "Guru menampilkan slide ringkasan tokoh tanpa kegiatan interaktif."
    ],
    "a": 1
  },
  {
    "q": "Di kelas, guru menyampaikan Sistem Pemerintahan Islam pada masa Dinasti Abbasiyah hanya melalui buku teks dan tidak disesuaikan dengan perkembangan zaman.\nPeserta didik, terutama siswa ABK, kesulitan memahami materi.\nGuru ingin menerapkan pendekatan pembelajaran berbasis pelayanan ABK dengan dukungan teknologi digital.\n\nLangkah guru yang paling tepat adalah …",
    "o": [
      "Menugaskan semua siswa menghafalkan struktur pemerintahan Abbasiyah.",
      "Mendampingi siswa mempelajari video interaktif tentang pemerintahan Abbasiyah.",
      "Menyuruh siswa membaca teks panjang tanpa modifikasi pembelajaran.",
      "Memberikan soal hafalan tentang khalifah Abbasiyah secara individu.",
      "Membacakan buku teks tanpa memberi kesempatan siswa bertanya."
    ],
    "a": 1
  },
  {
    "q": "Guru menyampaikan materi perkembangan ilmu pengetahuan Dinasti Abbasiyyah (Al-Kindi, Al-Farabi, Ibnu Sina) masih berupa hafalan.\nMateri belum dikaitkan dengan perkembangan sains modern sehingga siswa kesulitan melihat relevansinya.\n\nStrategi pembelajaran berbasis TPACK yang paling tepat adalah …",
    "o": [
      "Ceramah tradisional menekankan fakta sejarah tanpa visualisasi teknologi.",
      "Mendiskusikan video interaktif kontribusi ilmuwan Abbasiyyah dengan sains kontemporer.",
      "Tugas hafalan nama tokoh dan bidang keahlian tanpa diskusi reflektif.",
      "Media cetak klasik tanpa mengaitkan dengan konteks saat ini.",
      "Kuis lisan cepat untuk menguji daya ingat siswa."
    ],
    "a": 1
  },
  {
    "q": "Guru ingin mengajarkan pendidikan karakter tentang tanggung jawab.\nPembelajaran hanya berupa catatan di papan tulis sehingga siswa tidak termotivasi.\n\nLangkah pembelajaran yang tepat berbasis TPACK untuk menciptakan suasana belajar progresif adalah …",
    "o": [
      "Meminta siswa membuat jurnal digital tanggung jawab harian menggunakan aplikasi online.",
      "Menugaskan siswa menghafal ayat tentang tanggung jawab tanpa refleksi.",
      "Ceramah panjang tanpa diskusi.",
      "Soal tertulis dari LKS tanpa keterkaitan pengalaman.",
      "Poster dinding tanpa kegiatan lanjutan."
    ],
    "a": 0
  },
  {
    "q": "Di kelas SKI, guru membahas moderasi beragama di Indonesia hanya dengan membaca buku paket tanpa mengaitkan isu keberagaman di masyarakat digital saat ini.\nSiswa kesulitan melihat relevansinya.\n\nStrategi pembelajaran berbasis TPACK yang paling relevan untuk menciptakan suasana belajar membahagiakan adalah …",
    "o": [
      "Menghafalkan definisi moderasi beragama dari buku teks.",
      "Mengajak siswa membuat podcast digital tentang pengalaman toleransi.",
      "Menyalin materi moderasi beragama ke catatan harian.",
      "Soal esai definisi moderasi tanpa diskusi.",
      "Poster cetak tanpa aktivitas tambahan."
    ],
    "a": 1
  },
  {
    "q": "Guru menugaskan siswa menganalisis faktor politik di Jazirah Arab sebelum Islam melalui studi kasus konflik antarkabilah.\nSetiap kelompok mencari data dari sumber digital dan membuat laporan analisis.\n\nJika guru ingin menilai aspek pengetahuan siswa, teknik asesmen yang paling relevan adalah …",
    "o": [
      "Tes lisan untuk menghafal tokoh-tokoh kabilah Arab.",
      "Tes esai analisis konflik kabilah dengan rubrik penilaian.",
      "Observasi sikap toleransi saat diskusi kelompok.",
      "Tes pilihan ganda definisi istilah ekonomi Arab pra-Islam.",
      "Penilaian keaktifan siswa saat bertanya."
    ],
    "a": 1
  },
  {
    "q": "Pembelajaran materi Dakwah Nabi di Madinah menggunakan Project Based Learning (PjBL).\nSiswa membuat proyek digital berupa poster edukasi tentang strategi dakwah Nabi.\nGuru ingin menilai aspek keterampilan siswa.\n\nInstrumen asesmen yang paling tepat adalah …",
    "o": [
      "Tes pilihan ganda tentang strategi dakwah Nabi.",
      "Penilaian produk menggunakan rubrik keterampilan membuat poster digital.",
      "Penilaian diri siswa terhadap pemahaman materi.",
      "Lembar kerja siswa tentang faktor sosial di Madinah.",
      "Tes esai tentang hasil dakwah Nabi di Madinah."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran kepemimpinan Abu Bakar dan Umar bin Khattab, guru menerapkan Differentiated Learning (DL).\nPeserta didik berbeda minat, kesiapan, dan gaya belajar.\nGuru ingin menilai aspek sikap peserta didik.\n\nTeknik asesmen yang paling tepat adalah …",
    "o": [
      "Tes pilihan ganda kronologi pemerintahan.",
      "Tes esai kebijakan ekonomi.",
      "Observasi sikap tanggung jawab dan kejujuran selama diskusi kelompok.",
      "Penugasan membuat peta konsep kepemimpinan.",
      "Ulangan harian berbasis komputer."
    ],
    "a": 2
  },
  {
    "q": "Guru SKI mengajarkan kepemimpinan Utsman bin Affan dengan Discovery Learning.\nSiswa mencari informasi dari sumber digital lalu mendiskusikan sikap kepedulian Utsman dalam menjaga kemurnian Al-Qur'an.\nGuru ingin menilai sikap religius dan kepedulian siswa.\n\nInstrumen asesmen yang paling tepat adalah …",
    "o": [
      "Tes uraian tentang kodifikasi mushaf Utsmani.",
      "Rubrik observasi siswa saat berdiskusi kelompok.",
      "Kuis digital berbasis aplikasi pembelajaran.",
      "Penugasan membuat rangkuman digital kebijakan Utsman.",
      "Angket tertutup pengetahuan siswa."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran sejarah masuknya Islam di Afrika dengan pendekatan PBL, siswa menganalisis faktor perdagangan dan dakwah ulama melalui e-library.\nGuru ingin menilai pengetahuan konseptual tentang jalur perdagangan.\n\nTeknik asesmen yang paling tepat adalah …",
    "o": [
      "Tes uraian dengan soal analisis peta jalur perdagangan Afrika.",
      "Angket sikap religius siswa.",
      "Rubrik observasi keaktifan diskusi.",
      "Penilaian produk infografis tanpa indikator pengetahuan.",
      "Portofolio refleksi pribadi siswa."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran tokoh pengetahuan Islam di Afrika dengan pendekatan PBL, siswa menganalisis kontribusi Ibnu Khaldun dengan memanfaatkan artikel digital dari e-library.\nGuru ingin menilai kemampuan analisis pengetahuan sejarah siswa.\n\nInstrumen asesmen yang paling tepat adalah …",
    "o": [
      "Tes uraian analitis berbasis sumber digital tentang teori Ibnu Khaldun.",
      "Observasi sikap religius siswa saat berdiskusi kelompok.",
      "Rubrik penilaian presentasi lisan tanpa indikator analisis.",
      "Angket refleksi minat siswa pada sejarah Islam.",
      "Portofolio catatan siswa tanpa penekanan kemampuan analisis."
    ],
    "a": 0
  },
  {
    "q": "Guru mengajarkan Proses Berdirinya Kekhalifahan Bani Umayyah di Andalusia dengan Project Based Learning (PjBL).\nAsesmen sebelumnya menunjukkan siswa lemah dalam keterampilan kolaborasi digital.\nGuru ingin keterampilan ini terukur dalam asesmen lanjutan.\n\nTeknik asesmen yang paling tepat adalah …",
    "o": [
      "Rubrik proyek presentasi digital kelompok tentang faktor berdirinya Kekhalifahan Umayyah.",
      "Angket kepuasan siswa terhadap pembelajaran daring.",
      "Tes tertulis individu tentang sejarah sosial Andalusia.",
      "Observasi sikap siswa saat beribadah di sekolah.",
      "Penilaian catatan harian siswa tentang materi yang dipelajari."
    ],
    "a": 0
  },
  {
    "q": "Seorang guru SKI mengajar struktur pemerintahan Dinasti Umayyah di Andalusia menggunakan e-book interaktif.\nAsesmen formatif menunjukkan siswa menguasai pengetahuan faktual, tetapi lemah menyajikan hasil analisis secara kolaboratif.\n\nInstrumen asesmen yang paling tepat untuk menilai keterampilan siswa adalah …",
    "o": [
      "Penilaian kinerja melalui presentasi kelompok menggunakan slide digital.",
      "Kuis singkat online tentang struktur pemerintahan.",
      "Jurnal refleksi pribadi tentang tokoh Dinasti Umayyah.",
      "Ujian tulis esai individu.",
      "Penilaian produk mind map individu tanpa kolaborasi."
    ],
    "a": 0
  },
  {
    "q": "Dalam mata kuliah pendidikan karakter, mahasiswa membaca e-book interaktif tentang strategi menanamkan nilai kejujuran.\nAsesmen awal menunjukkan teori dikuasai, tetapi keterampilan merancang kegiatan pembelajaran berbasis nilai belum tampak.\n\nInstrumen asesmen paling sesuai untuk menilai keterampilan tersebut adalah …",
    "o": [
      "Penilaian diri melalui form online sikap kejujuran mahasiswa.",
      "Tes pilihan ganda berbasis LMS tentang teori pendidikan karakter.",
      "Penilaian kinerja melalui rancangan RPP/TP berbasis e-book karakter.",
      "Observasi keterlibatan mahasiswa dalam diskusi kelas.",
      "Penilaian produk berupa rangkuman isi e-book."
    ],
    "a": 2
  },
  {
    "q": "Mahasiswa membaca e-book interaktif tentang peran tokoh Islam dalam moderasi beragama di Indonesia.\nAsesmen awal menunjukkan nilai dasar dipahami, tetapi mahasiswa kesulitan menunjukkan keterampilan merancang strategi pembelajaran moderasi untuk SD.\n\nInstrumen asesmen yang paling tepat adalah …",
    "o": [
      "Tes esai tentang sejarah moderasi beragama di Indonesia.",
      "Penilaian produk berupa rancangan RPP/TP moderasi beragama.",
      "Observasi sikap mahasiswa saat membaca e-book.",
      "Kuis interaktif berbasis aplikasi LMS.",
      "Penilaian diri tentang pemahaman nilai moderasi."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran hijrahnya Nabi ke Madinah, guru menggunakan PowerPoint berisi poin-poin utama peristiwa hijrah.\nNamun guru tidak memberi ruang eksplorasi nilai kepemimpinan dan persaudaraan sehingga siswa hanya menghafal fakta.\n\nBest practice yang paling tepat agar pembelajaran lebih bermakna adalah …",
    "o": [
      "Latihan soal pilihan ganda untuk mengukur hafalan.",
      "Kuis interaktif digital untuk memperkuat fakta.",
      "Mengajak peserta didik membuat proyek video pendek tentang nilai hijrah.",
      "Menambah lebih banyak teks pada PowerPoint.",
      "Peserta didik merangkum materi dari buku secara individu."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran kepemimpinan Ali bin Abi Thalib, guru menggunakan PowerPoint berisi poin-poin kebijakan politik secara satu arah.\nSiswa hanya menghafal fakta tanpa kesempatan menganalisis tantangan kepemimpinan.\n\nLangkah best practice yang paling tepat adalah …",
    "o": [
      "Memperbanyak teks di PowerPoint.",
      "Memberikan proyek membuat infografis digital nilai kepemimpinan Ali.",
      "Mengulangi penjelasan dengan bahasa lebih sederhana.",
      "Meminta siswa menyalin ringkasan dari papan tulis.",
      "Mengurangi jumlah slide agar lebih cepat."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran Sistem Pemerintahan Dinasti Ayyubiyah, guru meminta siswa membuat ringkasan digital menggunakan e-book.\nNamun penilaian hanya fokus pada kerapian tulisan tanpa memperhatikan pemahaman konsep.\n\nAgar evaluasi pembelajaran lebih berkualitas, praktik baik yang seharusnya dilakukan adalah …",
    "o": [
      "Menilai ringkasan hanya berdasarkan panjang tulisan.",
      "Memberikan rubrik penilaian isi, analisis, dan kreativitas.",
      "Menilai semua siswa sama rata agar lebih adil.",
      "Mengganti ringkasan dengan soal hafalan tanpa rubrik.",
      "Membiarkan siswa menilai diri sendiri tanpa panduan."
    ],
    "a": 1
  },
  {
    "q": "Guru SKI menggunakan AI image generator untuk menampilkan ilustrasi suasana perpustakaan Baitul Hikmah.\nSiswa tertarik, tetapi guru hanya menilai hafalan tokoh Abbasiyah tanpa mengaitkan dengan ilustrasi digital.\n\nLangkah evaluasi yang lebih tepat adalah …",
    "o": [
      "Meminta siswa menyalin nama tokoh pada ilustrasi.",
      "Memberikan kuis hafalan nama tokoh Abbasiyah.",
      "Mengarahkan siswa menganalisis tokoh Abbasiyah pada ilustrasi digital Baitul Hikmah.",
      "Menghentikan penggunaan teknologi AI.",
      "Menilai siswa hanya berdasarkan keaktifan melihat ilustrasi."
    ],
    "a": 2
  },
  {
    "q": "Guru SKI menggunakan AI Chatbot untuk menjawab pertanyaan siswa tentang peran tokoh Dinasti Abbasiyah.\nNamun guru tidak melakukan klarifikasi isi jawaban AI sehingga beberapa informasi justru membingungkan siswa Gen Z.\n\nMasalah utama dalam praktik tersebut adalah …",
    "o": [
      "Guru sepenuhnya mengandalkan AI tanpa memvalidasi konten yang disajikan.",
      "Siswa Gen Z terbiasa menggunakan internet sehingga tidak tertarik dengan chatbot.",
      "Jawaban AI terlalu panjang sehingga sulit dipahami.",
      "Guru hanya fokus pada AI tanpa menyediakan buku cetak.",
      "AI tidak bisa digunakan untuk menjelaskan materi SKI."
    ],
    "a": 0
  }
]
