[
  {
    "q": "Dian, seorang siswa kelas 7, baru saja mempelajari kondisi sosial, budaya, dan kepercayaan masyarakat Arab sebelum datangnya Islam. Ia menemukan bahwa masyarakat saat itu banyak melakukan penyimpangan akhlak, seperti praktik riba, perbudakan, dan penyembahan berhala. Sebagai tindak lanjut dari pembelajaran tersebut, guru ingin membentuk karakter peserta didik yang beriman dan bertakwa. Tujuan pembelajaran ranah sikap yang paling tepat berdasarkan kasus tersebut adalah...",
    "o": [
      "Menjelaskan bentuk-bentuk kepercayaan masyarakat Arab pra Islam.",
      "Membandingkan sistem sosial Arab sebelum dan sesudah Islam.",
      "Menumbuhkan keimanan, ketakwaan, dan akhlak mulia setelah memahami kondisi Jazirah Arab pra Islam.",
      "Mendeskripsikan struktur sosial ekonomi masyarakat Arab pra Islam.",
      "Menganalisis perubahan budaya Arab setelah dakwah Nabi Muhammad."
    ],
    "a": 2
  },
  {
    "q": "Saat mempelajari sejarah dakwah Nabi Muhammad sebelum hijrah ke Madinah, para siswa diajak untuk menganalisis tantangan yang dihadapi Nabi, seperti penolakan kaum Quraisy dan tekanan sosial. Guru berharap siswa dapat berpikir kritis melihat strategi Nabi dalam berdakwah. Rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai adalah...",
    "o": [
      "Menyebutkan peristiwa-peristiwa penting sebelum hijrah.",
      "Merinci nama-nama sahabat yang mendukung Nabi di Makkah.",
      "Menganalisis tantangan dan strategi Nabi Muhammad dalam berdakwah di Makkah.",
      "Menghafal silsilah keturunan Nabi Muhammad SAW.",
      "Menyusun garis waktu perjalanan hijrah Nabi Muhammad ke Madinah."
    ],
    "a": 2
  },
  {
    "q": "Dalam diskusi kelas, siswa diajak untuk mengkaji kebijakan pemerintahan Abu Bakar dan Umar bin Khattab, seperti pembentukan pasukan militer, distribusi zakat, dan pembangunan infrastruktur. Guru ingin menanamkan semangat gotong royong kepada siswa. Tujuan pembelajaran ranah keterampilan yang paling sesuai adalah...",
    "o": [
      "Menyebutkan bentuk pemerintahan masa Abu Bakar dan Umar bin Khattab.",
      "Menghafalkan kebijakan politik Khalifah Abu Bakar dan Umar bin Khattab.",
      "Mempraktikkan kerja sama dalam merancang model sederhana sistem pemerintahan berdasarkan nilai gotong royong seperti di masa Khalifah.",
      "Membandingkan sistem pemerintahan Islam dan Barat.",
      "Menganalisis konflik politik pada masa Khalifah Abu Bakar dan Umar."
    ],
    "a": 2
  },
  {
    "q": "Ketika mempelajari teori masuknya Islam ke Indonesia, siswa menemukan bahwa Islam berkembang dengan damai, menghargai tradisi lokal, dan mengakomodasi budaya setempat. Guru ingin membentuk sikap siswa yang mampu menerima perbedaan budaya. Indikator tujuan pembelajaran ranah sikap yang paling sesuai adalah...",
    "o": [
      "Menghafal teori Gujarat, Persia, dan Arab tentang masuknya Islam.",
      "Menyebutkan tokoh-tokoh penyebar Islam di Nusantara.",
      "Menunjukkan sikap penghargaan terhadap keberagaman budaya",
      "Membandingkan metode dakwah Islam dengan metode kolonialisme Barat.",
      "Menunjukkan sikap penghargaan terhadap keberagaman tradisi lokal dalam proses penyebaran Islam."
    ],
    "a": 4
  },
  {
    "q": "Saat belajar tentang sistem pemerintahan Dinasti Ayubiyah di bawah kepemimpinan Shalahuddin Al-Ayyubi, siswa diajak memahami inovasi dalam bidang militer, pendidikan, dan administrasi negara. Guru berharap siswa memiliki pola pikir dinamis dan inovatif. Indikator tujuan pembelajaran ranah pengetahuan yang paling sesuai adalah...",
    "o": [
      "Menyebutkan raja-raja besar Dinasti Ayubiyah.",
      "Menghafal tahun-tahun penting dalam sejarah Dinasti Ayubiyah.",
      "Menjelaskan struktur birokrasi Dinasti Ayubiyah.",
      "Menganalisis inovasi pemerintahan Dinasti Ayubiyah untuk membentuk pola pikir dinamis dan inovatif.",
      "Membuat peta lokasi kekuasaan Dinasti Ayubiyah."
    ],
    "a": 3
  },
  {
    "q": "Dalam sebuah perencanaan pembelajaran, seorang guru memutuskan untuk menggunakan pendekatan Project Based Learning (PBL) dalam mengajarkan kondisi Jazirah Arab sebelum datangnya Islam. Guru tersebut memberikan tugas kepada siswa untuk meneliti dan mempresentasikan berbagai aspek kehidupan sosial, politik, dan budaya Arab pra Islam. Tujuan pembelajaran yang tepat berdasarkan struktur keilmuan dan karakteristik peserta didik adalah...",
    "o": [
      "Membandingkan kehidupan sosial masyarakat Arab sebelum dan setelah Islam.",
      "Menyusun laporan tentang sistem kepercayaan masyarakat Arab pra Islam.",
      "Mengidentifikasi faktor penyebab kemunduran peradaban Arab sebelum Islam.",
      "Menganalisis kondisi sosial, budaya, dan politik masyarakat Arab sebelum Islam dalam proyek kelompok.",
      "Menghafal tokoh-tokoh penting dalam sejarah Jazirah Arab pra Islam."
    ],
    "a": 3
  },
  {
    "q": "Dalam mengajarkan materi tentang Nabi Muhammad sebelum kerasulan hingga hijrah ke Madinah, guru menggunakan pendekatan Project Based Learning (PjBL) dengan meminta siswa membuat peta konsep tentang kondisi sosio-kultural masyarakat Makkah dan Madinah saat itu. Siswa diminta mengumpulkan data, bekerja sama dalam kelompok, dan kemudian mempresentasikan hasil temuan mereka. Tujuan pembelajaran yang sesuai dengan karakteristik peserta didik dalam pelaksanaan ini adalah...",
    "o": [
      "Menganalisis struktur sosial Makkah dan Madinah sebelum hijrah.",
      "Menyusun presentasi tentang kehidupan sosial masyarakat di Madinah dan Makkah pada masa Nabi Muhammad.",
      "Mengidentifikasi perbedaan kondisi sosial sebelum dan sesudah Islam di Makkah dan Madinah.",
      "Membandingkan perkembangan ekonomi Makkah dan Madinah.",
      "Menganalisis proses dakwah Nabi Muhammad di Makkah dan Madinah."
    ],
    "a": 1
  },
  {
    "q": "Setelah selesai mengajarkan materi tentang masa Khulafaur-Rasyidin, guru melakukan evaluasi terhadap pemahaman siswa tentang kebijakan-kebijakan yang diterapkan oleh Khalifah Abu Bakar dan Umar bin Khattab. Evaluasi dilakukan dengan menggunakan pendekatan Discovery Based Learning (DBL), di mana siswa diberi kesempatan untuk menggali informasi lebih dalam dan menemukan prinsip-prinsip dasar pemerintahan yang mereka pelajari. Bagaimana cara terbaik untuk menguraikan materi ajar ini sesuai dengan evaluasi tujuan pembelajaran yang diberikan?",
    "o": [
      "Menyusun laporan evaluasi kebijakan pemerintahan Khulafaur-Rasyidin.",
      "Menggunakan metode tanya jawab untuk menilai pemahaman siswa tentang kebijakan pemerintahan.",
      "Menyajikan studi kasus yang berkaitan dengan kebijakan pemerintahan Abu Bakar dan Umar bin Khattab.",
      "Mengadakan ujian tulis untuk menguji ingatan siswa tentang peristiwa-peristiwa besar dalam pemerintahan.",
      "Menyediakan soal pilihan ganda untuk menilai pemahaman tentang kebijakan politik yang diterapkan oleh kedua Khalifah."
    ],
    "a": 2
  },
  {
    "q": "Seorang guru merencanakan materi ajar mengenai perkembangan ilmu pengetahuan pada masa kepemimpinan Khalifah Utsman bin Affan atau Ali bin Abi Thalib dengan menggunakan pendekatan TPACK (Technological Pedagogical Content Knowledge). Dalam hal ini, guru menggabungkan teknologi dan strategi pedagogis untuk membuat materi lebih menarik dan relevan. Alur materi ajar yang paling sesuai dengan tujuan pembelajaran dalam konteks ini adalah...",
    "o": [
      "Menggunakan video animasi untuk menjelaskan penerapan ilmu pengetahuan pada masa Utsman dan Ali.",
      "Membahas perkembangan ilmu pengetahuan di masa Utsman dan Ali melalui ceramah.",
      "Menyusun proyek kelompok untuk menggali lebih dalam tentang ilmu pengetahuan dan teknologi pada masa tersebut.",
      "Menggunakan aplikasi interaktif untuk memvisualisasikan kontribusi ilmuwan pada masa pemerintahan Utsman dan Ali.",
      "Menggunakan alat peraga untuk menggambarkan perkembangan ilmu pengetahuan pada masa tersebut."
    ],
    "a": 3
  },
  {
    "q": "Seorang guru mengajarkan materi tentang sejarah masuknya Islam ke Indonesia dan negara-negara lain dengan pendekatan Differentiated Learning (DL). Guru memberikan berbagai sumber belajar yang dapat diakses oleh siswa dengan gaya belajar yang berbeda, seperti artikel, video, dan diskusi kelompok. Alur materi ajar yang sesuai dengan pelaksanaan tujuan pembelajaran menggunakan pendekatan ini adalah...",
    "o": [
      "Menggunakan satu sumber buku teks untuk menjelaskan masuknya Islam ke berbagai belahan dunia.",
      "Memberikan berbagai pilihan sumber belajar yang relevan sesuai dengan minat dan gaya belajar siswa.",
      "Menggunakan ceramah langsung tanpa memanfaatkan media lain.",
      "Membagi siswa berdasarkan negara dan meminta mereka membuat presentasi tentang sejarah masuknya Islam di negara tersebut.",
      "Menyajikan soal ujian dengan pilihan ganda untuk mengukur pengetahuan tentang sejarah Islam di berbagai negara."
    ],
    "a": 1
  },
  {
    "q": "Dalam pelaksanaan materi ajar tentang sistem pemerintahan Dinasti Ayyubiyah, seorang guru menggunakan model pelayanan konseling untuk membantu siswa memahami faktor-faktor penyebab keruntuhan Dinasti Ayyubiyah. Guru memberikan ruang untuk diskusi terbuka dan bimbingan individu kepada siswa mengenai kejadian-kejadian politik yang menyebabkan keruntuhan dinasti tersebut. Alur materi ajar yang sesuai dalam mengevaluasi tujuan pembelajaran dengan pendekatan ini adalah...",
    "o": [
      "Memberikan ceramah tentang kebijakan politik Dinasti Ayyubiyah.",
      "Meminta siswa untuk mengumpulkan data tentang kejadian-kejadian politik yang menyebabkan keruntuhan Dinasti Ayyubiyah.",
      "Menyusun proyek kelompok untuk menganalisis faktor penyebab keruntuhan Dinasti Ayyubiyah.",
      "Menggunakan model diskusi kelompok untuk menggali penyebab keruntuhan dengan bimbingan konseling individu.",
      "Memberikan soal pilihan ganda mengenai aspek sosial dan politik Dinasti Ayyubiyah."
    ],
    "a": 3
  },
  {
    "q": "Dalam pelaksanaan program Penguatan Profil Pelajar Pancasila (P5), guru merencanakan pengembangan materi ajar yang berfokus pada nilai-nilai Pancasila. Guru menggunakan pendekatan berbasis nilai untuk membantu siswa mengembangkan pemahaman dan sikap berdasarkan Pancasila dalam kehidupan sehari-hari. Pengembangan materi ajar yang tepat untuk merencanakan tujuan pembelajaran adalah...",
    "o": [
      "Menyusun teks proklamasi dan memperkenalkan sejarah Pancasila.",
      "Mengintegrasikan nilai-nilai Pancasila dalam setiap mata pelajaran melalui diskusi dan tugas proyek.",
      "Mengajarkan tentang nilai Pancasila tanpa mengaitkan dengan kehidupan nyata.",
      "Memberikan ujian pilihan ganda untuk mengukur pengetahuan siswa tentang Pancasila.",
      "Memfokuskan hanya pada aspek sejarah Pancasila dan tidak pada penerapannya."
    ],
    "a": 1
  },
  {
    "q": "Dalam pelaksanaan program Penguatan Profil Pelajar Rahmatan Lil-Alamin (PPRA), guru merencanakan pengembangan materi ajar yang mencakup nilai-nilai Islam sebagai rahmat bagi seluruh alam semesta. Guru berfokus pada membentuk sikap toleransi dan kepedulian sosial siswa terhadap sesama makhluk hidup. Pengembangan materi ajar yang tepat dalam melaksanakan tujuan pembelajaran ini adalah...",
    "o": [
      "Menjelaskan teks-teks kuno tentang Islam dan rahmatan lil-alamin.",
      "Mengajarkan prinsip-prinsip toleransi antarumat beragama dalam diskusi kelompok.",
      "Menggunakan media video untuk menampilkan kisah-kisah toleransi dalam sejarah Islam.",
      "Memberikan tugas individu untuk menulis tentang rahmatan lil-alamin dalam pandangan Islam.",
      "Mengkaji literatur sejarah tanpa mempraktikkan nilai rahmatan lil-alamin dalam kehidupan nyata."
    ],
    "a": 1
  },
  {
    "q": "Dalam sebuah pembelajaran mengenai nilai-nilai moderasi beragama, guru bertujuan untuk membantu siswa memahami konsep Islam sebagai agama yang moderat (wasathiyah). Siswa diajak untuk menerapkan prinsip-prinsip moderasi beragama dalam kehidupan sehari-hari, termasuk dalam interaksi sosial dan kehidupan beragama. Pengembangan materi ajar yang tepat sesuai dengan implementasi moderasi beragama dalam evaluasi tujuan pembelajaran adalah...",
    "o": [
      "Mengajarkan tentang sejarah moderasi beragama tanpa kaitannya dengan kehidupan siswa.",
      "Memberikan ujian untuk mengukur pengetahuan siswa tentang konsep moderasi beragama.",
      "Menggunakan studi kasus untuk mengajak siswa mengidentifikasi praktik moderasi beragama di masyarakat.",
      "Menyajikan ceramah tanpa memberi ruang bagi diskusi tentang nilai-nilai Islam moderat.",
      "Menggunakan media massa untuk menyebarkan nilai moderasi beragama tanpa melibatkan siswa dalam diskusi."
    ],
    "a": 2
  },
  {
    "q": "Dalam mengajarkan moderasi beragama, seorang guru berusaha menilai pengembangan materi ajar yang mendalam mengenai Islam sebagai agama moderat. Siswa diberi pemahaman tentang bagaimana prinsip-prinsip Islam yang moderat dapat diterapkan dalam kehidupan beragama secara harmonis dan toleran. Alasan yang tepat dalam memilih pengembangan materi ajar ini adalah...",
    "o": [
      "Moderasi beragama mengajarkan keseimbangan antara keimanan dan kehidupan sosial yang seimbang.",
      "Moderasi beragama menekankan penghafalan teks agama secara eksklusif.",
      "Moderasi beragama mengharuskan pemisahan antara agama dan kehidupan sosial.",
      "Moderasi beragama hanya mengajarkan kedamaian tanpa melibatkan perubahan sosial.",
      "Moderasi beragama dapat menghindari interaksi sosial antarumat beragama."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran mengenai peradaban bangsa Arab pra-Islam, guru memilih pendekatan berbasis masalah untuk membantu siswa memahami kondisi sosial dan budaya masyarakat Arab. Dalam pendekatan ini, siswa ditantang untuk menyelesaikan masalah yang berkaitan dengan perkembangan budaya dan sistem kepercayaan Arab pra-Islam. Rancangan pembelajaran yang sesuai dengan materi peradaban Arab pra-Islam adalah...",
    "o": [
      "Memberikan ceramah panjang lebar tentang budaya Arab tanpa melibatkan siswa dalam diskusi.",
      "Menggunakan pendekatan berbasis masalah untuk mengidentifikasi faktor-faktor yang membentuk peradaban Arab.",
      "Menguji pengetahuan siswa melalui soal pilihan ganda tentang sejarah Arab pra-Islam.",
      "Mengajarkan sejarah Arab dengan hanya mengandalkan buku teks.",
      "Memfokuskan pada hafalan tokoh-tokoh penting dalam peradaban Arab pra-Islam."
    ],
    "a": 1
  },
  {
    "q": "Dalam materi pembelajaran mengenai perjalanan Nabi Muhammad dari Makkah ke Yatsrib (Madinah), guru memilih pendekatan berbasis masalah untuk mendorong siswa mengidentifikasi tantangan yang dihadapi Nabi dalam perjalanannya dan dampaknya terhadap sejarah Islam. Rancangan pembelajaran yang tepat berdasarkan pengetahuan pedagogik adalah...",
    "o": [
      "Menggunakan video perjalanan Nabi Muhammad tanpa mendorong siswa berpikir kritis.",
      "Menyajikan soal pilihan ganda untuk menilai pengetahuan siswa tentang perjalanan Nabi.",
      "Mengajukan pertanyaan berbasis masalah untuk membahas alasan dan tantangan hijrah.",
      "Memberikan tugas individu untuk menghafal rute perjalanan Nabi Muhammad.",
      "Menggunakan ceramah sebagai satu-satunya metode pembelajaran."
    ],
    "a": 2
  },
  {
    "q": "Seorang guru mengajarkan materi tentang akhir pemerintahan atau kematian Khalifah Abu Bakar dan Umar bin Khattab menggunakan teknologi untuk memperdalam pemahaman siswa. Guru menggunakan alat seperti infografis dan simulasi berbasis teknologi untuk membantu siswa mengeksplorasi faktor-faktor yang memengaruhi akhir pemerintahan kedua Khalifah ini. Rancangan pembelajaran berbasis masalah yang tepat dalam hal ini adalah...",
    "o": [
      "Memberikan tugas individu untuk menulis esai tentang pemerintahan Abu Bakar dan Umar bin Khattab.",
      "Menggunakan simulasi komputer untuk menggambarkan kejadian-kejadian penting yang terjadi pada masa akhir pemerintahan kedua Khalifah tersebut.",
      "Menggunakan metode tanya jawab untuk memeriksa pengetahuan siswa mengenai akhir pemerintahan mereka.",
      "Membahas materi secara lisan tanpa bantuan alat teknologi.",
      "Memberikan soal pilihan ganda tentang peristiwa kematian kedua Khalifah tersebut."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran mengenai akhir pemerintahan atau kematian Utsman bin Affan dan Ali bin Abi Thalib, guru memanfaatkan pendekatan berbasis perbedaan individu untuk mengakomodasi gaya belajar yang berbeda-beda di kelas. Siswa yang lebih visual diberikan tugas membuat timeline sejarah, sementara siswa yang lebih kinestetik diminta untuk membuat presentasi interaktif. Rancangan pembelajaran berbasis perbedaan individu yang sesuai dengan materi ini adalah...",
    "o": [
      "Menyediakan video dokumenter yang menjelaskan peristiwa kematian Utsman dan Ali.",
      "Menggunakan metode ceramah tanpa memberikan pilihan pembelajaran berdasarkan perbedaan gaya belajar siswa.",
      "Memberikan tes tertulis yang mengharuskan siswa menghafal tanggal peristiwa.",
      "Memberikan berbagai bentuk tugas yang sesuai dengan gaya belajar siswa, seperti pembuatan timeline atau presentasi.",
      "Membatasi pembelajaran hanya pada aspek verbal dan diskusi."
    ],
    "a": 3
  },
  {
    "q": "Seorang guru mengajarkan materi tentang strategi dakwah Walisongo dan perkembangan Islam di Nusantara, menggunakan pendekatan berbasis perbedaan individu. Guru menyediakan berbagai sumber belajar dan memberikan kebebasan kepada siswa untuk memilih metode yang sesuai dengan gaya belajar mereka. Rancangan pembelajaran yang sesuai dengan materi ini adalah...",
    "o": [
      "Membuat peta konsep tentang Walisongo yang diikuti dengan diskusi kelompok besar.",
      "Memberikan ceramah mengenai sejarah dakwah Walisongo tanpa melibatkan pilihan gaya belajar siswa.",
      "Menyediakan video dokumenter dan artikel yang dapat dipilih siswa sesuai dengan kebutuhan mereka, serta memberikan proyek individu.",
      "Memberikan soal ujian tentang sejarah Walisongo tanpa memberikan ruang bagi kreativitas siswa.",
      "Menggunakan satu pendekatan pengajaran untuk seluruh siswa tanpa mempertimbangkan perbedaan individu."
    ],
    "a": 2
  },
  {
    "q": "Guru mengajarkan materi tentang tradisi Islam di Nusantara, menggunakan pendekatan berbasis perbedaan individu. Guru memberikan berbagai pilihan tugas kepada siswa sesuai dengan minat dan kemampuan mereka, seperti membuat video tentang tradisi atau menulis makalah. Rancangan pembelajaran berbasis perbedaan individu yang sesuai dengan materi ini adalah...",
    "o": [
      "Memberikan ujian tulis untuk menilai pengetahuan tentang tradisi Islam Nusantara.",
      "Membagi siswa dalam kelompok besar untuk membuat presentasi tentang tradisi Islam Nusantara.",
      "Memberikan pilihan tugas sesuai gaya belajar siswa, seperti menulis makalah, membuat video, atau melakukan penelitian lapangan.",
      "Menyajikan ceramah panjang tentang tradisi Islam Nusantara tanpa mempertimbangkan gaya belajar siswa.",
      "Menggunakan metode yang sama untuk seluruh siswa tanpa memperhatikan perbedaan individu."
    ],
    "a": 2
  },
  {
    "q": "Dalam mengajarkan materi tentang proses berdirinya Dinasti Umayyah di Damaskus, guru menggunakan pendekatan pembelajaran mendalam, yang memungkinkan siswa untuk menggali lebih dalam tentang latar belakang politik, sosial, dan budaya yang memengaruhi berdirinya dinasti tersebut. Rancangan pembelajaran yang tepat untuk mendalamkan materi ini adalah...",
    "o": [
      "Memberikan ceramah umum tentang dinasti Umayyah tanpa mengajak siswa berdiskusi.",
      "Meminta siswa untuk membaca artikel dan melakukan penelitian lebih lanjut mengenai faktor-faktor yang memengaruhi berdirinya Dinasti Umayyah.",
      "Menggunakan soal pilihan ganda untuk menguji pengetahuan siswa tentang Dinasti Umayyah.",
      "Membatasi pembelajaran hanya pada aspek administratif berdirinya Dinasti Umayyah.",
      "Menggunakan metode ceramah sebagai satu-satunya metode pembelajaran."
    ],
    "a": 1
  },
  {
    "q": "Guru mengajarkan materi tentang faktor-faktor penyebab runtuhnya Khalifah Bani Umayyah di Damaskus menggunakan pendekatan pembelajaran mendalam. Siswa diberikan kesempatan untuk melakukan diskusi kelompok dan penelitian lebih lanjut untuk menganalisis faktor-faktor internal dan eksternal yang menyebabkan keruntuhan dinasti ini. Rancangan pembelajaran yang tepat berdasarkan pengetahuan pedagogik untuk materi ini adalah...",
    "o": [
      "Memberikan ujian tertulis untuk menilai pemahaman siswa tentang runtuhnya Dinasti Umayyah.",
      "Mendorong siswa untuk mendalami lebih lanjut penyebab runtuhnya dinasti melalui studi kasus dan diskusi kelompok.",
      "Menyajikan video dokumenter dan mengharuskan siswa untuk mencatat poin penting.",
      "Memberikan ceramah panjang tanpa memberi kesempatan kepada siswa untuk mengkaji lebih mendalam.",
      "Menggunakan soal pilihan ganda untuk mengukur pemahaman siswa mengenai penyebab runtuhnya dinasti tersebut."
    ],
    "a": 1
  },
  {
    "q": "Guru mengajarkan materi tentang implementasi pendidikan karakter dengan menggunakan pendekatan pembelajaran mendalam. Siswa diberi kesempatan untuk menggali lebih dalam nilai-nilai karakter yang terkandung dalam ajaran Islam dan menerapkannya dalam kehidupan sehari-hari. Rancangan pembelajaran yang sesuai untuk materi ini adalah...",
    "o": [
      "Memberikan ujian tentang nilai-nilai karakter Islam tanpa mendalami penerapannya.",
      "Mengajak siswa untuk mendiskusikan penerapan nilai-nilai karakter Islam dalam kehidupan mereka melalui studi kasus.",
      "Membaca teks-teks kuno tanpa memberikan ruang untuk diskusi penerapan nilai-nilai tersebut.",
      "Memberikan ceramah sebagai metode utama untuk menyampaikan nilai-nilai karakter Islam.",
      "Memberikan soal pilihan ganda tentang karakter Islam tanpa memberi kesempatan pada siswa untuk mendiskusikan dan menerapkannya."
    ],
    "a": 1
  },
  {
    "q": "Seorang guru mengajarkan materi moderasi beragama di Indonesia dengan menggunakan pendekatan TPACK (Technological Pedagogical Content Knowledge). Guru memanfaatkan teknologi untuk meningkatkan pemahaman siswa tentang pentingnya moderasi beragama dalam kehidupan sosial dan beragama di Indonesia. Rancangan pembelajaran berbasis TPACK yang tepat adalah...",
    "o": [
      "Menggunakan video dan platform diskusi online untuk membahas moderasi beragama dan mendorong siswa berbagi pengalaman.",
      "Memberikan ceramah tradisional tanpa menggunakan teknologi.",
      "Menyediakan teks panjang tanpa media atau teknologi yang mendukung pembelajaran.",
      "Memberikan soal pilihan ganda untuk menguji pengetahuan siswa tentang moderasi beragama.",
      "Menggunakan hanya buku teks tanpa keterlibatan teknologi dalam pembelajaran."
    ],
    "a": 0
  },
  {
    "q": "Seorang guru menggunakan AI untuk mengajar materi Sejarah Kebudayaan Islam (SKI) dengan menekankan makna dan keterkaitan topik bagi siswa. Sebagai mahasiswa, Anda diminta untuk mengidentifikasi masalah dan solusinya secara ilmiah dalam penggunaan AI untuk menunjukkan jati diri sebagai guru profesional sesuai dengan karakteristik dan gaya belajar peserta didik Gen Z dan Alpha. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: Terlalu banyak ketergantungan pada teknologi yang mengurangi interaksi siswa. Solusi: Menggunakan AI hanya sebagai alat bantu untuk materi interaktif, dengan tetap menjaga komunikasi langsung antara guru dan siswa.",
      "Masalah: Penggunaan AI yang sulit dipahami siswa. Solusi: Meningkatkan pemahaman siswa tentang cara menggunakan AI melalui pelatihan tambahan sebelum pembelajaran.",
      "Masalah: AI tidak dapat menyesuaikan materi dengan tingkat kemampuan siswa. Solusi: Menggunakan teknologi AI untuk menyesuaikan materi sesuai dengan tingkat keterampilan dan kecepatan belajar siswa.",
      "Masalah: Guru tidak memiliki keterampilan untuk menggunakan teknologi AI. Solusi: Memberikan pelatihan kepada guru untuk meningkatkan pemahaman dan keterampilan penggunaan AI dalam pengajaran.",
      "Masalah: Terlalu sedikit interaksi sosial dalam pembelajaran berbasis AI. Solusi: Menambah sesi diskusi kelompok setelah menggunakan AI untuk mendalami topik."
    ],
    "a": 0
  },
  {
    "q": "Seorang guru menggunakan AI untuk meningkatkan motivasi belajar siswa dalam materi perkembangan kebudayaan Islam di Nusantara. Namun, guru tersebut menyadari bahwa siswa sering menggunakan AI secara tidak etis, seperti menyalin pekerjaan AI tanpa memahami materi. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: Siswa tidak menyukai penggunaan AI. Solusi: Mengurangi penggunaan AI dan kembali ke metode konvensional.",
      "Masalah: AI menyajikan informasi yang tidak akurat. Solusi: Guru memeriksa hasil AI sebelum dibagikan ke siswa.",
      "Masalah: Siswa menyalin pekerjaan tanpa pemahaman. Solusi: Guru membuat tugas yang menuntut analisis kritis dan pemahaman mendalam, bukan sekadar jawaban instan dari AI.",
      "Masalah: AI sulit diakses oleh semua siswa. Solusi: Menyediakan perangkat komputer di sekolah untuk siswa.",
      "Masalah: Siswa merasa AI membosankan. Solusi: Menggunakan AI untuk membuat kuis interaktif."
    ],
    "a": 2
  },
  {
    "q": "Guru menggunakan AI untuk membuat kuis interaktif tentang sejarah Dinasti Ayyubiyah. Guru ingin memastikan bahwa AI dapat membantu siswa memahami konsep sejarah dengan lebih baik tanpa menghilangkan esensi pembelajaran. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: AI tidak dapat membuat kuis yang sesuai dengan kurikulum. Solusi: Guru membuat kuis sendiri tanpa AI.",
      "Masalah: AI membuat kuis terlalu sulit. Solusi: Guru menyesuaikan tingkat kesulitan kuis dengan kemampuan siswa.",
      "Masalah: AI mengurangi interaksi sosial siswa. Solusi: Guru mengadakan sesi diskusi kelompok setelah kuis AI.",
      "Masalah: Siswa tidak tertarik dengan kuis AI. Solusi: Guru membuat kuis lebih interaktif dan menyenangkan dengan menggunakan AI.",
      "Masalah: AI tidak dapat mencakup semua aspek sejarah. Solusi: Guru menggunakan AI hanya sebagai pelengkap, dan menggunakan metode lain untuk mencakup semua aspek sejarah."
    ],
    "a": 3
  },
  {
    "q": "Guru menggunakan teknologi AI untuk mengajarkan materi tentang nilai-nilai toleransi dalam sejarah Islam. Namun, guru tersebut menyadari bahwa AI dapat memberikan interpretasi yang salah atau dangkal tentang konsep-konsep sejarah. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: AI tidak memahami nilai-nilai toleransi. Solusi: Guru mengajarkan toleransi melalui diskusi langsung.",
      "Masalah: AI memberikan interpretasi yang salah. Solusi: Guru membimbing siswa untuk mengevaluasi informasi yang diberikan oleh AI dan membandingkannya dengan sumber terpercaya.",
      "Masalah: Siswa kesulitan menggunakan AI untuk materi ini. Solusi: Guru memberikan panduan penggunaan AI kepada siswa.",
      "Masalah: AI tidak menarik bagi siswa. Solusi: Guru menggunakan AI untuk membuat simulasi interaktif.",
      "Masalah: AI mengurangi interaksi sosial siswa. Solusi: Guru mengadakan sesi diskusi kelompok setelah menggunakan AI."
    ],
    "a": 1
  },
  {
    "q": "Guru menggunakan AI untuk merancang proyek pembelajaran tentang perkembangan ilmu pengetahuan pada masa Bani Abbasiah. Guru ingin memastikan bahwa proyek tersebut relevan dengan kehidupan siswa dan mengembangkan keterampilan abad ke-21. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: AI tidak dapat membuat proyek yang relevan. Solusi: Guru merancang proyek sendiri.",
      "Masalah: Proyek terlalu sulit untuk siswa. Solusi: Guru menyesuaikan tingkat kesulitan proyek dengan kemampuan siswa.",
      "Masalah: AI mengurangi interaksi sosial siswa. Solusi: Guru membuat proyek kelompok yang menuntut kolaborasi dan diskusi.",
      "Masalah: Proyek tidak mengembangkan keterampilan abad ke-21. Solusi: Guru merancang proyek yang menuntut siswa untuk berpikir kritis, kreatif, dan berkolaborasi.",
      "Masalah: Proyek tidak sesuai dengan kurikulum. Solusi: Guru menyusun proyek sesuai dengan kurikulum."
    ],
    "a": 3
  },
  {
    "q": "Guru menggunakan AI untuk menyajikan informasi tentang sejarah Islam di berbagai negara. Namun, guru tersebut menyadari bahwa siswa kesulitan untuk menghubungkan informasi tersebut dengan kehidupan mereka. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: Informasi tidak relevan. Solusi: Guru mencari informasi yang relevan dengan kehidupan siswa.",
      "Masalah: Siswa kesulitan menghubungkan informasi. Solusi: Guru menggunakan studi kasus dan diskusi kelompok untuk membantu siswa menghubungkan informasi dengan kehidupan mereka.",
      "Masalah: AI sulit digunakan oleh siswa. Solusi: Guru memberikan panduan penggunaan AI.",
      "Masalah: AI tidak menarik. Solusi: Guru membuat simulasi interaktif dengan AI.",
      "Masalah: AI mengurangi interaksi sosial. Solusi: Guru mengadakan sesi diskusi kelompok."
    ],
    "a": 1
  },
  {
    "q": "Guru menggunakan teknologi untuk menyajikan materi tentang sejarah Islam dan budaya lokal. Namun, guru tersebut menyadari bahwa teknologi tidak dapat sepenuhnya menggambarkan keunikan budaya lokal dan pengalaman emosional siswa. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: Teknologi tidak dapat menggantikan pengalaman langsung. Solusi: Guru menggabungkan teknologi dengan kunjungan lapangan dan wawancara dengan tokoh masyarakat.",
      "Masalah: Teknologi sulit digunakan oleh siswa. Solusi: Guru memberikan pelatihan penggunaan teknologi.",
      "Masalah: Teknologi tidak menarik. Solusi: Guru membuat simulasi interaktif dengan teknologi.",
      "Masalah: Teknologi mengurangi interaksi sosial. Solusi: Guru mengadakan sesi diskusi kelompok.",
      "Masalah: Teknologi tidak relevan. Solusi: Guru mencari informasi yang relevan."
    ],
    "a": 0
  },
  {
    "q": "Dalam mengajarkan materi tentang strategi dakwah Islam di Nusantara, guru menggunakan teknologi AI untuk menyajikan berbagai perspektif tentang metode dakwah yang digunakan. Namun, guru tersebut menyadari bahwa siswa kesulitan dalam membedakan antara fakta sejarah dan opini yang dihasilkan oleh AI. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: AI menyajikan informasi yang tidak akurat. Solusi: Guru memeriksa hasil AI sebelum dibagikan ke siswa.",
      "Masalah: Siswa kesulitan membedakan fakta dan opini. Solusi: Guru membimbing siswa untuk mengevaluasi sumber informasi dan menggunakan berbagai sumber terpercaya.",
      "Masalah: AI tidak menarik bagi siswa. Solusi: Guru menggunakan AI untuk membuat simulasi interaktif.",
      "Masalah: AI mengurangi interaksi sosial siswa. Solusi: Guru mengadakan sesi diskusi kelompok setelah menggunakan AI.",
      "Masalah: AI sulit diakses oleh semua siswa. Solusi: Menyediakan perangkat komputer di sekolah."
    ],
    "a": 1
  },
  {
    "q": "Guru menggunakan teknologi untuk menyajikan materi tentang peradaban Islam di berbagai belahan dunia. Namun, guru tersebut menyadari bahwa siswa kesulitan dalam memahami kompleksitas sejarah dan pengaruh budaya yang berbeda. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: Informasi terlalu rumit. Solusi: Guru menyederhanakan informasi.",
      "Masalah: Siswa kesulitan memahami kompleksitas sejarah. Solusi: Guru menggunakan studi kasus dan diskusi kelompok untuk membantu siswa memahami sejarah.",
      "Masalah: Teknologi sulit digunakan. Solusi: Guru memberikan panduan penggunaan teknologi.",
      "Masalah: Teknologi tidak menarik. Solusi: Guru membuat simulasi interaktif.",
      "Masalah: Teknologi mengurangi interaksi sosial. Solusi: Guru mengadakan sesi diskusi kelompok."
    ],
    "a": 1
  },
  {
    "q": "Dalam materi tentang perkembangan ilmu pengetahuan masa Daulah Umayyah, guru menggunakan teknologi untuk menunjukkan kontribusi ilmuwan Muslim. Namun, guru tersebut menyadari bahwa siswa cenderung hanya fokus pada tokoh dan kurang memahami konteks sosial budaya. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: Siswa fokus pada tokoh. Solusi: Guru menggunakan studi kasus yang membahas konteks sosial budaya.",
      "Masalah: Teknologi tidak menarik. Solusi: Guru membuat kuis interaktif.",
      "Masalah: Siswa kesulitan menggunakan teknologi. Solusi: Guru memberikan panduan.",
      "Masalah: Teknologi tidak akurat. Solusi: Guru mengecek informasi.",
      "Masalah: Siswa tidak tertarik. Solusi: Guru membuat proyek kelompok."
    ],
    "a": 0
  },
  {
    "q": "Guru ingin mengajarkan materi tentang sejarah Islam dengan menggunakan teknologi yang interaktif dan menarik. Guru tersebut memutuskan untuk menggunakan AI untuk membuat cerita interaktif tentang tokoh sejarah. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: AI tidak dapat membuat cerita yang menarik. Solusi: Guru membuat cerita sendiri.",
      "Masalah: Siswa tidak tertarik dengan cerita interaktif. Solusi: Guru membuat cerita lebih interaktif dan relevan dengan kehidupan siswa.",
      "Masalah: AI tidak akurat. Solusi: Guru memeriksa cerita sebelum dibagikan.",
      "Masalah: AI mengurangi interaksi sosial. Solusi: Guru mengadakan sesi diskusi kelompok setelah cerita.",
      "Masalah: AI sulit digunakan. Solusi: Guru memberikan panduan penggunaan."
    ],
    "a": 1
  },
  {
    "q": "Guru menggunakan AI untuk menyajikan materi tentang konflik politik masa Khulafaur Rasyidin. Namun, guru tersebut menyadari bahwa AI dapat memberikan perspektif yang berat sebelah. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: AI tidak memahami konflik politik. Solusi: Guru mengajarkan konflik melalui buku teks.",
      "Masalah: AI memberikan perspektif berat sebelah. Solusi: Guru membimbing siswa untuk mengevaluasi berbagai sumber informasi dan memahami berbagai sudut pandang.",
      "Masalah: Siswa tidak tertarik. Solusi: Guru menggunakan teknologi untuk membuat kuis.",
      "Masalah: AI sulit digunakan. Solusi: Guru memberikan panduan.",
      "Masalah: AI tidak akurat. Solusi: Guru memeriksa informasi sebelum digunakan."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran tentang kebudayaan Islam di Nusantara, guru menggunakan teknologi untuk menyajikan berbagai bentuk kesenian Islam. Namun, guru tersebut menyadari bahwa siswa cenderung hanya menonton tanpa memahami makna filosofis kesenian tersebut. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: Kesenian tidak menarik. Solusi: Guru mencari kesenian yang lebih modern.",
      "Masalah: Siswa hanya menonton. Solusi: Guru mengadakan diskusi kelompok untuk membahas makna filosofis kesenian tersebut.",
      "Masalah: Teknologi tidak menarik. Solusi: Guru membuat simulasi.",
      "Masalah: Siswa kesulitan menggunakan teknologi. Solusi: Guru memberikan panduan.",
      "Masalah: Teknologi tidak akurat. Solusi: Guru mengecek informasi."
    ],
    "a": 1
  },
  {
    "q": "Guru menggunakan teknologi AI untuk merancang penilaian hasil belajar siswa pada materi sejarah Islam. Namun, guru tersebut menyadari bahwa AI tidak dapat sepenuhnya menilai keterampilan berpikir kritis dan kreativitas siswa. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: AI tidak dapat membuat soal yang sulit. Solusi: Guru membuat soal sendiri.",
      "Masalah: AI tidak dapat menilai keterampilan berpikir kritis. Solusi: Guru menggunakan rubrik penilaian yang komprehensif dan menilai proyek secara manual.",
      "Masalah: AI tidak menarik. Solusi: Guru membuat simulasi.",
      "Masalah: AI tidak akurat. Solusi: Guru mengecek jawaban.",
      "Masalah: AI sulit digunakan. Solusi: Guru memberikan panduan."
    ],
    "a": 1
  },
  {
    "q": "Dalam mengajarkan materi tentang peradaban Islam di Afrika, guru menggunakan teknologi untuk menunjukkan peta dan gambar peradaban. Namun, guru tersebut menyadari bahwa siswa cenderung hanya melihat gambar tanpa memahami sejarah yang kompleks. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: Gambar tidak menarik. Solusi: Guru mencari gambar yang lebih baik.",
      "Masalah: Siswa hanya melihat gambar. Solusi: Guru mengadakan diskusi kelompok untuk membahas sejarah yang kompleks.",
      "Masalah: Teknologi tidak menarik. Solusi: Guru membuat kuis.",
      "Masalah: Siswa kesulitan menggunakan teknologi. Solusi: Guru memberikan panduan.",
      "Masalah: Teknologi tidak akurat. Solusi: Guru mengecek informasi."
    ],
    "a": 1
  },
  {
    "q": "Guru ingin mengajarkan materi tentang tokoh-tokoh Islam di dunia dengan menggunakan teknologi. Guru tersebut memutuskan untuk menggunakan AI untuk membuat profil tokoh sejarah. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: AI tidak dapat membuat profil yang menarik. Solusi: Guru membuat profil sendiri.",
      "Masalah: Siswa tidak tertarik dengan profil sejarah. Solusi: Guru menggunakan teknologi untuk membuat cerita interaktif.",
      "Masalah: AI tidak akurat. Solusi: Guru memeriksa profil sebelum dibagikan.",
      "Masalah: AI mengurangi interaksi sosial. Solusi: Guru mengadakan sesi diskusi kelompok setelah profil.",
      "Masalah: AI sulit digunakan. Solusi: Guru memberikan panduan penggunaan."
    ],
    "a": 2
  },
  {
    "q": "Guru menggunakan teknologi AI untuk mengajarkan materi tentang perkembangan Islam di Eropa. Namun, guru tersebut menyadari bahwa AI dapat memberikan informasi yang tidak akurat. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: AI tidak memahami sejarah Eropa. Solusi: Guru mengajarkan sejarah melalui buku teks.",
      "Masalah: AI memberikan informasi tidak akurat. Solusi: Guru membimbing siswa untuk mengevaluasi sumber informasi dan membandingkannya dengan sumber terpercaya.",
      "Masalah: Siswa tidak tertarik. Solusi: Guru menggunakan teknologi untuk membuat kuis.",
      "Masalah: AI sulit digunakan. Solusi: Guru memberikan panduan.",
      "Masalah: AI mengurangi interaksi sosial. Solusi: Guru mengadakan diskusi kelompok."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran tentang budaya Islam di Nusantara, guru menggunakan teknologi untuk menyajikan berbagai bentuk arsitektur Islam. Namun, guru tersebut menyadari bahwa siswa cenderung hanya melihat foto tanpa memahami sejarah dan makna arsitektur. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: Foto tidak menarik. Solusi: Guru mencari foto yang lebih baik.",
      "Masalah: Siswa hanya melihat foto. Solusi: Guru mengadakan diskusi kelompok untuk membahas sejarah dan makna arsitektur.",
      "Masalah: Teknologi tidak menarik. Solusi: Guru membuat kuis.",
      "Masalah: Siswa kesulitan menggunakan teknologi. Solusi: Guru memberikan panduan.",
      "Masalah: Teknologi tidak akurat. Solusi: Guru mengecek informasi."
    ],
    "a": 1
  },
  {
    "q": "Guru menggunakan teknologi AI untuk merancang bahan ajar sejarah Islam. Namun, guru tersebut menyadari bahwa AI tidak dapat sepenuhnya menyajikan konteks budaya lokal. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: AI tidak dapat membuat bahan ajar yang menarik. Solusi: Guru membuat bahan ajar sendiri.",
      "Masalah: AI tidak dapat menyajikan konteks budaya lokal. Solusi: Guru menggunakan AI hanya sebagai pelengkap, dan menggunakan bahan ajar yang disusun sendiri.",
      "Masalah: AI tidak menarik. Solusi: Guru membuat simulasi.",
      "Masalah: AI tidak akurat. Solusi: Guru mengecek bahan ajar.",
      "Masalah: AI sulit digunakan. Solusi: Guru memberikan panduan."
    ],
    "a": 1
  },
  {
    "q": "Dalam mengajarkan materi tentang peradaban Islam di Asia, guru menggunakan teknologi untuk menunjukkan peta dan gambar peradaban. Namun, guru tersebut menyadari bahwa siswa cenderung hanya melihat gambar tanpa memahami sejarah yang kompleks. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: Gambar tidak menarik. Solusi: Guru mencari gambar yang lebih baik.",
      "Masalah: Siswa hanya melihat gambar. Solusi: Guru mengadakan diskusi kelompok untuk membahas sejarah yang kompleks.",
      "Masalah: Teknologi tidak menarik. Solusi: Guru membuat kuis.",
      "Masalah: Siswa kesulitan menggunakan teknologi. Solusi: Guru memberikan panduan.",
      "Masalah: Teknologi tidak akurat. Solusi: Guru mengecek informasi."
    ],
    "a": 1
  },
  {
    "q": "Guru ingin mengajarkan materi tentang tokoh-tokoh Islam di dunia dengan menggunakan teknologi. Guru tersebut memutuskan untuk menggunakan AI untuk membuat cerita interaktif tentang tokoh sejarah. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: AI tidak dapat membuat cerita yang menarik. Solusi: Guru membuat cerita sendiri.",
      "Masalah: Siswa tidak tertarik dengan cerita interaktif. Solusi: Guru menggunakan teknologi untuk membuat cerita interaktif.",
      "Masalah: AI tidak akurat. Solusi: Guru memeriksa cerita sebelum dibagikan.",
      "Masalah: AI mengurangi interaksi sosial. Solusi: Guru mengadakan sesi diskusi kelompok setelah cerita.",
      "Masalah: AI sulit digunakan. Solusi: Guru memberikan panduan penggunaan."
    ],
    "a": 2
  },
  {
    "q": "Guru menggunakan teknologi AI untuk mengajarkan materi tentang perkembangan Islam di Amerika. Namun, guru tersebut menyadari bahwa AI dapat memberikan informasi yang tidak akurat. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: AI tidak memahami sejarah Amerika. Solusi: Guru mengajarkan sejarah melalui buku teks.",
      "Masalah: AI memberikan informasi tidak akurat. Solusi: Guru membimbing siswa untuk mengevaluasi sumber informasi dan membandingkannya dengan sumber terpercaya.",
      "Masalah: Siswa tidak tertarik. Solusi: Guru menggunakan teknologi untuk membuat kuis.",
      "Masalah: AI sulit digunakan. Solusi: Guru memberikan panduan.",
      "Masalah: AI mengurangi interaksi sosial. Solusi: Guru mengadakan diskusi kelompok."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran tentang budaya Islam di Nusantara, guru menggunakan teknologi untuk menyajikan berbagai bentuk pakaian adat Islam. Namun, guru tersebut menyadari bahwa siswa cenderung hanya melihat foto tanpa memahami makna dan sejarah pakaian adat tersebut. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: Foto tidak menarik. Solusi: Guru mencari foto yang lebih baik.",
      "Masalah: Siswa hanya melihat foto. Solusi: Guru mengadakan diskusi kelompok untuk membahas makna dan sejarah pakaian adat.",
      "Masalah: Teknologi tidak menarik. Solusi: Guru membuat kuis.",
      "Masalah: Siswa kesulitan menggunakan teknologi. Solusi: Guru memberikan panduan.",
      "Masalah: Teknologi tidak akurat. Solusi: Guru mengecek informasi."
    ],
    "a": 1
  },
  {
    "q": "Guru menggunakan teknologi AI untuk merancang bahan ajar sejarah Islam. Namun, guru tersebut menyadari bahwa AI tidak dapat sepenuhnya menyajikan materi yang relevan dengan kehidupan siswa. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: AI tidak dapat membuat bahan ajar yang menarik. Solusi: Guru membuat bahan ajar sendiri.",
      "Masalah: AI tidak dapat menyajikan materi yang relevan. Solusi: Guru menggunakan AI hanya sebagai pelengkap, dan menggunakan bahan ajar yang disusun sendiri.",
      "Masalah: AI tidak menarik. Solusi: Guru membuat simulasi.",
      "Masalah: AI tidak akurat. Solusi: Guru mengecek bahan ajar.",
      "Masalah: AI sulit digunakan. Solusi: Guru memberikan panduan."
    ],
    "a": 1
  },
  {
    "q": "Dalam mengajarkan materi tentang peradaban Islam di Asia Tenggara, guru menggunakan teknologi untuk menunjukkan peta dan gambar peradaban. Namun, guru tersebut menyadari bahwa siswa cenderung hanya melihat gambar tanpa memahami sejarah yang kompleks. Masalah dan solusi yang tepat adalah...",
    "o": [
      "Masalah: Gambar tidak menarik. Solusi: Guru mencari gambar yang lebih baik.",
      "Masalah: Siswa hanya melihat gambar. Solusi: Guru mengadakan diskusi kelompok untuk membahas sejarah yang kompleks.",
      "Masalah: Teknologi tidak menarik. Solusi: Guru membuat kuis.",
      "Masalah: Siswa kesulitan menggunakan teknologi. Solusi: Guru memberikan panduan.",
      "Masalah: Teknologi tidak akurat. Solusi: Guru mengecek informasi."
    ],
    "a": 1
  }
]
