[
  {
    "q": "Dalam sebuah pembelajaran materi Kondisi Jazirah Arab Pra Islam, Pak Ahmad ingin siswanya tidak hanya memahami sejarah secara kognitif, tetapi juga mampu mengapresiasi nilai-nilai ketauhidan yang dibawa Nabi Muhammad SAW untuk memperbaiki akhlak. Rumusan tujuan pembelajaran ranah sikap yang paling tepat untuk mencapai hal tersebut adalah...",
    "o": [
      "Siswa dapat menjelaskan kondisi sosial budaya masyarakat Arab sebelum Islam dengan detail.",
      "Siswa dapat menganalisis perbedaan kepercayaan masyarakat Arab sebelum dan sesudah Islam.",
      "Siswa dapat membiasakan sikap jujur dan amanah dalam kehidupan sehari-hari sebagai cerminan meneladani akhlak Nabi Muhammad SAW.",
      "Siswa dapat menyebutkan nama-nama berhala yang disembah masyarakat Arab Pra Islam.",
      "Siswa dapat menceritakan kisah kehidupan Nabi Muhammad SAW sebelum masa kerasulan."
    ],
    "a": 2
  },
  {
    "q": "Ibu Fatimah mengajar materi Nabi Muhammad SAW sebelum hijrah ke Madinah. Beliau ingin siswanya mampu menganalisis alasan dibalik peristiwa tersebut dan dampaknya. Indikator pembelajaran yang menunjukkan kemampuan berpikir kritis peserta didik adalah...",
    "o": [
      "Peserta didik dapat menghafal urutan peristiwa hijrah dari Makkah ke Madinah.",
      "Peserta didik dapat menyimpulkan faktor-faktor penyebab hijrah Nabi Muhammad SAW dan dampaknya bagi perkembangan Islam.",
      "Peserta didik dapat menggambar peta rute perjalanan hijrah Nabi Muhammad SAW.",
      "Peserta didik dapat menyebutkan tokoh-tokoh yang membantu Nabi Muhammad SAW saat hijrah.",
      "Peserta didik dapat menyanyikan lagu tentang perjalanan hijrah Nabi Muhammad SAW."
    ],
    "a": 1
  },
  {
    "q": "Pada materi Sistem Pemerintahan Islam masa Abu Bakar As-Shiddiq, Pak Budi ingin menanamkan nilai kebinekaan global dan gotong royong. Rumusan tujuan pembelajaran ranah keterampilan yang paling relevan adalah...",
    "o": [
      "Peserta didik dapat menjelaskan silsilah kekhalifahan Abu Bakar As-Shiddiq.",
      "Peserta didik dapat membuat infografis mengenai struktur pemerintahan pada masa Khulafaur Rasyidin.",
      "Peserta didik dapat mensimulasikan proses musyawarah pemilihan pemimpin dengan menjunjung tinggi nilai persatuan dan kerja sama kelompok.",
      "Peserta didik dapat menjawab pertanyaan tentang kebijakan Abu Bakar dalam memerangi nabi palsu.",
      "Peserta didik dapat membaca teks biografi Abu Bakar As-Shiddiq dengan lancar."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran materi Teori Masuknya Islam di Indonesia, terdapat berbagai pendapat. Guru ingin siswa memiliki sikap terbuka dan menghargai perbedaan tersebut sebagai tradisi akademik yang wajar. Rumusan indikator tujuan pembelajaran ranah sikap yang sesuai adalah...",
    "o": [
      "Peserta didik mampu menyebutkan tokoh pencetus teori Gujarat.",
      "Peserta didik menunjukkan sikap menghargai perbedaan pendapat mengenai sejarah masuknya Islam di Indonesia.",
      "Peserta didik mampu menganalisis kelemahan teori Mekah.",
      "Peserta didik dapat membandingkan teori Persia dengan teori Cina.",
      "Peserta didik mampu membuat kliping tentang peninggalan Islam di Indonesia."
    ],
    "a": 1
  },
  {
    "q": "Materi sistem pemerintahan Islam pada masa Dinasti Ayyubiyah menunjukkan adanya inovasi dalam militer dan pendidikan. Guru ingin siswa mampu berpikir dinamis dan inovatif dalam memandang sejarah. Rumusan indikator tujuan pembelajaran yang tepat adalah...",
    "o": [
      "Peserta didik dapat menyebutkan tahun berdirinya Dinasti Ayyubiyah.",
      "Peserta didik dapat menjelaskan struktur pemerintahan Dinasti Ayyubiyah.",
      "Peserta didik mampu merumuskan ide kreatif tentang pengembangan lembaga pendidikan Islam masa kini berdasarkan model madrasah masa Ayyubiyah.",
      "Peserta didik dapat menceritakan tokoh pendiri Dinasti Ayyubiyah.",
      "Peserta didik dapat menyebutkan wilayah kekuasaan Dinasti Ayyubiyah."
    ],
    "a": 2
  },
  {
    "q": "Pak Rahmat merencanakan pembelajaran materi Peradaban Pra Islam menggunakan pendekatan *Problem Based Learning* (PBL). Berdasarkan karakteristik peserta didik yang menyukai diskusi dan analisis kasus, aktivitas analisis materi ajar yang paling tepat dilakukan Pak Rahmat adalah...",
    "o": [
      "Meminta siswa membaca buku teks secara mandiri selama 30 menit.",
      "Menyajikan kasus tentang ketimpangan sosial masyarakat Arab pra Islam dan meminta siswa menganalisis akar masalahnya.",
      "Menayangkan video dokumenter tentang sejarah padang pasir.",
      "Meminta siswa menghafal silsilah suku Quraisy.",
      "Memberikan ceramah tentang kebiasaan buruk masyarakat Arab."
    ],
    "a": 1
  },
  {
    "q": "Ibu Sari menggunakan pendekatan *Project Based Learning* (PjBL) pada materi Nabi Muhammad sebelum hijrah ke Madinah. Langkah yang paling sesuai dengan karakteristik peserta didik dalam menganalisis materi ajar pada tahap pelaksanaan adalah...",
    "o": [
      "Guru menjelaskan kronologi hijrah menggunakan metode ceramah.",
      "Siswa secara berkelompok membuat diorama atau peta perjalanan hijrah Nabi Muhammad SAW.",
      "Siswa mengerjakan soal pilihan ganda tentang tempat-tempat yang dikunjungi Nabi.",
      "Guru meminta siswa menulis ringkasan materi di buku tulis.",
      "Siswa mendengarkan ceramah dari tokoh masyarakat."
    ],
    "a": 1
  },
  {
    "q": "Pak Doni mengevaluasi pembelajaran sejarah Khulafaur Rasyidin menggunakan pendekatan *Debate Based Learning* (DBL). Untuk mengembangkan kemampuan analisis siswa, kasus yang tepat disajikan adalah...",
    "o": [
      "Debat mengenai siapa yang paling berhak menjadi khalifah setelah Nabi wafat.",
      "Debat mengenai keefektifan sistem pemerintahan di era modern dibandingkan masa Khulafaur Rasyidin.",
      "Debat mengenai kebijakan Abu Bakar memerangi orang yang tidak membayar zakat.",
      "Debat mengenai latar belakang perpindahan ibu kota ke Kufah oleh Ali bin Abi Thalib.",
      "Debat mengenai gaya kepemimpinan Umar bin Khattab yang tegas."
    ],
    "a": 1
  },
  {
    "q": "Dalam merencanakan pembelajaran materi perkembangan ilmu pengetahuan masa Utsman bin Affan menggunakan pendekatan TPACK, alur materi ajar yang logis dan relevan bagi siswa era digital adalah...",
    "o": [
      "Membaca kitab kuning tentang sejarah kodifikasi Al-Qur'an.",
      "Menggunakan aplikasi *mind mapping* untuk memetakan perkembangan ilmu pengetahuan dan sastra pada masa Utsman bin Affan.",
      "Mendengarkan rekaman ceramah tentang perluasan wilayah.",
      "Mengerjakan LKS tentang kebijakan ekonomi masa Utsman.",
      "Menghafal nama-nama gubernur yang diangkat oleh Utsman bin Affan."
    ],
    "a": 1
  },
  {
    "q": "Ibu Rina menerapkan *Deep Learning* (DL) dalam melaksanakan pembelajaran sejarah masuknya Islam di Asia Tenggara. Alur materi ajar yang mendorong pemahaman mendalam adalah...",
    "o": [
      "Siswa diminta menghafal nama-nama kerajaan Islam di Asia Tenggara.",
      "Siswa menganalisis faktor-faktor yang menyebabkan Islam mudah diterima oleh masyarakat lokal melalui kajian literatur dan diskusi.",
      "Guru menceritakan kisah kedatangan pedagang Arab.",
      "Siswa mengerjakan soal latihan tentang tahun masuknya Islam.",
      "Siswa mewarnai peta persebaran Islam di Asia Tenggara."
    ],
    "a": 1
  },
  {
    "q": "Pada tahap evaluasi pembelajaran masa keruntuhan Dinasti Ayyubiyah, guru menggunakan model pelayanan konseling untuk memahami kesulitan siswa. Aktivitas yang sesuai adalah...",
    "o": [
      "Memberikan tes tertulis dengan tingkat kesulitan tinggi.",
      "Meminta siswa menuliskan refleksi tentang kesulitan mereka dalam memahami faktor runtuhnya Ayyubiyah dan memberikan bimbingan individual.",
      "Menyuruh siswa menghafal semua penyebab runtuhnya dinasti.",
      "Melakukan debat antar kelompok tentang penyebab utama runtuhnya dinasti.",
      "Memberikan tugas membuat makalah tentang Dinasti Ayyubiyah."
    ],
    "a": 1
  },
  {
    "q": "Dalam pelaksanaan program Penguatan Profil Pelajar Pancasila (P5), materi yang dikembangkan harus sesuai karakteristik siswa. Pengembangan materi nilai P5 yang tepat dalam perencanaan pembelajaran adalah...",
    "o": [
      "Menyuruh siswa menghafal pengertian P5.",
      "Menyajikan kasus konflik antarsuku dan meminta siswa mencari solusi berbasis nilai gotong royong dan berkebinekaan global.",
      "Guru menceritakan sejarah berdirinya negara Indonesia.",
      "Siswa diminta membaca buku teks tentang PPRA.",
      "Guru memberikan ceramah tentang kejujuran."
    ],
    "a": 1
  },
  {
    "q": "Ibu Lina menerapkan nilai-nilai Profil Pelajar Rahmatan lil 'Alamin (PPRA) dalam pelaksanaan pembelajaran. Bentuk aktivitas yang paling sesuai adalah...",
    "o": [
      "Siswa mendengarkan ceramah tentang pengertian PPRA.",
      "Siswa berdiskusi kelompok tentang toleransi beragama dan membuat poster kampanye moderasi beragama.",
      "Siswa menuliskan teks tentang sejarah Islam di Indonesia.",
      "Siswa menghafal ayat-ayat tentang akhlak.",
      "Siswa mengerjakan tes tertulis tentang sejarah Islam."
    ],
    "a": 1
  },
  {
    "q": "Pak Aris mengevaluasi implementasi moderasi beragama dalam pembelajaran SKI. Bentuk pengembangan materi yang tepat untuk mengukur pemahaman konsep *wasathiyyah* siswa adalah...",
    "o": [
      "Tes tertulis tentang definisi moderasi beragama.",
      "Studi kasus tentang perilaku ekstrem dan meminta siswa memberikan pandangan berdasarkan konsep *wasathiyyah*.",
      "Menyuruh siswa menghafal tokoh-tokoh moderat.",
      "Meminta siswa menyanyikan lagu tentang toleransi.",
      "Memberikan tugas merangkum buku tentang sejarah Islam."
    ],
    "a": 1
  },
  {
    "q": "Ibu Nia ingin menilai pemahaman siswa mengenai urgensi Islam sebagai agama moderat secara komprehensif. Penilaian yang paling sesuai adalah...",
    "o": [
      "Tes pilihan ganda tentang rukun iman.",
      "Penilaian kinerja berupa simulasi penyelesaian konflik antarkelompok dengan menerapkan prinsip moderasi.",
      "Tes tertulis tentang sejarah kerajaan Islam.",
      "Tugas meresensi buku sejarah.",
      "Tanya jawab lisan tentang tokoh Islam."
    ],
    "a": 1
  },
  {
    "q": "Pada materi Peradaban Bangsa Arab Pra Islam, Pak Budi ingin menggunakan *Problem Based Learning* (PBL). Rancangan pembelajaran yang sesuai adalah...",
    "o": [
      "Siswa diminta menghafal kebiasaan buruk masyarakat Arab.",
      "Siswa mendiskusikan kasus ketidakadilan hukum di masyarakat Arab pra Islam dan mencari solusi berdasarkan nilai keadilan.",
      "Guru menceritakan kisah kelahiran Nabi.",
      "Siswa mengerjakan soal cerita tentang dagang.",
      "Siswa membaca puisi tentang keindahan padang pasir."
    ],
    "a": 1
  },
  {
    "q": "Ibu Wati mengajar materi Perjalanan Hijrah Nabi ke Madinah. Rancangan pembelajaran yang sesuai dengan pengetahuan pedagogik untuk memotivasi siswa adalah...",
    "o": [
      "Guru menjelaskan rute hijrah di depan kelas.",
      "Siswa dibagi menjadi kelompok kecil dan membuat peta interaktif rute hijrah menggunakan aplikasi di tablet.",
      "Siswa menulis kisah perjalanan Nabi.",
      "Siswa menghafal nama tokoh yang menemani Nabi.",
      "Siswa mengerjakan soal pilihan ganda."
    ],
    "a": 1
  },
  {
    "q": "Pada materi akhir pemerintahan Abu Bakar, Pak Huda ingin menggunakan pendekatan PBL berbasis teknologi. Rancangan yang tepat adalah...",
    "o": [
      "Siswa mencari informasi dari buku teks.",
      "Siswa menganalisis kebijakan Abu Bakar melalui dokumen digital dan menyajikannya dalam bentuk presentasi.",
      "Siswa mendengarkan penjelasan guru.",
      "Siswa menulis ringkasan sejarah.",
      "Siswa menjawab pertanyaan di LKS."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran materi Ali bin Abi Thalib, Ibu Ani ingin mengakomodasi perbedaan individu. Rancangan yang sesuai adalah...",
    "o": [
      "Semua siswa diwajibkan membuat makalah yang sama.",
      "Siswa diberi kebebasan memilih bentuk tugas: infografis, video pendek, atau laporan tertulis tentang kepemimpinan Ali bin Abi Thalib.",
      "Semua siswa mengikuti metode ceramah guru.",
      "Siswa mengerjakan tes tertulis.",
      "Siswa menghafal puisi tentang Ali."
    ],
    "a": 1
  },
  {
    "q": "Pada materi Dakwah Walisongo, Pak Edi ingin menggunakan pendekatan perbedaan individu berbasis pedagogi. Rancangan pembelajaran yang tepat adalah...",
    "o": [
      "Guru menggunakan metode ceramah untuk semua siswa.",
      "Siswa dibagi kelompok berdasarkan minat (seni, sosial, teknologi) untuk membuat proyek tentang metode dakwah Walisongo.",
      "Siswa mengerjakan tes pilihan ganda yang sama.",
      "Siswa menulis resume buku sejarah.",
      "Siswa membaca bersama-sama."
    ],
    "a": 1
  },
  {
    "q": "Ibu Dwi ingin menggunakan pendekatan pembelajaran berbasis perbedaan individu dengan teknologi pada materi Tradisi Islam Nusantara. Rancangan yang tepat adalah...",
    "o": [
      "Siswa membaca buku teks secara mandiri.",
      "Siswa menggunakan aplikasi tur virtual untuk mengunjungi makam atau masjid bersejarah di Nusantara.",
      "Siswa mendengarkan ceramah guru.",
      "Siswa menghafal nama-nama tradisi.",
      "Siswa menulis laporan perjalanan."
    ],
    "a": 1
  },
  {
    "q": "Untuk mengembangkan kemampuan *critical thinking* siswa pada materi Dinasti Umayyah, pendekatan *Deep Learning* yang tepat dirancang adalah...",
    "o": [
      "Siswa menghafal nama-nama khalifah Dinasti Umayyah.",
      "Siswa berdiskusi menganalisis faktor keberhasilan perluasan wilayah Dinasti Umayyah dan dampaknya terhadap peradaban Islam.",
      "Guru menjelaskan sejarah berdiri Dinasti Umayyah.",
      "Siswa membaca buku tentang Umayyah.",
      "Siswa menjawab pertanyaan LKS."
    ],
    "a": 1
  },
  {
    "q": "Pak Anwar ingin mengembangkan *creativity* siswa pada materi faktor runtuhnya Bani Umayyah. Pendekatan pembelajaran yang tepat adalah...",
    "o": [
      "Siswa menuliskan kembali faktor penyebab runtuhnya Bani Umayyah.",
      "Siswa membuat komik digital yang menggambarkan kisah runtuhnya Bani Umayyah.",
      "Siswa mengerjakan tes tertulis.",
      "Siswa menghafal tahun runtuhnya Bani Umayyah.",
      "Siswa mendengarkan ceramah."
    ],
    "a": 1
  },
  {
    "q": "Pada materi pendidikan nilai, Ibu Rika ingin menggunakan pendekatan *Deep Learning* berbasis teknologi untuk mengembangkan *collaboration*. Rancangan yang tepat adalah...",
    "o": [
      "Siswa menulis esai secara individu.",
      "Siswa bekerja kelompok membuat video pendek tentang perilaku jujur menggunakan aplikasi *editing* video.",
      "Siswa menjawab pertanyaan di kertas.",
      "Siswa mendengarkan penjelasan guru.",
      "Siswa membaca buku bersama."
    ],
    "a": 1
  },
  {
    "q": "Pak Adi menerapkan TPACK pada materi moderasi beragama di Indonesia. Rancangan pembelajaran yang sesuai adalah...",
    "o": [
      "Siswa membaca buku teks tentang toleransi.",
      "Siswa menganalisis video kasus konflik keagamaan dan merumuskan solusi moderasi menggunakan alat bantu digital.",
      "Guru memberikan ceramah.",
      "Siswa mengerjakan tes tertulis.",
      "Siswa menulis rangkuman."
    ],
    "a": 1
  },
  {
    "q": "Materi Kehidupan Sosial Politik Arab Pra Islam dirasa kurang relevan. Untuk menciptakan suasana aman dan berkarakter, strategi pendekatan yang tepat adalah...",
    "o": [
      "Guru menjelaskan materi secara searah agar tidak terjadi perdebatan.",
      "Menggunakan *Problem Based Learning* (PBL) untuk membahas kasus ketidakadilan sosial, di mana siswa merasa aman mengutarakan pendapat.",
      "Memberikan tes tertulis bertubi-tubi.",
      "Menyuruh siswa menghafal nama suku-suku Arab.",
      "Meminta siswa membaca buku di perpustakaan."
    ],
    "a": 1
  },
  {
    "q": "Pada materi Hijrah Nabi ke Madinah yang materinya kurang sesuai dengan perkembangan zaman, guru ingin menciptakan suasana belajar yang nyaman. Pendekatan yang tepat adalah...",
    "o": [
      "Guru menggunakan metode ceramah konvensional.",
      "Menggunakan *Project Based Learning* (PjBL) membuat vlog tentang kisah hijrah.",
      "Siswa mengerjakan soal latihan yang rumit.",
      "Siswa diminta menghafal rute perjalanan.",
      "Guru membacakan buku teks."
    ],
    "a": 1
  },
  {
    "q": "Materi Dakwah Abu Bakar dirasa membosankan. Untuk menciptakan suasana membahagiakan, strategi yang tepat adalah...",
    "o": [
      "Memberikan tugas merangkum materi.",
      "Menggunakan *Debate Based Learning* (DBL) untuk membahas kebijakan Abu Bakar dengan gaya simulasi.",
      "Menyuruh siswa membaca buku teks.",
      "Guru menjelaskan materi dengan nada datar.",
      "Siswa mengerjakan tes pilihan ganda."
    ],
    "a": 1
  },
  {
    "q": "Materi dakwah Utsman bin Affan kurang menarik bagi generasi alpha. Untuk menciptakan suasana akomodatif, model pembelajaran yang tepat adalah...",
    "o": [
      "Guru menggunakan metode ceramah.",
      "Menggunakan *Deep Learning* (DL) dengan analisis mendalam melalui diskusi studi kasus.",
      "Memberikan banyak tugas mandiri.",
      "Menyuruh siswa menghafal silsilah.",
      "Siswa mengerjakan soal tertulis."
    ],
    "a": 1
  },
  {
    "q": "Materi pemikiran tokoh Islam era modern kurang dipahami siswa. Untuk menciptakan suasana adaptif dengan teknologi, model pembelajaran yang tepat adalah...",
    "o": [
      "Guru membacakan buku teks.",
      "Menggunakan TPACK untuk menyajikan materi melalui infografis interaktif.",
      "Siswa membuat kliping koran.",
      "Siswa menghafal nama tokoh.",
      "Guru memberikan ceramah."
    ],
    "a": 1
  },
  {
    "q": "Materi masuknya Islam di Asia Tenggara dirasa kurang progresif. Untuk meningkatkan suasana belajar, pendekatan yang tepat adalah...",
    "o": [
      "Guru menjelaskan sejarah dengan metode konvensional.",
      "Menggunakan model pembelajaran bimbingan konseling untuk membangun kesadaran diri siswa.",
      "Memberikan tugas menghafal tahun.",
      "Siswa membaca buku teks.",
      "Guru memberikan kuis."
    ],
    "a": 1
  },
  {
    "q": "Materi Dinasti Abbasiyah kurang sesuai untuk siswa ABK. Untuk menciptakan lingkungan akomodatif, pendekatan yang tepat adalah...",
    "o": [
      "Siswa ABK diminta mengerjakan tugas yang sama.",
      "Menggunakan pendekatan pembelajaran berbasis bimbingan konseling dan media pembelajaran yang sesuai untuk ABK.",
      "Guru menjelaskan materi secara umum.",
      "Siswa ABK diminta membaca buku teks.",
      "Siswa ABK diberikan tes tertulis."
    ],
    "a": 1
  },
  {
    "q": "Materi ilmu pengetahuan masa Abbasiyah kurang sesuai dengan zaman. Untuk menciptakan lingkungan adaptif, pendekatan yang tepat adalah...",
    "o": [
      "Guru menggunakan metode ceramah.",
      "Menggunakan pendekatan pembelajaran relevan yang berbasis pada *blended learning*.",
      "Memberikan tugas merangkum.",
      "Siswa menghafal tokoh.",
      "Siswa membaca buku."
    ],
    "a": 1
  },
  {
    "q": "Materi pendidikan karakter kurang menarik. Untuk menciptakan lingkungan progresif, pendekatan yang tepat adalah...",
    "o": [
      "Guru menjelaskan karakter.",
      "Menggunakan pendekatan *experiential learning* atau pendekatan yang relevan.",
      "Menyuruh siswa membaca buku.",
      "Siswa mengerjakan tes tertulis.",
      "Siswa menghafal contoh karakter."
    ],
    "a": 1
  },
  {
    "q": "Materi moderasi beragama kurang sesuai zaman. Untuk menciptakan lingkungan membahagiakan, pendekatan yang tepat adalah...",
    "o": [
      "Guru menjelaskan moderasi.",
      "Menggunakan pendekatan *game-based learning* atau pendekatan yang relevan.",
      "Memberikan tugas esai.",
      "Siswa membaca buku.",
      "Guru memberikan ceramah."
    ],
    "a": 1
  },
  {
    "q": "Pak Rahmat mengajarkan materi Kehidupan Ekonomi Arab Pra Islam dengan PBL. Teknik asesmen yang tepat untuk mengukur keterampilan siswa dalam menganalisis kasus adalah...",
    "o": [
      "Tes pilihan ganda tentang jenis dagang.",
      "Penilaian kinerja berupa presentasi hasil analisis studi kasus ekonomi.",
      "Tes tertulis tentang tahun.",
      "Tugas menghafal silsilah suku.",
      "Tes lisan tentang nama berhala."
    ],
    "a": 1
  },
  {
    "q": "Ibu Sari mengajarkan dakwah Nabi di Madinah dengan PjBL. Instrumen asesmen yang tepat untuk menilai produk akhir siswa adalah...",
    "o": [
      "Tes tertulis.",
      "Rubrik penilaian produk (diorama/video).",
      "Kuis pilihan ganda.",
      "Tes lisan.",
      "Lembar pengamatan sikap."
    ],
    "a": 1
  },
  {
    "q": "Pak Budi mengajarkan masa Abu Bakar dengan DL. Teknik asesmen yang tepat sesuai dengan lingkungan belajar siswa adalah...",
    "o": [
      "Tes tertulis tertutup.",
      "Asesmen portofolio atau penilaian berbasis proyek.",
      "Tes lisan dadakan.",
      "Kuis pilihan ganda.",
      "Tes hafalan."
    ],
    "a": 1
  },
  {
    "q": "Ibu Rina mengajarkan masa Ali bin Abi Thalib. Instrumen asesmen yang tepat untuk menilai diskusi siswa adalah...",
    "o": [
      "Tes tertulis.",
      "Lembar observasi diskusi kelompok.",
      "Tes lisan.",
      "Soal pilihan ganda.",
      "Tugas merangkum."
    ],
    "a": 1
  },
  {
    "q": "Pak Anwar mengajarkan sejarah Islam di Eropa. Teknik asesmen yang tepat untuk mengukur tujuan pembelajaran adalah...",
    "o": [
      "Tes tertulis.",
      "Penilaian kinerja (presentasi/makalah).",
      "Tes hafalan.",
      "Soal pilihan ganda.",
      "Tes lisan."
    ],
    "a": 1
  },
  {
    "q": "Ibu Wati mengajarkan tokoh ilmuwan di Afrika. Instrumen asesmen yang tepat adalah...",
    "o": [
      "Tes tertulis.",
      "Rubrik penilaian untuk makalah atau laporan riset.",
      "Soal pilihan ganda.",
      "Tes hafalan.",
      "Tes lisan."
    ],
    "a": 1
  },
  {
    "q": "Pak Huda mengajarkan Dinasti Umayyah di Andalusia. Teknik asesmen yang tepat dengan mempertimbangkan hasil asesmen sebelumnya adalah...",
    "o": [
      "Tes standar yang sama untuk semua siswa.",
      "Asesmen diagnostik dilanjutkan dengan penilaian formatif yang disesuaikan.",
      "Tes tertulis.",
      "Kuis lisan.",
      "Tugas merangkum."
    ],
    "a": 1
  },
  {
    "q": "Ibu Dwi mengajarkan Dinasti Umayyah. Instrumen asesmen yang tepat untuk mempertimbangkan hasil awal adalah...",
    "o": [
      "Tes pilihan ganda.",
      "Lembar penilaian diri atau rubrik perkembangan berbasis asesmen awal.",
      "Tes lisan.",
      "Tes hafalan.",
      "Tes tertulis."
    ],
    "a": 1
  },
  {
    "q": "Pak Adi mengajarkan pendidikan karakter. Teknik asesmen yang tepat dengan mempertimbangkan asesmen awal adalah...",
    "o": [
      "Tes tertulis.",
      "Penilaian berbasis kinerja (observasi perilaku).",
      "Kuis lisan.",
      "Soal pilihan ganda.",
      "Tes hafalan."
    ],
    "a": 1
  },
  {
    "q": "Ibu Rika mengajarkan moderasi beragama. Instrumen asesmen yang tepat dengan mempertimbangkan asesmen awal adalah...",
    "o": [
      "Tes tertulis.",
      "Rubrik penilaian sikap atau penilaian antarteman.",
      "Tes hafalan.",
      "Tes lisan.",
      "Soal pilihan ganda."
    ],
    "a": 1
  },
  {
    "q": "Pak Rahmat menyadari materi Hijrah Nabi kurang efektif. Ia melakukan refleksi konten dan teknologi. Praktik baik yang tepat adalah...",
    "o": [
      "Mengganti semua metode dengan ceramah.",
      "Membuat media pembelajaran interaktif berbasis AR (*Augmented Reality*) untuk menggambarkan rute hijrah.",
      "Mengerjakan soal tes lagi.",
      "Menyuruh siswa membaca buku di rumah.",
      "Guru meminta siswa menghafal."
    ],
    "a": 1
  },
  {
    "q": "Ibu Sari merefleksikan pembelajaran Ali bin Abi Thalib. Praktik baik yang tepat adalah...",
    "o": [
      "Menggunakan diskusi konvensional.",
      "Menggunakan model *Case Based Learning* dengan kasus nyata dan media digital.",
      "Tes tertulis.",
      "Ceramah.",
      "Tugas merangkum."
    ],
    "a": 1
  },
  {
    "q": "Pak Budi merefleksikan evaluasi pembelajaran Dinasti Ayyubiyah sesuai karakteristik Gen Z. Praktik baik yang tepat adalah...",
    "o": [
      "Menggunakan tes tertulis.",
      "Menggunakan aplikasi kuis interaktif (*Quizizz/Kahoot*) untuk evaluasi.",
      "Tes lisan.",
      "Tugas makalah.",
      "Ceramah."
    ],
    "a": 1
  },
  {
    "q": "Pak Anwar menunjukkan kemampuan SKI di era digital. Penilaian kemampuan guru sebagai modal pengembangan diri adalah...",
    "o": [
      "Guru hafal buku sejarah.",
      "Guru mampu mengoperasikan *LMS* dan membuat media digital interaktif.",
      "Guru sering berpidato.",
      "Guru memberikan ceramah.",
      "Guru sering memberikan tugas."
    ],
    "a": 1
  },
  {
    "q": "Ibu Rina menggunakan AI untuk SKI. Solusi ilmiah untuk jati diri guru profesional adalah...",
    "o": [
      "Meminta siswa membuat AI sendiri.",
      "Menggunakan AI untuk membuat *personalized learning* bagi siswa dengan gaya belajar berbeda.",
      "Menyuruh siswa memakai HP.",
      "Guru menggunakan komputer.",
      "Meminta siswa membaca internet."
    ],
    "a": 1
  }
]
