[
  {
    "q": "Dalam pelaksanaan materi ajar pembelajaran bahasa dengan model pelayanan konseling, alur materi ajar yang sesuai dengan evaluasi tujuan pembelajaran untuk karakteristik peserta didik adalah…",
    "o": [
      "Memberikan materi bahasa secara individual tanpa melibatkan interaksi sosial.",
      "Mengintegrasikan kegiatan konseling untuk mendalami perasaan dan pola pikir peserta didik dalam memahami materi bahasa.",
      "Menggunakan pendekatan pengajaran yang hanya berfokus pada teknik-teknik berbicara tanpa memperhatikan kondisi peserta didik.",
      "Fokus pada penggunaan media digital dalam pengajaran bahasa tanpa memberi ruang untuk konsultasi pribadi.",
      "Memberikan materi secara grup tanpa memperhatikan kebutuhan pribadi peserta didik."
    ],
    "a": 1
  },
  {
    "q": "Dalam pelaksanaan program Penguatan Profil Pelajar Pancasila (P5), pengembangan materi ajar yang sesuai dengan tujuan pembelajaran yang mencerminkan karakteristik peserta didik adalah…",
    "o": [
      "Menyusun materi ajar yang hanya berfokus pada nilai-nilai akademis tanpa mengintegrasikan nilai Pancasila.",
      "Menggunakan materi ajar yang mengajarkan pentingnya kebebasan individu tanpa memperhatikan nilai-nilai kolektivisme.",
      "Merancang materi ajar yang mengintegrasikan nilai-nilai Pancasila seperti keadilan sosial, toleransi, dan kepedulian terhadap sesama.",
      "Fokus pada pengajaran teori-teori Pancasila tanpa melibatkan peserta didik dalam pengalaman nyata.",
      "Mengabaikan perbedaan karakteristik peserta didik dalam penyampaian nilai-nilai Pancasila."
    ],
    "a": 2
  },
  {
    "q": "Dalam pelaksanaan program Penguatan Profil Pelajar Rahmatan Lil Alamin (PPRA), pengembangan materi ajar yang tepat untuk tujuan pembelajaran sesuai dengan karakteristik peserta didik adalah…",
    "o": [
      "Materi ajar yang mengutamakan kedamaian tanpa dikaitkan dengan praktik kehidupan nyata.",
      "Materi ajar yang hanya berfokus pada sisi akademis.",
      "Materi ajar yang mencakup nilai-nilai universal seperti kasih sayang, toleransi, and saling menghormati.",
      "Materi ajar nilai moral tanpa dikaitkan dengan kehidupan sehari-hari.",
      "Materi ajar yang mengajarkan keunggulan satu agama saja."
    ],
    "a": 2
  },
  {
    "q": "Pengembangan materi ajar nilai-nilai Islam sebagai agama moderat (wasathiyah) yang paling tepat untuk mendukung implementasi moderasi beragama sesuai karakteristik peserta didik adalah…",
    "o": [
      "Materi ajar yang menekankan hafalan dalil tanpa aktivitas reflektif.",
      "Materi ajar yang berfokus pada sejarah konflik antarumat beragama.",
      "Materi ajar yang menitikberatkan penguatan identitas keagamaan secara eksklusif.",
      "Materi ajar kontekstual yang menanamkan toleransi, keadilan, keseimbangan, dan dialog melalui cerita dan contoh nyata.",
      "Materi ajar yang tidak mempertimbangkan realitas sosial peserta didik."
    ],
    "a": 3
  },
  {
    "q": "Dalam pembelajaran hubungan takdir dan iman kepada hari akhir yang materinya kurang relevan dengan perkembangan zaman, strategi pembelajaran yang paling tepat untuk menciptakan suasana belajar yang membahagiakan adalah…",
    "o": [
      "Problem Based Learning.",
      "Project Based Learning.",
      "Discovery Based Learning.",
      "Differentiated Based Learning.",
      "Inquiry Based Learning."
    ],
    "a": 3
  },
  {
    "q": "Pendekatan pembelajaran yang paling tepat untuk mengajarkan konsep mu’jizat, karamah, dan sihir dengan mempertimbangkan perbedaan gaya belajar siswa adalah…",
    "o": [
      "Siswa membaca buku lalu menjawab soal esai.",
      "Guru memberikan tes objektif tertulis.",
      "Memberi tugas berbasis proyek sesuai minat siswa.",
      "Menugaskan siswa membuat laporan tertulis.",
      "Memberikan tugas individual tertulis."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran pembentukan akhlak karimah berbasis diferensiasi, strategi yang paling sesuai adalah…",
    "o": [
      "Semua siswa membuat mind map yang sama.",
      "Siswa mengerjakan tugas individu tanpa diskusi.",
      "Memberi pilihan tugas sesuai gaya belajar siswa.",
      "Menyuruh siswa membaca dan merangkum.",
      "Menyuruh siswa menulis ringkasan."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran dengan materi jenis-jenis permainan edukatif, rancangan pembelajaran berbasis perbedaan individu yang sesuai adalah…",
    "o": [
      "Menggunakan satu jenis permainan untuk semua peserta didik.",
      "Merancang kegiatan yang mengakomodasi berbagai jenis permainan sesuai minat dan tingkat perkembangan anak.",
      "Menyediakan permainan yang hanya fokus pada keterampilan motorik.",
      "Menggunakan permainan yang hanya menekankan akademik.",
      "Membatasi pilihan permainan edukatif."
    ],
    "a": 1
  },
  {
    "q": "Pendekatan yang paling tepat untuk menciptakan lingkungan belajar adaptif pada materi perkembangan kepemimpinan Islam yang kurang relevan dengan konteks masa kini adalah…",
    "o": [
      "Mahasiswa membuat analisis perkembangan kepemimpinan Islam dan membandingkannya dengan masa kini.",
      "Guru menjelaskan tokoh kepemimpinan masa lalu.",
      "Mahasiswa menulis biografi tokoh Islam.",
      "Mahasiswa membuat mindmap kepemimpinan Islam.",
      "Mahasiswa mendengarkan podcast sejarah Islam."
    ],
    "a": 0
  },
  {
    "q": "Strategi pembelajaran yang tepat agar nilai karakter dipahami secara kontekstual dalam materi pendidikan nilai atau karakter adalah…",
    "o": [
      "Guru memberikan tes formatif.",
      "Mahasiswa menyalin kutipan nilai karakter.",
      "Mahasiswa membuat slogan karakter.",
      "Mahasiswa membuat poster nilai karakter.",
      "Mahasiswa mengamati perilaku sosial dan menulis laporan."
    ],
    "a": 4
  },
  {
    "q": "Seorang guru merancang tujuan pembelajaran dengan indikator 'Peserta didik dapat meningkatkan keimanan dan ketakwaan melalui sikap jujur, amanah, dan rendah hati'. Rumusan tujuan pembelajaran ranah sikap yang paling sesuai adalah…",
    "o": [
      "Siswa dapat menjelaskan makna jujur, amanah, dan rendah hati dalam kehidupan.",
      "Siswa menunjukkan sikap jujur, amanah, dan rendah hati dalam kehidupan sehari-hari.",
      "Peserta didik dapat menganalisis keterkaitan antara pernikahan dini, pendidikan, dan kesejahteraan sosial.",
      "Peserta didik dapat membedakan sikap baik dan buruk dalam kehidupan sosial.",
      "Peserta didik memahami pentingnya keimanan dan ketakwaan dalam kehidupan beragama."
    ],
    "a": 1
  },
  {
    "q": "Guru ingin menilai perkembangan anak berdasarkan kegiatan bermain tematik dengan menyusun catatan harian tentang cara anak menyelesaikan tugas dan berinteraksi. Rumusan tujuan pengetahuan yang paling sesuai untuk menumbuhkan berpikir kritis adalah…",
    "o": [
      "Anak mampu menyebutkan nama permainan tematik.",
      "Anak mampu menjelaskan kembali pengalaman bermainnya.",
      "Anak mampu menganalisis cara menyelesaikan tugas saat bermain.",
      "Anak mampu menghafal aturan permainan.",
      "Anak mampu meniru perilaku teman."
    ],
    "a": 2
  },
  {
    "q": "Dalam kegiatan bermain membangun rumah-rumahan dengan balok, instrumen asesmen yang paling sesuai untuk menilai sikap, pengetahuan, dan keterampilan anak adalah…",
    "o": [
      "Lembar tugas tertulis setelah kegiatan bermain.",
      "Hasil akhir bangunan sebagai indikator utama.",
      "Catatan anekdot hasil pengamatan selama anak bermain.",
      "Daftar cek jumlah balok yang digunakan.",
      "Rubrik formal tanpa menyesuaikan konteks bermain."
    ],
    "a": 2
  },
  {
    "q": "Dalam pengembangan materi tentang konsep bermain sebagai metode pembelajaran utama di PAUD, prinsip pengembangan materi ajar yang paling tepat adalah…",
    "o": [
      "Menjadikan bermain sebagai kegiatan selingan.",
      "Mengintegrasikan bermain secara terstruktur untuk mendukung perkembangan anak.",
      "Memfokuskan pada teori bermain.",
      "Menggantikan bermain dengan teknologi.",
      "Menekankan aspek akademik semata."
    ],
    "a": 1
  },
  {
    "q": "Dalam kasus pelaksanaan pembelajaran berbasis proyek pada anak usia dini, strategi penilaian yang paling tepat untuk menilai proses dan hasil belajar anak adalah…",
    "o": [
      "Tes tertulis pilihan ganda.",
      "Penilaian portofolio dan observasi selama kegiatan.",
      "Ujian lisan di akhir pembelajaran.",
      "Penilaian hasil akhir saja.",
      "Penilaian berdasarkan kecepatan menyelesaikan tugas."
    ],
    "a": 1
  },
  {
    "q": "Guru RA menerapkan pendekatan Problem Based Learning (PBL). Prinsip perumusan tujuan pembelajaran yang paling tepat sesuai perkembangan anak usia dini adalah…",
    "o": [
      "Menekankan penguasaan konsep abstrak.",
      "Mengaitkan tujuan pembelajaran dengan pengalaman nyata anak.",
      "Berorientasi pada hasil akhir.",
      "Disusun seragam untuk semua anak.",
      "Fokus pada kemampuan akademik."
    ],
    "a": 1
  },
  {
    "q": "Dalam pelaksanaan tujuan pembelajaran dengan pendekatan Project Based Learning (PjBL), indikator yang paling tepat untuk menumbuhkan semangat gotong royong anak adalah…",
    "o": [
      "Anak mampu menyelesaikan tugas secara mandiri.",
      "Anak mampu bekerja sama dan berbagi peran dalam proyek.",
      "Anak mampu menghafal langkah proyek.",
      "Anak mampu menjawab pertanyaan guru.",
      "Anak mampu menyebutkan hasil proyek."
    ],
    "a": 1
  },
  {
    "q": "Dalam asesmen autentik berbasis observasi dan portofolio di PAUD, rancangan pembelajaran yang paling tepat adalah…",
    "o": [
      "Guru menilai anak melalui tes akhir.",
      "Guru menggunakan hasil observasi dan portofolio untuk merancang kegiatan lanjutan.",
      "Guru membandingkan hasil belajar anak.",
      "Guru menilai berdasarkan kecepatan tugas.",
      "Guru menggunakan lembar kerja seragam."
    ],
    "a": 1
  },
  {
    "q": "Dalam perencanaan materi ajar dengan pendekatan TPACK, alur materi ajar konsep bermain di PAUD yang paling sesuai adalah…",
    "o": [
      "Bermain sebagai kegiatan tambahan.",
      "Konsep bermain terstruktur untuk mendukung perkembangan anak.",
      "Teori bermain tanpa praktik.",
      "Teknologi menggantikan bermain.",
      "Fokus akademik."
    ],
    "a": 1
  },
  {
    "q": "Dalam pelaksanaan materi ajar dengan pendekatan Deep Learning dalam Kurikulum Merdeka di PAUD, alur materi ajar yang paling sesuai adalah…",
    "o": [
      "Kurikulum seragam tanpa diferensiasi.",
      "Materi ajar yang mengintegrasikan kebebasan belajar sesuai kecepatan dan gaya belajar anak.",
      "Pembelajaran satu arah.",
      "Fokus pengetahuan akademik.",
      "Membatasi pilihan belajar anak."
    ],
    "a": 1
  },
  {
    "q": "Guru mengajarkan fiqih kontemporer dengan mempertimbangkan perbedaan kemampuan digital siswa. Pendekatan pembelajaran yang paling tepat adalah…",
    "o": [
      "Memberikan tugas menulis makalah tanpa diferensiasi.",
      "Guru memberi kuis daring sebagai evaluasi utama.",
      "Mengintegrasikan teknologi dengan pendekatan diferensiasi.",
      "Memberikan tugas individu tanpa diferensiasi.",
      "Memberi soal pilihan ganda."
    ],
    "a": 2
  },
  {
    "q": "Guru ingin mengajarkan hak-hak rakyat dalam perspektif Islam dengan pendekatan pembelajaran mendalam. Strategi yang paling sesuai adalah…",
    "o": [
      "Siswa menyusun ringkasan materi dari buku teks.",
      "Menyuruh siswa membaca artikel lalu menjawab soal.",
      "Menganalisis isu sosial melalui kajian tematik.",
      "Menggunakan metode ceramah saja.",
      "Memberikan latihan tertulis."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran perkembangan kepemimpinan Islam yang disampaikan secara normatif, rancangan pembelajaran berbasis pembelajaran mendalam yang paling tepat adalah…",
    "o": [
      "Guru menjelaskan tokoh kepemimpinan masa lalu.",
      "Mahasiswa menulis biografi tokoh Islam.",
      "Mengembangkan refleksi kritis terhadap nilai-nilai kepemimpinan.",
      "Mahasiswa membuat mindmap kepemimpinan Islam.",
      "Mahasiswa mendengarkan podcast sejarah Islam."
    ],
    "a": 2
  },
  {
    "q": "Guru ingin mengajarkan nilai karakter Islam dengan pendekatan pembelajaran mendalam berbasis teknologi. Strategi yang paling tepat adalah…",
    "o": [
      "Guru memberikan ceramah dan tugas evaluasi akhir.",
      "Memberikan tugas hafalan.",
      "Mengaitkan nilai karakter dengan kehidupan nyata.",
      "Memberikan penugasan hafalan.",
      "Memberi tugas membaca dan mencatat."
    ],
    "a": 2
  },
  {
    "q": "Guru ingin mengajarkan Islam sebagai agama moderat dengan pendekatan TPACK. Strategi pembelajaran yang paling tepat adalah…",
    "o": [
      "Siswa membuat presentasi tanpa diskusi reflektif.",
      "Siswa menjawab soal pilihan ganda.",
      "Menggunakan teknologi untuk pembelajaran reflektif.",
      "Mengandalkan ceramah tanpa interaksi.",
      "Menilai hafalan siswa semata."
    ],
    "a": 2
  },
  {
    "q": "Materi kajian tafsir dianggap kurang relevan dengan isu kekinian. Strategi pembelajaran berpendekatan PBL yang paling tepat adalah…",
    "o": [
      "Menggunakan metode ceramah tanpa partisipasi aktif.",
      "Memperkenalkan proyek yang mendorong siswa memecahkan masalah kontekstual.",
      "Menyajikan materi hafalan semata.",
      "Memberikan tugas rangkuman teks.",
      "Menggunakan pendekatan satu arah."
    ],
    "a": 1
  },
  {
    "q": "Materi pentingnya stimulasi sesuai tahap pertumbuhan anak usia dini kurang relevan dengan perkembangan zaman. Strategi PBL yang paling tepat adalah…",
    "o": [
      "Menggunakan metode tradisional tanpa eksplorasi.",
      "Memperkenalkan proyek kolaboratif untuk eksplorasi langsung.",
      "Membatasi anak pada hafalan.",
      "Menyajikan materi teoritis semata.",
      "Menggunakan pendekatan individual tanpa kerja sama."
    ],
    "a": 1
  },
  {
    "q": "Materi aspek kognitif, sosial-emosional, bahasa, motorik, dan nilai agama PAUD kurang relevan dengan perkembangan zaman. Strategi PjBL yang paling tepat adalah…",
    "o": [
      "Fokus pada hafalan.",
      "Menggunakan proyek kolaboratif yang mengembangkan keterampilan dan nilai moral.",
      "Metode ceramah satu arah.",
      "Materi kaku dan tidak kontekstual.",
      "Mengabaikan kebutuhan sosial-emosional anak."
    ],
    "a": 1
  },
  {
    "q": "Materi jenis-jenis permainan edukatif kurang sesuai dengan perkembangan zaman. Model pembelajaran berpendekatan Deep Learning yang paling tepat adalah…",
    "o": [
      "Menggunakan permainan tradisional tanpa teknologi.",
      "Memanfaatkan teknologi digital agar anak bermain sambil belajar.",
      "Membatasi permainan edukatif lama.",
      "Tidak melibatkan anak secara aktif.",
      "Fokus pada teori permainan."
    ],
    "a": 1
  },
  {
    "q": "Materi strategi guru dalam menciptakan lingkungan bermain kurang sesuai dengan perkembangan zaman. Model pembelajaran berpendekatan TPACK yang paling tepat adalah…",
    "o": [
      "Tidak melibatkan teknologi.",
      "Menggunakan teknologi untuk merancang lingkungan bermain holistik and adaptif.",
      "Mengandalkan metode tradisional.",
      "Menggunakan teknologi hanya untuk hiburan.",
      "Fokus pada peralatan fisik saja."
    ],
    "a": 1
  },
  {
    "q": "Materi konsep Kurikulum Merdeka dalam konteks PAUD dinilai kurang sesuai dengan perkembangan zaman. Model pembelajaran berbasis pelayanan bimbingan konseling yang paling tepat adalah…",
    "o": [
      "Menggunakan materi kaku tanpa memperhatikan perkembangan zaman.",
      "Memanfaatkan bimbingan konseling untuk dukungan emosional dan sosial agar pembelajaran lebih progresif.",
      "Menggunakan metode ceramah tanpa interaksi.",
      "Penilaian hanya berfokus pada aspek akademik.",
      "Model pembelajaran tanpa peran bimbingan konseling."
    ],
    "a": 1
  },
  {
    "q": "Dalam kelas PAI terdapat mahasiswa dengan kebutuhan khusus. Pendekatan pembelajaran yang paling tepat agar seluruh mahasiswa dapat mengakses pembelajaran secara optimal adalah…",
    "o": [
      "Menempatkan mahasiswa berkebutuhan khusus di kelompok terpisah.",
      "Menyediakan modul alternatif sesuai kebutuhan belajar.",
      "Memberikan waktu tambahan mengerjakan tugas.",
      "Memberikan materi yang sama kepada semua mahasiswa.",
      "Memberikan materi cetak untuk semua mahasiswa."
    ],
    "a": 1
  },
  {
    "q": "Materi perkembangan kepemimpinan Islam dianggap kurang relevan dengan konteks masa kini. Strategi pembelajaran yang paling tepat agar pembelajaran adaptif adalah…",
    "o": [
      "Mahasiswa membuat analisis perkembangan kepemimpinan Islam dan membandingkannya dengan masa kini.",
      "Guru menjelaskan tokoh kepemimpinan masa lalu.",
      "Mahasiswa menulis biografi tokoh Islam.",
      "Mahasiswa membuat mindmap kepemimpinan Islam.",
      "Mahasiswa mendengarkan podcast sejarah Islam."
    ],
    "a": 0
  },
  {
    "q": "Materi pendidikan nilai atau karakter dianggap terlalu normatif. Strategi pembelajaran yang tepat agar mahasiswa memahami nilai karakter secara kontekstual adalah…",
    "o": [
      "Guru memberikan tes formatif tentang nilai karakter.",
      "Mahasiswa menyalin kutipan nilai karakter.",
      "Mahasiswa membuat slogan karakter.",
      "Mahasiswa membuat poster nilai karakter.",
      "Mahasiswa mengamati perilaku sosial dan menulis laporan."
    ],
    "a": 4
  },
  {
    "q": "Materi Islam sebagai agama moderat disampaikan secara satu arah. Pendekatan pembelajaran yang paling tepat agar mahasiswa terlibat aktif adalah…",
    "o": [
      "Mahasiswa membuat makalah sejarah moderasi Islam.",
      "Diskusi dialogis dan reflektif berbasis kasus.",
      "Guru menyampaikan ceramah panjang.",
      "Mahasiswa menghafal konsep moderasi.",
      "Mahasiswa membaca buku teks."
    ],
    "a": 1
  },
  {
    "q": "Materi implementasi moderasi beragama di Indonesia kurang sesuai dengan perkembangan zaman. Pendekatan pembelajaran yang relevan untuk menciptakan suasana belajar yang membahagiakan adalah…",
    "o": [
      "Materi moderasi yang tidak relevan dengan konteks modern.",
      "Mengabaikan moderasi beragama.",
      "Fokus pada satu pandangan agama.",
      "Tanpa ruang diskusi.",
      "Dialog dan pemahaman lintas agama."
    ],
    "a": 4
  },
  {
    "q": "Materi pendidikan nilai atau karakter kurang sesuai dengan perkembangan zaman. Pendekatan pembelajaran yang relevan untuk menciptakan lingkungan belajar progresif adalah…",
    "o": [
      "Ceramah kaku tanpa keterlibatan aktif.",
      "Pendekatan berbasis proyek melalui pengalaman langsung.",
      "Materi tidak relevan dengan tantangan zaman.",
      "Fokus akademik semata.",
      "Tanpa penekanan nilai karakter."
    ],
    "a": 1
  },
  {
    "q": "Materi implementasi nilai moderasi beragama membutuhkan pembelajaran yang bermakna. Strategi yang paling tepat adalah…",
    "o": [
      "Tes tertulis tentang moderasi beragama.",
      "Menghafal definisi moderasi.",
      "Studi kasus dan diskusi kontekstual.",
      "Ceramah satu arah.",
      "Ringkasan materi buku."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran PAI berbasis teknologi, guru aktif mengembangkan diri dan melakukan refleksi. Penilaian yang paling tepat untuk menggambarkan praktik tersebut adalah…",
    "o": [
      "Guru menggunakan teknologi tanpa refleksi.",
      "Guru menunjukkan pemanfaatan teknologi dan komunitas profesional.",
      "Guru fokus pada satu platform digital.",
      "Guru menyeimbangkan materi dan teknologi tanpa refleksi.",
      "Guru mengikuti tren digital."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran berbasis AI, sebagian siswa kurang fokus pada isi materi. Tindakan profesional guru yang paling tepat adalah…",
    "o": [
      "Mengganti video dengan teks.",
      "Menyisipkan pertanyaan reflektif di sela video.",
      "Mengalihkan AI ke mata pelajaran lain.",
      "Mengurangi media visual.",
      "Menghentikan penggunaan AI."
    ],
    "a": 1
  },
  {
    "q": "Materi pembelajaran PAI dinilai kurang relevan dengan tantangan global. Pendekatan pembelajaran yang paling tepat untuk menumbuhkan wawasan kebangsaan dan keislaman adalah…",
    "o": [
      "Ceramah satu arah tentang nasionalisme.",
      "Menghafal ayat dan hadis tentang persatuan.",
      "Diskusi kontekstual tentang isu kebangsaan dalam perspektif Islam.",
      "Membaca buku teks tanpa refleksi.",
      "Tes tertulis pilihan ganda."
    ],
    "a": 2
  },
  {
    "q": "Guru PAI ingin menanamkan nilai toleransi antarumat beragama secara bermakna. Strategi pembelajaran yang paling tepat adalah…",
    "o": [
      "Memberikan ceramah tentang toleransi.",
      "Menugaskan siswa menghafal definisi toleransi.",
      "Studi kasus dan dialog antar siswa tentang keberagaman.",
      "Memberikan soal latihan tertulis.",
      "Menyuruh siswa membaca buku paket."
    ],
    "a": 2
  },
  {
    "q": "Materi sejarah perkembangan Islam di Indonesia sering dianggap membosankan. Model pembelajaran yang paling tepat agar siswa aktif dan berpikir kritis adalah…",
    "o": [
      "Metode ceramah disertai catatan.",
      "Diskusi kelompok berbasis sumber sejarah.",
      "Membaca teks sejarah secara mandiri.",
      "Menghafal kronologi peristiwa.",
      "Menonton video tanpa diskusi."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran PAI berbasis proyek, guru ingin menilai sikap kolaboratif siswa. Teknik penilaian yang paling tepat adalah…",
    "o": [
      "Tes tertulis.",
      "Penilaian hasil akhir proyek saja.",
      "Observasi proses kerja kelompok.",
      "Penilaian kecepatan menyelesaikan tugas.",
      "Ulangan harian."
    ],
    "a": 2
  },
  {
    "q": "Guru ingin mengintegrasikan nilai akhlak mulia dalam pembelajaran sehari-hari. Strategi yang paling efektif adalah…",
    "o": [
      "Memberikan hukuman pada siswa yang melanggar.",
      "Menyampaikan ceramah tentang akhlak.",
      "Menjadi teladan dan membiasakan perilaku baik.",
      "Memberikan tugas hafalan.",
      "Mengadakan tes tertulis."
    ],
    "a": 2
  },
  {
    "q": "Materi fiqih muamalah dikaitkan dengan aktivitas ekonomi modern. Pendekatan pembelajaran yang paling tepat adalah…",
    "o": [
      "Menghafal dalil fiqih muamalah.",
      "Membaca buku teks fiqih klasik.",
      "Analisis kasus praktik ekonomi modern dalam perspektif fiqih.",
      "Ceramah satu arah.",
      "Latihan soal pilihan ganda."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran PAI berbasis teknologi, guru ingin memastikan pembelajaran tetap bermakna. Prinsip utama yang harus diperhatikan adalah…",
    "o": [
      "Teknologi sebagai tujuan utama.",
      "Penggunaan teknologi tanpa perencanaan.",
      "Teknologi sebagai alat untuk mencapai tujuan pembelajaran.",
      "Menggunakan sebanyak mungkin aplikasi.",
      "Mengikuti tren digital terbaru."
    ],
    "a": 2
  },
  {
    "q": "Guru PAI menerapkan pembelajaran diferensiasi. Tujuan utama penerapan pendekatan tersebut adalah…",
    "o": [
      "Menyamakan kemampuan seluruh siswa.",
      "Memberikan perlakuan berbeda tanpa tujuan.",
      "Memenuhi kebutuhan belajar siswa yang beragam.",
      "Menyederhanakan materi.",
      "Mempercepat penyelesaian kurikulum."
    ],
    "a": 2
  },
  {
    "q": "Materi moderasi beragama diharapkan membentuk sikap terbuka dan adil. Indikator pencapaian tujuan pembelajaran yang paling tepat adalah…",
    "o": [
      "Siswa mampu menghafal konsep moderasi beragama.",
      "Siswa mampu menjelaskan definisi moderasi.",
      "Siswa menunjukkan sikap saling menghargai dalam keberagaman.",
      "Siswa mampu menjawab soal pilihan ganda.",
      "Siswa menuliskan rangkuman materi."
    ],
    "a": 2
  },
  {
    "q": "Dalam evaluasi pembelajaran PAI, guru ingin menilai pemahaman, sikap, dan keterampilan secara menyeluruh. Bentuk penilaian yang paling tepat adalah…",
    "o": [
      "Tes tertulis saja.",
      "Ulangan harian.",
      "Asesmen autentik yang menggabungkan observasi, tugas, dan refleksi.",
      "Penilaian hasil akhir saja.",
      "Tes lisan singkat."
    ],
    "a": 2
  }
]
