[
  {
    "q": "Disajikan deskripsi materi tentang pembentuka akhlak karimah, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah sikap yang paling sesuai dengan indikator tujuan supaya peserta didik dapat meningkatkan keimanan, ketakwaan dan akhlak mulia.\n\nBu Siti, seorang guru PAl di kelas XI, akan menyelenggarakan pembelajaran dengan materi \"Meneladani Akhlak Mulia Nabi Muhammad SAW dalam Kehidupan Sosial\".\n\nUntuk menyajikan konten secara menarik dan kontekstual, Bu Siti berencana menayangkan sebuah video dokumenter pendek dari platform edukasi yang menampilkan kisah Rasulullah SAW dalam memedikan perselisihan antar suku di Madinah (peristiwa Hudaibiyah).\n\nSetelah menonton, Bu Siti akan memandu diskusi kelompok melalui forum daring di Google Classroom, di mana setiap kelompok diminta mengidentifikasi nilai-nilai akhlak (seperti sabar, adil, dan pemurah) dari video dan mengaitkannya dengan kasus bullying yang sering terjadi di lingkungan sekolah.\n\nBerdasarkan deskripsi skenario pembelajaran yang mengintegrasikan teknologi di atas, rumusan tujuan pembelajaran ranah sikap yang paling tepat untuk mencapai indikator \"peserta didik dapat meningkatkan keimanan, ketakwaan, dan akhlak mulia\" adalah....",
    "o": [
      "Melalui pemutaran video dan diskusi daring, peserta didik mampu menjelaskan tiga contoh akhlak mulia Nabi Muhammad SAW yang ditunjukkan dalam peristiwa Hudaibiyah.",
      "Setelah mengamati video dan berdiskusi, peserta didik dapat menunjukkan sikap sabar dan adil dalam menyelesaikan konflik dengan teman sebagai implementasi dari meneladani akhlak Nabi.",
      "Peserta didik terampil menggunakan fitur Google Classroom untuk mengunggah hasil analisis nilai-nilai akhlak dari video yang ditayangkan guru.",
      "Peserta didik memiliki kesadaran penuh akan pentingnya meneladani akhlak Nabi Muhammad SAW setelah mempelajari materi melalui video dan diskusi kelompok.",
      "Dengan berbekal video dan forum diskusi, peserta didik mampu menganalisis dampak positif penerapan akhlak mulia terhadap terciptanya lingkungan sekolah yang bebas dari bullying."
    ],
    "a": 1
  },
  {
    "q": "Disajikan narasi materi tentang kasus pernikahan, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan indikator supaya peserta didik mampu berpikir kritis.\n\nPak Ahmad, guru PAI kelas XII, akan memulai pembelajaran Fikih tentang \"Hikmah dan Ketentuan Walimahan\".\n\nUntuk menghindari pembelajaran yang bersifat monoton dan mengasah kemampuan berpikir kritis, ia tidak langsung memberikan materi dari buku teks.\n\nSebaliknya, Pak Ahmad membagikan sebuah narasi kasus digital kepada setiap kelompok melalui platform Google Classroom.\n\nNarasi tersebut menceritakan sepasang calon pengantin, Rizki dan Siti, yang dihadapkan pada permintaan orang tua Siti untuk menyelenggarakan walimahan yang mewah dan melebihi kemampuan finansial mereka, dengan dalih untuk menjaga \"harga diri keluarga\".\n\nMengacu pada skenario pembelajaran yang dirancang oleh Pak Ahmad, rumusan tujuan pembelajaran ranah pengetahuan (kognitif) yang paling sesuai untuk mengukur keberhasilan peserta didik dalam mencapai indikator \"mampu berpikir kritis\" adalah....",
    "o": [
      "Setelah mempelajari kasus Rizki dan Siti, peserta didik dapat menyebutkan minimal tiga hikmah dari pelaksanaan walimahan dalam Islam.",
      "Melalui kajian kasus digital, peserta didik mampu menjelaskan perbedaan antara walimahan yang disunnahkan dan yang tergolong israf (berlebih-lebihan) menurut syariat.",
      "Berdasarkan narasi kasus dan referensi digital, peserta didik dapat menganalisis konflik antara tuntutan adat dan prinsip syariat dalam kasus walimahan serta merumuskan solusi yang paling relevan.",
      "Peserta didik menunjukkan sikap bijaksana dalam menanggapi perbedaan pendapat mengenai pelaksanaan walimahan setelah mendiskusikan kasus yang diberikan.",
      "Peserta didik terampil mengidentifikasi sumber-sumber digital yang kredibel untuk digunakan sebagai landasan argumentasi dalam studi kasus fikih."
    ],
    "a": 2
  },
  {
    "q": "Disajikan pernyataan materi tentang kriteria hadis shalih, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai dengan indikator supaya peserta didik memiliki semangat gotong royong.\n\nBu Ratna, guru PAI di MA Kelas XI, menyadari bahwa materi \"Kriteria Hadis Shalih\" sering kali dianggap abstrak dan kurang menarik bagi peserta didik.\n\nUntuk mengatasi ini, ia merancang pembelajaran berbasis proyek kolaboratif. la membagi kelas menjadi beberapa kelompok dan menugaskan setiap kelompok untuk membuat satu infografis digital yang menjelaskan kelima kriteria hadis shalih (sanad bersambung, diriwayatkan oleh rawi 'adil dan dhabit, tidak syadz, dan tidak 'illah).\n\nSetiap kelompok dimengerjakan proyek ini di atas satu kanvas digital bersama (seperti Padlet atau Jamboard).\n\nBerdasarkan skenario pembelajaran yang dirancang oleh Bu Ratna, rumusan tujuan pembelajaran ranah keterampilan (psikomotorik) yang paling sesuai untuk mencapai indikator \"supaya peserta didik memiliki semangat gotong royong\" adalah....",
    "o": [
      "Melalui diskusi kelompok, peserta didik mampu menjelaskan kembali kelima kriteria hadis shalih dengan menggunakan bahasa mereka sendiri.",
      "Setelah mengerjakan proyek, peserta didik menumbuhkan rasa hormat dan apresiasi terhadap pendapat teman saat menyusun infografis bersama.",
      "Peserta didik terampil mengoperasikan fitur-fitur utama pada aplikasi kanvas digital (Padlet/Jamboard) untuk membuat infografis secara individu.",
      "Melalui tugas kelompok, peserta didik dapat membuat infografis digital tentang kriteria hadis shalih dengan membagi tugas dan menggabungkan hasil kerja menjadi satu produk utuh.",
      "Peserta didik mampu mengevaluasi keabsahan sebuah hadis palsu dengan merujuk pada kriteria hadis shalih yang telah mereka pelajari."
    ],
    "a": 3
  },
  {
    "q": "Disajikan deskripsi kasus pengembangan materi tentang takdir seseorang, mahasiswa dapat menentukan rumusan indikat tujuan pembelajaran ranah sikap yang paling sesuai dengan materi supaya peserta didik memiliki sikap penerimaan terhadap tradisi\n\nPak Budi, guru PAI di kelas XII, menghadapi tantangan peserta didik yang kerap kali memandang tradisi lokal sebagai sesuatu yang kuno atau bahkan bertentangan dengan ajaran Islam.\n\nUntuk materi \"Menyikapi Takdir dengan Ikhtiar dan Tawakal\", ia merancang pembelajaran yang reflektif.\n\nPak Budi menayangkan sebuah video dokumenter pendek tentang komunitas nelayan di pesisir Jawa yang melakukan tradisi \"selamatan laut\" sebelum melaut.\n\nVideo tersebut tidak hanya menampilkan ritualnya, tetapi juga narasi dari sesepuh desa yang menjelaskan bahwa tradisi itu adalah wujud tawakal dan penyerahan diri kepada Allah Sang Penguasa laut setelah mereka melakukan ikhtiar dengan memperbaiki perahu dan jala.\n\nMengacu pada skenario pembelajaran yang dirancang oleh Pak Budi, rumusan tujuan pembelajaran ranah sikap (afektif) yang paling sesuai untuk mencapai indikator \"supaya peserta didik memiliki sikap penerimaan terhadap tradisi\" adalah....",
    "o": [
      "Setelah mengamati video, peserta didik mampu menjelaskan kembali hubungan antara konsep ikhtiar, tawakal, dan pelaksanaan tradisi selamatan laut.",
      "Peserta didik menceritakan kembali secara lisan proses dan makna simbolis dari setiap tahapan dalam tradisi selamatan laut yang ditampilkan dalam video.",
      "Melalui tayangan video dan diskusi, peserta didik menghargai tradisi lokal sebagai bentuk ekspresi budaya dari keyakinan akan takdir, selama tidak bertentangan dengan syariat.",
      "Peserta didik menunjukkan rasa ingin tahu yang tinggi dengan mencari informasi lebih lanjut tentang berbagai macam tradisi lain di Indonesia yang terkait dengan penyikapan terhadap takdir.",
      "Peserta didik menganalisis dampak sosial-ekonomi dari tradisi selamatan laut bagi kehidupan komunitas nelayan yang ditayangkan dalam video."
    ],
    "a": 2
  },
  {
    "q": "Berdasarkan kisi-kisi soal UP PPG Tahun 2025 (Page 2), topik apa yang dibahas dalam dokumen ini?",
    "o": [
      "Soal-soal Uji Pengetahuan (UP) PPG untuk mata pelajaran Bahasa Arab.",
      "Pembahasan soal Uji Pengetahuan (UP) PPG mata pelajaran PAI.",
      "Kisi-kisi soal Uji Pengetahuan (UP) PPG untuk semua mata pelajaran.",
      "Materi pembelajaran mandiri untuk peserta PPG.",
      "Panduan teknis pelaksanaan Uji Pengetahuan PPG."
    ],
    "a": 1
  },
  {
    "q": "Menurut dokumen, apa yang dimaksud dengan Technological Pedagogical and Content Knowledge (TPACK)? (Page 7)",
    "o": [
      "Metode pengajaran hanya menggunakan teknologi digital.",
      "Kerangka kerja konseptual yang membantu pendidik mengintegrasikan teknologi secara efektif ke dalam pembelajaran.",
      "Sistem penilaian otomatis berbasis kecerdasan buatan.",
      "Kurikulum baru yang berfokus pada ilmu komputer.",
      "Strategi pengelolaan kelas menggunakan platform media sosial."
    ],
    "a": 1
  },
  {
    "q": "Berikut ini yang merupakan Kata Kerja Operasional (KKO) untuk ranah Kognitif 'Menganalisis' (C4) menurut tabel di dokumen adalah...",
    "o": [
      "Menyebutkan, Mengutip, Menyatakan.",
      "Menjelaskan, Menceritakan, Memperkirakan.",
      "Menugaskan, Mengaudit, Membandingkan.",
      "Menggambar, Menerapkan, Mengkatagorikan.",
      "Memecahkan, Memprediksi, Menganalisis."
    ],
    "a": 2
  },
  {
    "q": "Berikut ini yang merupakan Kata Kerja Operasional (KKO) untuk ranah Psikomotorik 'Artikulasi' (P4) menurut tabel di dokumen adalah...",
    "o": [
      "Menirukan, Mengaktifkan, Menyesuaikan.",
      "Memanipulasi, Mendemonstrasikan, Melatih.",
      "Pengalamiahan, Mengalihkan, Menggantikan.",
      "Artikulasi, Mempertajam, Memadankan.",
      "Mengoreksi, Menyetir, Merancang."
    ],
    "a": 3
  },
  {
    "q": "Disajikan pernyataan praktik pedagogi tentang perencanaan materi ajar pembentukan akhlak karimah secara logis dengan pendekatan TPACK, mahasiswa dapat menentukan alur materi ajar pembentukan akhlak karimah sebagai pilar pengembangan karakter bangsa dalam perencanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik\n\nPak Budi, guru PAI kelas VII, akan memulai pembelajaran tentang \"Kejujuran sebagai Fondasi Akhlak\".\n\nTujuannya adalah agar peserta didik memahami secara mendalam mengapa kejujuran itu penting, bukan hanya sekadar tahu definisinya.\n\nIa berencana menggunakan teknologi untuk membuat pembelajaran menarik. Pak Budi sedang mempertimbangkan langkah apa yang harus dilakukan terlebih dahulu.\n\nBerdasarkan tujuan pembelajaran untuk membangun pemahaman mendalam, langkah awal yang paling tepat dan logis untuk dilakukan oleh Pak Budi sesuai dengan prinsip perencanaan pembelajaran berbasis TPACK adalah....",
    "o": [
      "Menayangkan video animasi singkat yang menggambarkan konsekuensi positif dari kejujuran dan negatif dari kebohongan dalam kehidupan sehari-hari.",
      "Meminta siswa untuk langsung membuat poster digital tentang kampanye anti-kebohongan di media sosial.",
      "Mengajukan kasus etika yang kompleks melalui forum diskusi daring, seperti \"bolehkah berbohong untuk kebaikan?\".",
      "Memberikan daftar ayat Al-Qur'an dan hadis tentang kejujuran untuk dihafal oleh siswa sebagai landasan utama.",
      "Menggunakan aplikasi kamus digital untuk mencari definisi 'kejujuran' dan membuat daftar sinonimnya sebagai pengantar pembelajaran."
    ],
    "a": 0
  },
  {
    "q": "Disajikan pernyataan praktik pedagogi tentang pelaksanaan materi ajar fiqih kontemporer secara logis dengan pendekatan DL, mahasiswa dapat menentukan alur materi ajar tetang fiqih kontemporer dalam pelaksanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik.\n\nPak Rizki akan memulai pembelajaran Fiqih dengan topik \"Etika dan Hukum Jual-Beli Online\" di kelas XI.\n\nIa ingin pembelajaran ini berpusat pada peserta didik dan relevan dengan kehidupan mereka sehari-hari, bukan sekadar transfer teori.\n\nUntuk mencapainya, ia berencana menggunakan pendekatan pembelajaran berbasis masalah (Problem-Based Learning) dan memanfaatkan teknologi.\n\nDari beberapa pilihan kegiatan berikut, langkah awal pelaksanaan pembelajaran yang paling tepat dan logis untuk dilakukan oleh Pak Rizki sesuai dengan tujuannya adalah....",
    "o": [
      "Menayangkan video singkat tentang kasus penipuan online atau barang yang tidak sesuai deskripsi untuk memunculkan masalah.",
      "Menjelaskan langsung di depan kelas tentang syarat sah jual-beli menurut fiqih sebagai landasan teori.",
      "Meminta siswa langsung membuat blog tentang tips berbelanja online yang aman dan sesuai syariat.",
      "Membagi siswa dalam kelompok untuk mencari definisi 'thaman' (harga) dan 'mabi'' (barang) dalam kamus fiqih.",
      "Mengajarkan cara menggunakan fitur keamanan di aplikasi marketplace untuk menghindari penipuan."
    ],
    "a": 0
  },
  {
    "q": "Disajikan pernyataan materi tentang kasus waris, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan indikator supaya peserta didik mampu berpikir kritis.\n\nPak Fathur, guru PAI kelas XII, mengajarkan materi \"Ketentuan Waris dalam Islam\". Ia ingin siswanya tidak hanya menghafal bagian masing-masing ahli waris, tetapi mampu menerapkan hukum waris pada kasus yang kompleks.\n\nIa memberikan sebuah studi kasus digital di mana seorang pewaris meninggalkan harta namun memiliki utang yang besar, serta ada ahli waris yang terhalang (mahjub).\n\nMengacu pada skenario pembelajaran tersebut, rumusan tujuan pembelajaran ranah pengetahuan (kognitif) yang paling sesuai untuk mengukur indikator \"mampu berpikir kritis\" adalah....",
    "o": [
      "Peserta didik mampu menyebutkan daftar ahli waris yang berhak menerima harta warisan berdasarkan al-Qur'an.",
      "Melalui analisis studi kasus, peserta didik dapat menghitung pembagian harta waris secara akurat untuk setiap ahli waris.",
      "Berdasarkan kasus yang diberikan, peserta didik mampu menganalisis implikasi utang pewaris terhadap sisa harta yang akan dibagikan serta merumuskan pembagian yang adil sesuai syariat.",
      "Peserta didik dapat menjelaskan pengertian konsep 'mahjub' dan memberikan contoh ahli waris yang terhalang.",
      "Peserta didik terampil menggunakan kalkulator waris berbasis aplikasi untuk mengecek hasil hitungan manual mereka."
    ],
    "a": 2
  },
  {
    "q": "Disajikan narasi skenario praktik pedagogi tentang perencanaan materi ajar sejarah kebudayaan Islam secara logis dengan pendekatan TPACK, mahasiswa dapat menentukan alur materi ajar sejarah kebudayaan Islam sebagai pilar pengembangan karakter bangsa dalam perencanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik.\n\nBu Shofiyah, guru PAI kelas X, akan mengajarkan materi \"Peradaban Islam pada Masa Bani Umayyah\". Tujuan pembelajarannya adalah agar siswa dapat mengambil ibrah (pelajaran) dari kemajuan dan kemunduran peradaban tersebut.\n\nIa ingin mengintegrasikan teknologi untuk membuat materi sejarah yang cenderung naratif menjadi lebih visual dan interaktif. Langkah awal perencanaan yang paling logis menurut pendekatan TPACK adalah....",
    "o": [
      "Menyusun rubrik penilaian untuk proyek pembuatan video dokumenter pendek tentang sejarah Bani Umayyah.",
      "Memilih dan memilah peta konsep digital serta infografis tentang perkembangan wilayah dan ilmu pengetahuan pada masa Bani Umayyah.",
      "Langsung menugaskan siswa untuk mencari materi di internet dan merangkumnya dalam bentuk makalah.",
      "Membuat soal evaluasi kognitif untuk menguji pemahaman siswa tentang tokoh-tokoh penting Bani Umayyah.",
      "Merancang forum diskusi di media sosial untuk membahas penyebab keruntuhan Bani Umayyah."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi kasus pengembangan materi tentang konsep qada dan qadar, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah sikap yang paling sesuai dengan indikator materi supaya peserta didik memiliki sikap tanggung jawab.\n\nPak Hanif mendapati siswa kelas XII cenderung bersikap fatalistik (pasrah tanpa usaha) setelah mempelajari materi \"Qada dan Qadar\". Mereka beranggapan bahwa semua hasil sudah ditentukan Allah.\n\nUntuk meluruskan pemahaman tersebut, Pak Hanif merancang pembelajaran berbasis diskusi reflektif dengan kasus nyata mengenai seseorang yang gagal dalam ujian karena tidak belajar, lalu menyalahkan takdir.\n\nMengacu pada skenario pembelajaran tersebut, rumusan tujuan pembelajaran ranah sikap (afektif) yang paling sesuai untuk mencapai indikator \"supaya peserta didik memiliki sikap tanggung jawab\" adalah....",
    "o": [
      "Peserta didik mampu menjelaskan perbedaan konsep antara Qada dan Qadar dalam kehidupan sehari-hari.",
      "Melalui diskusi kasus, peserta didik menunjukkan sikap proaktif dalam merencanakan masa depan sebagai bentuk ikhtiar maksimal.",
      "Peserta didik dapat menganalisis hubungan antara usaha manusia dan hasil akhir yang merupakan ketetapan Allah.",
      "Peserta didik mampu memberikan contoh-contoh perilaku tawakal yang benar setelah berikhtiar maksimal.",
      "Peserta didik terampil membuat jurnal refleksi harian tentang tindakan yang menunjukkan pertanggungjawaban atas perbuatannya."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan praktik pedagogi tentang pelaksanaan materi ajar fiqih muamalah secara logis dengan pendekatan DL, mahasiswa dapat menentukan alur materi ajar tetang fiqih muamalah dalam pelaksanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik.\n\nBu Aminah mengajar materi \"Riba dan Lembaga Keuangan Syariah\" di kelas XI. Ia ingin siswa memahami dampak riba dalam ekonomi modern.\n\nIa menggunakan pendekatan *Discovery Learning* (DL). Langkah awal pelaksanaan pembelajaran yang paling tepat dan logis untuk dilakukan oleh Bu Aminah adalah....",
    "o": [
      "Memberikan penjelasan rinci mengenai pengertian dan jenis-jenis riba menurut empat mazhab.",
      "Menampilkan data inflasi dan simulasi bunga bank konvensional dibandingkan bagi hasil bank syariah untuk memancing pertanyaan siswa.",
      "Meminta siswa menghafal dalil-dalil Al-Qur'an yang mengharamkan praktik riba.",
      "Melakukan kuis cepat (pre-test) tentang pengetahuan dasar siswa mengenai perbankan.",
      "Menyuruh siswa membaca buku teks tentang sejarah berdirinya lembaga keuangan syariah di Indonesia."
    ],
    "a": 0
  },
  {
    "q": "Disajikan narasi skenario praktik pedagogi tentang perencanaan materi ajar fikih ibadah secara logis dengan pendekatan TPACK, mahasiswa dapat menentukan alur materi ajar fikih ibadah sebagai pilar pengembangan karakter bangsa dalam perencanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik.\n\nPak Zaenal ingin mengajarkan tata cara \"Shalat Jenazah\" pada kelas X dengan pendekatan TPACK. Ia menyadari bahwa peserta didik jarang mempraktikkan hal ini secara langsung.\n\nUntuk perencanaan awal yang logis, tindakan apa yang harus dilakukan Pak Zaenal?",
    "o": [
      "Mencari simulasi video interaktif yang menunjukkan praktik shalat jenazah dari berbagai sudut pandang (camera angle).",
      "Membuat daftar hadir untuk memastikan semua siswa mengikuti materi shalat jenazah.",
      "Menuliskan semua rukun shalat jenazah di papan tulis.",
      "Meminta siswa membawa perlengkapan shalat dari rumah.",
      "Menyusun soal pilihan ganda tentang jumlah takbir dalam shalat jenazah."
    ],
    "a": 0
  },
  {
    "q": "Disajikan deskripsi materi tentang klasifikasi ayat-ayat Al-Qur'an, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah sikap yang paling sesuai dengan indikator tujuan supaya peserta didik dapat meningkatkan kedisiplinan dan tanggung jawab.\n\nPak Aris mengajarkan materi tentang \"Ayat Makkiyah dan Madaniyah\". Ia ingin nilai kedisiplinan dan tanggung jawab muncul saat siswa mempelajari latar belakang turunnya ayat.\n\nBerdasarkan skenario ini, rumusan tujuan pembelajaran ranah sikap yang paling sesuai adalah....",
    "o": [
      "Peserta didik mampu membedakan ayat Makkiyah dan Madaniyah berdasarkan ciri-ciri fisiknya.",
      "Melalui penugasan mandiri, peserta didik menunjukkan kedisiplinan dalam mengumpulkan analisis ayat tepat waktu dan bertanggung jawab atas hasil kerjanya.",
      "Peserta didik dapat menghafal tiga ayat Makkiyah dan tiga ayat Madaniyah.",
      "Peserta didik mampu menganalisis alasan kenapa ayat tersebut turun di Mekkah atau Madinah.",
      "Peserta didik memiliki pengetahuan tentang sejarah kodifikasi Al-Qur'an."
    ],
    "a": 1
  },
  {
    "q": "Disajikan narasi materi tentang kasus toleransi, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan indikator supaya peserta didik mampu berpikir kritis.\n\nBu Indah menyajikan kasus mengenai konflik antarpemuda karena perbedaan keyakinan di sebuah desa. Ia ingin siswa kelas XI menganalisis kasus tersebut berdasarkan ayat-ayat toleransi dalam Al-Qur'an.\n\nMengacu pada skenario pembelajaran tersebut, rumusan tujuan pembelajaran ranah pengetahuan (kognitif) yang paling sesuai untuk mengukur indikator \"mampu berpikir kritis\" adalah....",
    "o": [
      "Peserta didik dapat menyebutkan dalil Naqli tentang kewajiban toleransi beragama.",
      "Melalui analisis kasus, peserta didik mampu mengevaluasi tindakan yang diambil oleh para pemuda dan mengajukan alternatif solusi yang sesuai dengan prinsip toleransi Islam.",
      "Peserta didik mampu menjelaskan pengertian toleransi secara bahasa dan istilah.",
      "Peserta didik dapat menghafal surat al-Kafirun beserta artinya.",
      "Peserta didik terampil membuat esai tentang pengalaman pribadi berinteraksi dengan teman berbeda agama."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan materi tentang implementasi etika bermedia sosial, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai dengan indikator supaya peserta didik memiliki semangat gotong royong.\n\nPak Eko ingin mengajarkan materi \"Etika Bermedia Sosial menurut Islam\". Ia ingin siswanya bergotong royong membuat panduan etika medsos untuk sekolah.\n\nBerdasarkan skenario ini, rumusan tujuan pembelajaran ranah keterampilan (psikomotorik) yang paling sesuai adalah....",
    "o": [
      "Peserta didik mampu menjelaskan prinsip tabayyun dalam menyikapi berita di media sosial.",
      "Melalui kerja kelompok, peserta didik dapat membuat infografis digital bersama tentang panduan beretika di media sosial.",
      "Peserta didik memiliki pemahaman mendalam tentang bahaya hoaks dan ghibah di dunia maya.",
      "Peserta didik mampu menganalisis dampak negatif media sosial terhadap kesehatan mental.",
      "Peserta didik menunjukkan sikap sopan santun saat berdiskusi di media sosial."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi materi tentang sejarah perkembangan Islam di Indonesia, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah sikap yang paling sesuai dengan indikator supaya peserta didik dapat menghargai budaya lokal.\n\nBu Citra mengajarkan materi \"Masuknya Islam ke Nusantara\". Ia ingin siswanya menghargai peran Wali Songo yang menggunakan pendekatan budaya.\n\nRumusan tujuan pembelajaran ranah sikap yang paling sesuai adalah....",
    "o": [
      "Peserta didik mampu menyebutkan nama-nama Wali Songo beserta wilayah dakwahnya.",
      "Peserta didik dapat menganalisis teori-teori masuknya Islam ke Indonesia.",
      "Melalui pembelajaran kisah Wali Songo, peserta didik menunjukkan sikap menghargai tradisi lokal selama tidak bertentangan dengan ajaran Islam.",
      "Peserta didik mampu menjelaskan sejarah berdirinya kerajaan Islam pertama di Jawa.",
      "Peserta didik terampil membuat peta jalur perdagangan nusantara."
    ],
    "a": 2
  },
  {
    "q": "Disajikan pernyataan materi tentang bahaya narkoba, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai dengan indikator supaya peserta didik memiliki sikap proaktif.\n\nPak Hadi ingin siswanya aktif mencegah penyalahgunaan narkoba di sekolah. Ia menugaskan mereka membuat kampanye kreatif.\n\nRumusan tujuan pembelajaran ranah keterampilan (psikomotorik) yang paling sesuai adalah....",
    "o": [
      "Peserta didik mampu menjelaskan dampak fisiologis penggunaan narkoba bagi tubuh.",
      "Melalui tugas kelompok, peserta didik mampu memproduksi video pendek berisi kampanye anti-narkoba dan mengunggahnya ke media sosial sekolah.",
      "Peserta didik dapat menyebutkan jenis-jenis narkoba dan zat adiktif berdasarkan undang-undang.",
      "Peserta didik mampu menganalisis faktor sosial yang menyebabkan remaja terjerumus narkoba.",
      "Peserta didik menunjukkan rasa tanggung jawab dalam menjaga diri dari bahaya narkoba."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan materi tentang perilaku terpuji, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah sikap yang paling sesuai dengan indikator tujuan supaya peserta didik memiliki rasa ingin tahu yang tinggi.\n\nPak Dedi mengajarkan materi tentang \"Sikap Tawadhu dan Menghindari Sifat Takabur\". Ia ingin siswanya aktif mencari tahu tentang kisah-kisah ulama yang rendah hati.\n\nBerdasarkan skenario ini, rumusan tujuan pembelajaran ranah sikap yang paling sesuai adalah....",
    "o": [
      "Peserta didik mampu menyebutkan pengertian tawadhu secara istilah.",
      "Melalui penugasan studi pustaka, peserta didik menunjukkan rasa ingin tahu yang tinggi dengan mencari dan menceritakan kisah inspiratif tokoh Islam yang menunjukkan perilaku tawadhu.",
      "Peserta didik dapat menganalisis dampak negatif perilaku takabur dalam kehidupan sosial.",
      "Peserta didik mampu membedakan antara tawadhu dan rendah diri.",
      "Peserta didik memiliki keterampilan dalam membuat ringkasan materi pelajaran."
    ],
    "a": 1
  },
  {
    "q": "Disajikan narasi materi tentang kasus perkawinan, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan indikator supaya peserta didik mampu berpikir kritis.\n\nBu Dina menyajikan kasus mengenai pernikahan yang tidak disetujui wali karena perbedaan status sosial, padahal calon suami sekufu dan berakhlak baik. Ia ingin siswa menganalisis hukumnya berdasarkan Fiqih.\n\nMengacu pada skenario pembelajaran tersebut, rumusan tujuan pembelajaran ranah pengetahuan (kognitif) yang paling sesuai untuk mengukur indikator \"mampu berpikir kritis\" adalah....",
    "o": [
      "Peserta didik dapat menyebutkan syarat dan rukun nikah dalam Islam.",
      "Melalui analisis kasus, peserta didik mampu mengevaluasi tindakan wali dan merumuskan argumen hukum tentang kedudukan wali adhal berdasarkan dalil-dalil fikih.",
      "Peserta didik mampu menjelaskan pengertian wali nasab dan wali hakim.",
      "Peserta didik dapat menghafal ayat-ayat tentang perintah untuk menikah.",
      "Peserta didik terampil membuat simulasi akad nikah di kelas."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan materi tentang pengelolaan harta wakaf, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai dengan indikator supaya peserta didik memiliki semangat gotong royong.\n\nPak Fajar ingin mengajarkan materi \"Wakaf dalam Islam\". Ia ingin siswa bekerja sama merencanakan proyek wakaf produktif untuk sekolah.\n\nBerdasarkan skenario ini, rumusan tujuan pembelajaran ranah keterampilan (psikomotorik) yang paling sesuai adalah....",
    "o": [
      "Peserta didik mampu menjelaskan perbedaan wakaf, infak, dan sedekah.",
      "Melalui diskusi kelompok, peserta didik dapat menyusun proposal proyek wakaf produktif sekolah secara kolaboratif.",
      "Peserta didik memiliki pengetahuan tentang rukun dan syarat wakaf.",
      "Peserta didik mampu menganalisis peran wakaf dalam meningkatkan kesejahteraan umat.",
      "Peserta didik menunjukkan sikap jujur dalam mengelola harta wakaf."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi materi tentang perkembangan ilmu pengetahuan masa Islam, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah sikap yang paling sesuai dengan indikator supaya peserta didik dapat meningkatkan kedisiplinan.\n\nBu Irma mengajarkan materi \"Peradaban Islam masa Daulah Abbasiyah\". Ia ingin siswa disiplin dalam mempelajari tokoh-tokoh ilmuwan Muslim.\n\nRumusan tujuan pembelajaran ranah sikap yang paling sesuai adalah....",
    "o": [
      "Peserta didik mampu menyebutkan nama-nama ilmuwan pada masa Abbasiyah.",
      "Peserta didik dapat menganalisis faktor penyebab kemajuan ilmu pengetahuan masa Abbasiyah.",
      "Melalui tugas mandiri, peserta didik menunjukkan kedisiplinan dalam membaca biografi ilmuwan Muslim dan merangkumnya tepat waktu.",
      "Peserta didik mampu menjelaskan sejarah berdirinya perpustakaan Baitul Hikmah.",
      "Peserta didik memiliki pengetahuan tentang pusat-pusat peradaban Islam."
    ],
    "a": 2
  },
  {
    "q": "Disajikan narasi skenario praktik pedagogi tentang perencanaan materi ajar fiqih muamalah secara logis dengan pendekatan TPACK, mahasiswa dapat menentukan alur materi ajar fiqih muamalah sebagai pilar pengembangan karakter bangsa dalam perencanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik.\n\nPak Budi ingin mengajarkan materi \"Jual Beli dan Khiyar\". Ia ingin mengintegrasikan teknologi untuk membuat simulasi jual beli.\n\nLangkah awal perencanaan yang paling logis menurut pendekatan TPACK adalah....",
    "o": [
      "Membuat soal latihan tentang pengertian khiyar.",
      "Mencari aplikasi atau fitur simulasi jual beli di situs e-commerce untuk digunakan sebagai media interaktif.",
      "Menuliskan rukun jual beli di buku catatan siswa.",
      "Meminta siswa membawa contoh barang dagangan ke kelas.",
      "Membuat daftar ahli waris untuk materi selanjutnya."
    ],
    "a": 1
  },
  {
    "q": "Disajikan narasi materi tentang kasus lingkungan, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan indikator supaya peserta didik mampu berpikir kritis.\n\nBu Ani menyajikan kasus mengenai pencemaran sungai akibat limbah pabrik di sekitar sekolah. Ia ingin siswa menganalisis dampaknya dari perspektif fikih lingkungan.\n\nMengacu pada skenario pembelajaran tersebut, rumusan tujuan pembelajaran ranah pengetahuan (kognitif) yang paling sesuai untuk mengukur indikator \"mampu berpikir kritis\" adalah....",
    "o": [
      "Peserta didik dapat menyebutkan dalil tentang larangan berbuat kerusakan di muka bumi.",
      "Melalui analisis kasus, peserta didik mampu mengevaluasi dampak lingkungan dan merumuskan solusi berbasis prinsip-prinsip fikih lingkungan (fiqh al-bi'ah).",
      "Peserta didik mampu menjelaskan pengertian tabzir dan israf dalam penggunaan air.",
      "Peserta didik dapat menghafal ayat tentang kewajiban menjaga alam.",
      "Peserta didik terampil membuat poster tentang gerakan hemat air."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan materi tentang berbusana Muslimah, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai dengan indikator supaya peserta didik memiliki semangat gotong royong.\n\nPak Rendi ingin mengajarkan materi \"Busana Muslimah sesuai Syariat\". Ia ingin siswanya bekerja sama membuat panduan busana muslimah yang modis namun syar'i.\n\nBerdasarkan skenario ini, rumusan tujuan pembelajaran ranah keterampilan (psikomotorik) yang paling sesuai adalah....",
    "o": [
      "Peserta didik mampu menjelaskan batasan aurat bagi wanita menurut jumhur ulama.",
      "Melalui kerja kelompok, peserta didik mampu mendesain dan membuat katalog digital pakaian muslimah yang memenuhi kriteria syar'i.",
      "Peserta didik memiliki pemahaman tentang sejarah perkembangan busana di dunia Islam.",
      "Peserta didik mampu menganalisis dampak sosial dari cara berbusana.",
      "Peserta didik menunjukkan sikap percaya diri saat mempresentasikan hasil diskusi."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi materi tentang sejarah kebudayaan Islam di dunia, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah sikap yang paling sesuai dengan indikator supaya peserta didik dapat menghargai kebudayaan lokal.\n\nBu Rina mengajarkan materi \"Peradaban Islam di Andalusia\". Ia ingin siswa menghargai bagaimana Islam berinteraksi dengan budaya lokal Spanyol.\n\nRumusan tujuan pembelajaran ranah sikap yang paling sesuai adalah....",
    "o": [
      "Peserta didik mampu menyebutkan nama-nama kota pusat peradaban di Andalusia.",
      "Peserta didik dapat menganalisis faktor penyebab jatuhnya peradaban Islam di Andalusia.",
      "Melalui pembelajaran kisah peradaban Andalusia, peserta didik menunjukkan sikap menghargai keberagaman budaya sebagai kekayaan peradaban manusia.",
      "Peserta didik mampu menjelaskan sejarah berdirinya kerajaan Umayyah di Andalusia.",
      "Peserta didik terampil membuat peta perkembangan Islam di Eropa."
    ],
    "a": 2
  },
  {
    "q": "Disajikan narasi skenario praktik pedagogi tentang pelaksanaan materi ajar fiqih muamalah secara logis dengan pendekatan DL, mahasiswa dapat menentukan alur materi ajar fiqih muamalah dalam pelaksanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik.\n\nPak Dedi ingin mengajarkan materi \"Asuransi Syariah\". Ia ingin siswa menemukan perbedaan antara asuransi syariah dan konvensional secara mandiri.\n\nLangkah awal pelaksanaan pembelajaran yang paling tepat dan logis adalah....",
    "o": [
      "Memberikan penjelasan rinci mengenai pengertian dan dasar hukum asuransi syariah.",
      "Menampilkan perbandingan skema dana tabarru pada asuransi syariah dan skema premi pada asuransi konvensional untuk memancing pertanyaan siswa.",
      "Meminta siswa menghafal dalil-dalil Al-Qur'an tentang tolong-menolong.",
      "Melakukan kuis cepat tentang pengetahuan dasar siswa mengenai investasi.",
      "Menyuruh siswa membaca buku teks tentang sejarah asuransi."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan materi tentang etika berkomunikasi, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah sikap yang paling sesuai dengan indikator tujuan supaya peserta didik memiliki rasa ingin tahu yang tinggi.\n\nBu Rina mengajarkan materi tentang \"Etika Berbicara dan Berkomunikasi\". Ia ingin siswanya aktif mencari tahu tentang pepatah-pepatah bijak terkait komunikasi dalam Islam.\n\nBerdasarkan skenario ini, rumusan tujuan pembelajaran ranah sikap yang paling sesuai adalah....",
    "o": [
      "Peserta didik mampu menjelaskan pengertian jujur dan amanah dalam berbicara.",
      "Melalui penugasan studi pustaka digital, peserta didik menunjukkan rasa ingin tahu yang tinggi dengan mencari dan menyajikan pepatah bijak atau hadis tentang pentingnya menjaga lisan.",
      "Peserta didik dapat menganalisis dampak negatif berbohong dalam kehidupan.",
      "Peserta didik mampu membedakan antara berbicara sopan dan kasar.",
      "Peserta didik memiliki keterampilan dalam membuat ringkasan materi pelajaran."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan materi tentang perilaku terpuji, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai dengan indikator tujuan supaya peserta didik memiliki semangat gotong royong.\n\nPak Budi mengajarkan materi tentang \"Sikap Jujur dan Amanah\". Ia ingin siswa bekerja sama membuat proyek video pendek tentang perilaku jujur di sekolah.\n\nBerdasarkan skenario ini, rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai adalah....",
    "o": [
      "Peserta didik mampu menjelaskan pengertian jujur dan amanah dalam kehidupan sehari-hari.",
      "Melalui kerja kelompok, peserta didik dapat membuat video pendek yang mengampanyekan perilaku jujur di lingkungan sekolah secara kolaboratif.",
      "Peserta didik memiliki pengetahuan tentang dalil-dalil perintah berperilaku jujur.",
      "Peserta didik mampu menganalisis dampak negatif dari perilaku tidak jujur.",
      "Peserta didik menunjukkan sikap konsisten dalam berperilaku jujur."
    ],
    "a": 1
  },
  {
    "q": "Disajikan narasi skenario praktik pedagogi tentang perencanaan materi ajar sejarah kebudayaan Islam secara logis dengan pendekatan TPACK, mahasiswa dapat menentukan alur materi ajar sejarah kebudayaan Islam sebagai pilar pengembangan karakter bangsa dalam perencanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik.\n\nBu Shofiyah ingin mengajarkan materi \"Peradaban Islam masa Bani Abbasiah\". Ia ingin menggunakan teknologi untuk membuat lini masa (timeline) sejarah interaktif.\n\nLangkah awal perencanaan yang paling logis menurut pendekatan TPACK adalah....",
    "o": [
      "Membuat soal kuis tentang tokoh-tokoh Bani Abbasiah.",
      "Memilih aplikasi pembuatan timeline digital dan menyiapkan data sejarah yang relevan.",
      "Menuliskan poin-poin penting sejarah di papan tulis.",
      "Meminta siswa membaca buku paket tentang Bani Abbasiah.",
      "Menyusun rubrik penilaian untuk makalah sejarah."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi materi tentang perkembangan ilmu pengetahuan masa Islam, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah sikap yang paling sesuai dengan indikator supaya peserta didik memiliki sikap tanggung jawab.\n\nPak Dedi mengajarkan materi \"Peradaban Islam masa Abbasiyah\". Ia ingin siswa bertanggung jawab dalam menyelesaikan tugas analisis biografi ilmuwan Muslim.\n\nRumusan tujuan pembelajaran ranah sikap yang paling sesuai adalah....",
    "o": [
      "Peserta didik mampu menyebutkan contoh hasil karya ilmuwan Muslim.",
      "Peserta didik dapat menganalisis peran perpustakaan Baitul Hikmah.",
      "Melalui penugasan proyek, peserta didik menunjukkan sikap tanggung jawab dalam menyelesaikan analisis biografi ilmuwan Muslim tepat waktu.",
      "Peserta didik mampu menjelaskan sejarah berdirinya dinasti Abbasiyah.",
      "Peserta didik memiliki pengetahuan tentang pusat-pusat keilmuan Islam."
    ],
    "a": 2
  },
  {
    "q": "Disajikan narasi skenario praktik pedagogi tentang pelaksanaan materi ajar fikih ibadah secara logis dengan pendekatan DL, mahasiswa dapat menentukan alur materi ajar tetang fikih ibadah dalam pelaksanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik.\n\nPak Rendi ingin mengajarkan materi \"Sujud Sahwi, Tilawah, dan Syukur\". Ia ingin siswa menemukan penyebab dilakukannya sujud-sujud tersebut secara mandiri.\n\nLangkah awal pelaksanaan pembelajaran yang paling tepat dan logis adalah....",
    "o": [
      "Memberikan penjelasan rinci mengenai pengertian dan tata cara sujud.",
      "Menampilkan video skenario kesalahan dalam shalat untuk memancing pertanyaan siswa tentang kapan sujud sahwi dilakukan.",
      "Meminta siswa menghafal bacaan sujud.",
      "Melakukan kuis cepat tentang rukun shalat.",
      "Menyuruh siswa membaca buku teks tentang macam-macam sujud."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan materi tentang etika berkomunikasi, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai dengan indikator tujuan supaya peserta didik memiliki sikap proaktif.\n\nBu Dina ingin siswanya aktif dalam kampanye komunikasi santun di media sosial. Ia menugaskan mereka membuat panduan etika komunikasi digital.\n\nRumusan tujuan pembelajaran ranah keterampilan yang paling sesuai adalah....",
    "o": [
      "Peserta didik mampu menjelaskan prinsip tabayyun dalam berkomunikasi.",
      "Melalui kerja kelompok, peserta didik mampu membuat infografis tentang etika berkomunikasi di media sosial dan menyebarkannya.",
      "Peserta didik dapat menyebutkan jenis-jenis pelanggaran etika komunikasi.",
      "Peserta didik mampu menganalisis dampak komunikasi tidak santun.",
      "Peserta didik menunjukkan sikap sopan saat berdiskusi di kelas."
    ],
    "a": 1
  },
  {
    "q": "Disajikan narasi materi tentang kasus pengelolaan zakat, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan indikator supaya peserta didik mampu berpikir kritis.\n\nPak Fajar menyajikan kasus mengenai lembaga zakat yang tidak transparan dalam menyalurkan dana. Ia ingin siswa menganalisis manajemen pengelolaan zakat tersebut.\n\nMengacu pada skenario pembelajaran tersebut, rumusan tujuan pembelajaran ranah pengetahuan (kognitif) yang paling sesuai untuk mengukur indikator \"mampu berpikir kritis\" adalah....",
    "o": [
      "Peserta didik dapat menyebutkan mustahik zakat.",
      "Melalui analisis kasus, peserta didik mampu mengevaluasi manajemen lembaga zakat dan merumuskan solusi perbaikan berdasarkan prinsip transparansi dan akuntabilitas.",
      "Peserta didik mampu menjelaskan pengertian zakat maal.",
      "Peserta didik dapat menghafal dalil perintah zakat.",
      "Peserta didik terampil membuat laporan keuangan zakat sederhana."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan materi tentang berbusana Muslimah, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah sikap yang paling sesuai dengan indikator supaya peserta didik memiliki rasa ingin tahu yang tinggi.\n\nBu Citra ingin siswanya aktif mencari tahu tentang sejarah dan makna filosofis busana Muslimah di berbagai belahan dunia.\n\nBerdasarkan skenario ini, rumusan tujuan pembelajaran ranah sikap yang paling sesuai adalah....",
    "o": [
      "Peserta didik mampu menjelaskan kriteria busana Muslimah.",
      "Melalui penugasan studi pustaka, peserta didik menunjukkan rasa ingin tahu yang tinggi dengan mencari informasi tentang keragaman busana Muslimah di berbagai negara.",
      "Peserta didik dapat menganalisis pandangan masyarakat tentang busana Muslimah.",
      "Peserta didik mampu membedakan jilbab dan kerudung.",
      "Peserta didik memiliki keterampilan dalam membuat desain busana."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi materi tentang sejarah kebudayaan Islam di dunia, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan indikator supaya peserta didik mampu berpikir kritis.\n\nBu Shofiyah menyajikan kasus mengenai perkembangan ilmu pengetahuan di Andalusia. Ia ingin siswa menganalisis hubungan antara keterbukaan budaya dan kemajuan ilmu pengetahuan.\n\nMengacu pada skenario pembelajaran tersebut, rumusan tujuan pembelajaran ranah pengetahuan (kognitif) yang paling sesuai untuk mengukur indikator \"mampu berpikir kritis\" adalah....",
    "o": [
      "Peserta didik dapat menyebutkan tokoh ilmuwan Andalusia.",
      "Melalui analisis sejarah, peserta didik mampu mengevaluasi faktor-faktor yang mendukung kemajuan ilmu pengetahuan di Andalusia dan relevansinya dengan masa kini.",
      "Peserta didik mampu menjelaskan sejarah masuknya Islam ke Spanyol.",
      "Peserta didik dapat menghafal nama perpustakaan di Cordova.",
      "Peserta didik terampil membuat peta konsep peradaban Andalusia."
    ],
    "a": 1
  },
  {
    "q": "Disajikan narasi skenario praktik pedagogi tentang perencanaan materi ajar fiqih muamalah secara logis dengan pendekatan TPACK, mahasiswa dapat menentukan alur materi ajar fiqih muamalah sebagai pilar pengembangan karakter bangsa dalam perencanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik.\n\nPak Eko ingin mengajarkan materi \"Bank Syariah\". Ia ingin menggunakan teknologi untuk membuat video penjelasan interaktif.\n\nLangkah awal perencanaan yang paling logis menurut pendekatan TPACK adalah....",
    "o": [
      "Membuat soal latihan tentang riba.",
      "Mencari video animasi tentang konsep bagi hasil dan menyiapkan alat pembuat video.",
      "Menuliskan prinsip bank syariah di papan tulis.",
      "Meminta siswa membaca artikel tentang bank.",
      "Menyusun materi ujian untuk materi bank syariah."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan materi tentang perilaku terpuji, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai dengan indikator tujuan supaya peserta didik memiliki sikap proaktif.\n\nPak Zaenal ingin siswanya aktif dalam perilaku tolong-menolong di sekolah. Ia menugaskan mereka membuat kampanye sosial \"Tangan di Atas\".\n\nBerdasarkan skenario ini, rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai adalah....",
    "o": [
      "Peserta didik mampu menjelaskan pengertian tolong-menolong.",
      "Melalui kerja kelompok, peserta didik mampu merancang dan melaksanakan aksi sosial \"Tangan di Atas\" di lingkungan sekolah.",
      "Peserta didik memiliki pengetahuan tentang dalil perintah sedekah.",
      "Peserta didik mampu menganalisis dampak positif tolong-menolong.",
      "Peserta didik menunjukkan sikap empati kepada teman yang membutuhkan."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan materi tentang perilaku terpuji, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah sikap yang paling sesuai dengan indikator tujuan supaya peserta didik memiliki semangat gotong royong.\n\nPak Budi mengajarkan materi tentang \"Sikap Jujur dan Amanah\". Ia ingin siswa bekerja sama membuat proyek video pendek tentang perilaku jujur di sekolah.\n\nBerdasarkan skenario ini, rumusan tujuan pembelajaran ranah sikap yang paling sesuai adalah....",
    "o": [
      "Peserta didik mampu menjelaskan pengertian jujur dan amanah dalam kehidupan sehari-hari.",
      "Melalui kerja kelompok, peserta didik menunjukkan semangat gotong royong dalam menyusun konsep dan memproduksi video pendek tentang perilaku jujur.",
      "Peserta didik memiliki pengetahuan tentang dalil-dalil perintah berperilaku jujur.",
      "Peserta didik mampu menganalisis dampak negatif dari perilaku tidak jujur.",
      "Peserta didik menunjukkan sikap konsisten dalam berperilaku jujur."
    ],
    "a": 1
  },
  {
    "q": "Disajikan narasi skenario praktik pedagogi tentang perencanaan materi ajar sejarah kebudayaan Islam secara logis dengan pendekatan TPACK, mahasiswa dapat menentukan alur materi ajar sejarah kebudayaan Islam sebagai pilar pengembangan karakter bangsa dalam perencanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik.\n\nBu Shofiyah ingin mengajarkan materi \"Peradaban Islam masa Bani Abbasiah\". Ia ingin menggunakan teknologi untuk membuat lini masa (timeline) sejarah interaktif.\n\nLangkah awal perencanaan yang paling logis menurut pendekatan TPACK adalah....",
    "o": [
      "Membuat soal kuis tentang tokoh-tokoh Bani Abbasiah.",
      "Memilih aplikasi pembuatan timeline digital dan menyiapkan data sejarah yang relevan.",
      "Menuliskan poin-poin penting sejarah di papan tulis.",
      "Meminta siswa membaca buku paket tentang Bani Abbasiah.",
      "Menyusun rubrik penilaian untuk makalah sejarah."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi materi tentang perkembangan ilmu pengetahuan masa Islam, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah sikap yang paling sesuai dengan indikator supaya peserta didik memiliki sikap tanggung jawab.\n\nPak Dedi mengajarkan materi \"Peradaban Islam masa Abbasiyah\". Ia ingin siswa bertanggung jawab dalam menyelesaikan tugas analisis biografi ilmuwan Muslim.\n\nRumusan tujuan pembelajaran ranah sikap yang paling sesuai adalah....",
    "o": [
      "Peserta didik mampu menyebutkan contoh hasil karya ilmuwan Muslim.",
      "Peserta didik dapat menganalisis peran perpustakaan Baitul Hikmah.",
      "Melalui penugasan proyek, peserta didik menunjukkan sikap tanggung jawab dalam menyelesaikan analisis biografi ilmuwan Muslim tepat waktu.",
      "Peserta didik mampu menjelaskan sejarah berdirinya dinasti Abbasiyah.",
      "Peserta didik memiliki pengetahuan tentang pusat-pusat keilmuan Islam."
    ],
    "a": 2
  },
  {
    "q": "Disajikan narasi skenario praktik pedagogi tentang pelaksanaan materi ajar fikih ibadah secara logis dengan pendekatan DL, mahasiswa dapat menentukan alur materi ajar tetang fikih ibadah dalam pelaksanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik.\n\nPak Rendi ingin mengajarkan materi \"Sujud Sahwi, Tilawah, dan Syukur\". Ia ingin siswa menemukan penyebab dilakukannya sujud-sujud tersebut secara mandiri.\n\nLangkah awal pelaksanaan pembelajaran yang paling tepat dan logis adalah....",
    "o": [
      "Memberikan penjelasan rinci mengenai pengertian dan tata cara sujud.",
      "Menampilkan video skenario kesalahan dalam shalat untuk memancing pertanyaan siswa tentang kapan sujud sahwi dilakukan.",
      "Meminta siswa menghafal bacaan sujud.",
      "Melakukan kuis cepat tentang rukun shalat.",
      "Menyuruh siswa membaca buku teks tentang macam-macam sujud."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan materi tentang etika berkomunikasi, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai dengan indikator tujuan supaya peserta didik memiliki sikap proaktif.\n\nBu Dina ingin siswanya aktif dalam kampanye komunikasi santun di media sosial. Ia menugaskan mereka membuat panduan etika komunikasi digital.\n\nRumusan tujuan pembelajaran ranah keterampilan yang paling sesuai adalah....",
    "o": [
      "Peserta didik mampu menjelaskan prinsip tabayyun dalam berkomunikasi.",
      "Melalui kerja kelompok, peserta didik mampu membuat infografis tentang etika berkomunikasi di media sosial dan menyebarkannya.",
      "Peserta didik dapat menyebutkan jenis-jenis pelanggaran etika komunikasi.",
      "Peserta didik mampu menganalisis dampak komunikasi tidak santun.",
      "Peserta didik menunjukkan sikap sopan saat berdiskusi di kelas."
    ],
    "a": 1
  },
  {
    "q": "Disajikan narasi materi tentang kasus pengelolaan zakat, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan indikator supaya peserta didik mampu berpikir kritis.\n\nPak Fajar menyajikan kasus mengenai lembaga zakat yang tidak transparan dalam menyalurkan dana. Ia ingin siswa menganalisis manajemen pengelolaan zakat tersebut.\n\nMengacu pada skenario pembelajaran tersebut, rumusan tujuan pembelajaran ranah pengetahuan (kognitif) yang paling sesuai untuk mengukur indikator \"mampu berpikir kritis\" adalah....",
    "o": [
      "Peserta didik dapat menyebutkan mustahik zakat.",
      "Melalui analisis kasus, peserta didik mampu mengevaluasi manajemen lembaga zakat dan merumuskan solusi perbaikan berdasarkan prinsip transparansi dan akuntabilitas.",
      "Peserta didik mampu menjelaskan pengertian zakat maal.",
      "Peserta didik dapat menghafal dalil perintah zakat.",
      "Peserta didik terampil membuat laporan keuangan zakat sederhana."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan materi tentang berbusana Muslimah, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah sikap yang paling sesuai dengan indikator supaya peserta didik memiliki rasa ingin tahu yang tinggi.\n\nBu Citra ingin siswanya aktif mencari tahu tentang sejarah dan makna filosofis busana Muslimah di berbagai belahan dunia.\n\nBerdasarkan skenario ini, rumusan tujuan pembelajaran ranah sikap yang paling sesuai adalah....",
    "o": [
      "Peserta didik mampu menjelaskan kriteria busana Muslimah.",
      "Melalui penugasan studi pustaka, peserta didik menunjukkan rasa ingin tahu yang tinggi dengan mencari informasi tentang keragaman busana Muslimah di berbagai negara.",
      "Peserta didik dapat menganalisis pandangan masyarakat tentang busana Muslimah.",
      "Peserta didik mampu membedakan jilbab dan kerudung.",
      "Peserta didik memiliki keterampilan dalam membuat desain busana."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi materi tentang sejarah kebudayaan Islam di dunia, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan indikator supaya peserta didik mampu berpikir kritis.\n\nBu Shofiyah menyajikan kasus mengenai perkembangan ilmu pengetahuan di Andalusia. Ia ingin siswa menganalisis hubungan antara keterbukaan budaya dan kemajuan ilmu pengetahuan.\n\nMengacu pada skenario pembelajaran tersebut, rumusan tujuan pembelajaran ranah pengetahuan (kognitif) yang paling sesuai untuk mengukur indikator \"mampu berpikir kritis\" adalah....",
    "o": [
      "Peserta didik dapat menyebutkan tokoh ilmuwan Andalusia.",
      "Melalui analisis sejarah, peserta didik mampu mengevaluasi faktor-faktor yang mendukung kemajuan ilmu pengetahuan di Andalusia dan relevansinya dengan masa kini.",
      "Peserta didik mampu menjelaskan sejarah masuknya Islam ke Spanyol.",
      "Peserta didik dapat menghafal nama perpustakaan di Cordova.",
      "Peserta didik terampil membuat peta konsep peradaban Andalusia."
    ],
    "a": 1
  },
  {
    "q": "Disajikan narasi skenario praktik pedagogi tentang perencanaan materi ajar fiqih muamalah secara logis dengan pendekatan TPACK, mahasiswa dapat menentukan alur materi ajar fiqih muamalah sebagai pilar pengembangan karakter bangsa dalam perencanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik.\n\nPak Eko ingin mengajarkan materi \"Bank Syariah\". Ia ingin menggunakan teknologi untuk membuat video penjelasan interaktif.\n\nLangkah awal perencanaan yang paling logis menurut pendekatan TPACK adalah....",
    "o": [
      "Membuat soal latihan tentang riba.",
      "Mencari video animasi tentang konsep bagi hasil dan menyiapkan alat pembuat video.",
      "Menuliskan prinsip bank syariah di papan tulis.",
      "Meminta siswa membaca artikel tentang bank.",
      "Menyusun materi ujian untuk materi bank syariah."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan materi tentang perilaku terpuji, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai dengan indikator tujuan supaya peserta didik memiliki sikap proaktif.\n\nPak Zaenal ingin siswanya aktif dalam perilaku tolong-menolong di sekolah. Ia menugaskan mereka membuat kampanye sosial \"Tangan di Atas\".\n\nBerdasarkan skenario ini, rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai adalah....",
    "o": [
      "Peserta didik mampu menjelaskan pengertian tolong-menolong.",
      "Melalui kerja kelompok, peserta didik mampu merancang dan melaksanakan aksi sosial \"Tangan di Atas\" di lingkungan sekolah.",
      "Peserta didik memiliki pengetahuan tentang dalil perintah sedekah.",
      "Peserta didik mampu menganalisis dampak positif tolong-menolong.",
      "Peserta didik menunjukkan sikap empati kepada teman yang membutuhkan."
    ],
    "a": 1
  }
]
    
