[
  {
    "q": "Dalam pembelajaran akhlak karimah, guru ingin peserta didik tidak hanya memahami teori, tetapi juga menampilkan sikap yang mencerminkan keimanan, ketakwaan, dan akhlak mulia.\n\nIndikator tujuan pembelajaran ranah sikap yang paling sesuai dengan harapan tersebut adalah:",
    "o": [
      "Peserta didik dapat menjelaskan makna akhlak karimah dan mengidentifikasi perilaku yang tidak mencerminkan akhlak mulia dalam kehidupan sehari-hari.",
      "Peserta didik menunjukkan perilaku jujur dan tanggung jawab dalam mengerjakan tugas sekolah sebagai wujud ketakwaan kepada Allah SWT.",
      "Peserta didik mampu menyebutkan contoh-contoh akhlak karimah dalam lingkungan keluarga dan sekolah.",
      "Peserta didik dapat menghafal ayat-ayat Al-Qur'an dan hadis yang berkaitan dengan akhlak karimah.",
      "Peserta didik membuat laporan observasi tentang perilaku terpuji teman sejawat di kelas."
    ],
    "a": 1
  },
  {
    "q": "Seorang guru PAI di SD ingin mengajarkan materi kisah Nabi Muhammad SAW. Guru tersebut ingin peserta didik dapat menganalisis nilai-nilai kejujuran dari kisah tersebut dalam kehidupan sehari-hari. Tujuan pembelajaran ranah pengetahuan yang paling tepat adalah…",
    "o": [
      "Peserta didik dapat menyebutkan gelar Nabi Muhammad SAW.",
      "Peserta didik dapat menganalisis keterkaitan kisah kejujuran Nabi Muhammad SAW dengan penerapan perilaku jujur siswa di sekolah.",
      "Peserta didik dapat menceritakan kembali kisah kejujuran Nabi Muhammad SAW.",
      "Peserta didik dapat menghafalkan dalil tentang kejujuran.",
      "Peserta didik dapat membuat poster tentang kejujuran."
    ],
    "a": 1
  },
  {
    "q": "Dalam sebuah diskusi kelas tentang toleransi, seorang siswa menyatakan pandangan yang kurang menghargai perbedaan. Guru PAI sebagai fasilitator harus bersikap moderat dan bijaksana.\n\nTindakan guru yang paling tepat adalah…",
    "o": [
      "Menegur siswa tersebut dengan keras agar tidak mengulangi perkataannya.",
      "Mengajak seluruh siswa untuk mendiskusikan pandangan tersebut dengan merujuk pada prinsip toleransi dalam Islam.",
      "Membiarkan pandangan tersebut agar suasana diskusi tetap tenang.",
      "Langsung menutup diskusi dan beralih ke materi lain.",
      "Meminta siswa tersebut keluar dari kelas."
    ],
    "a": 1
  },
  {
    "q": "Bu Aisyah adalah guru PAI yang menggunakan model PjBL (Project Based Learning) untuk materi \"Pengelolaan Zakat\". Siswa diminta membuat infografis tentang alur penghitungan dan distribusi zakat fitrah di lingkungan sekitar.\n\nApa keunggulan utama dari pendekatan pembelajaran ini?",
    "o": [
      "Siswa lebih mudah menghafal rumus zakat.",
      "Siswa belajar secara aktif dan mampu mengontekstualisasikan konsep zakat dalam kehidupan nyata.",
      "Siswa tidak perlu membaca buku paket lagi.",
      "Guru lebih mudah dalam memberikan nilai akhir.",
      "Waktu pembelajaran menjadi lebih singkat."
    ],
    "a": 1
  },
  {
    "q": "Dalam menyusun instrumen penilaian sumatif pada materi \"Peradaban Islam Masa Daulah Abbasiyah\", guru ingin mengukur kemampuan HOTS (Higher Order Thinking Skills) siswa.\n\nManakah contoh soal yang tepat?",
    "o": [
      "Sebutkan ibu kota Daulah Abbasiyah!",
      "Siapakah khalifah pertama Daulah Abbasiyah?",
      "Analisislah faktor-faktor yang menyebabkan kemajuan ilmu pengetahuan pada masa Daulah Abbasiyah dan relevansinya dengan kondisi saat ini!",
      "Jelaskan pengertian Daulah Abbasiyah!",
      "Kapan Daulah Abbasiyah berdiri?"
    ],
    "a": 2
  },
  {
    "q": "Guru PAI menggunakan media aplikasi kuis interaktif (Kahoot) di akhir pembelajaran materi \"Hukum Bacaan Mad\". Tindakan ini mencerminkan penguasaan TPACK dalam hal…",
    "o": [
      "Technological Knowledge (TK).",
      "Technological Pedagogical Knowledge (TPK).",
      "Content Knowledge (CK).",
      "Pedagogical Knowledge (PK).",
      "Technological Content Knowledge (TCK)."
    ],
    "a": 1
  },
  {
    "q": "Seorang guru PAI menemukan bahwa gaya belajar siswanya sangat beragam (visual, auditori, kinestetik). Untuk materi \"Tata Cara Haji\", tindakan guru yang tepat dalam menerapkan pembelajaran berdiferensiasi adalah…",
    "o": [
      "Menggunakan satu media video saja untuk semua siswa.",
      "Menyediakan berbagai media: peta konsep (visual), penjelasan lisan (auditori), dan simulasi manasik (kinestetik).",
      "Meminta semua siswa untuk membaca buku teks.",
      "Melakukan ceramah sepanjang jam pelajaran.",
      "Memberikan tes tertulis yang sama kepada semua siswa."
    ],
    "a": 1
  },
  {
    "q": "Sesuai dengan prinsip Moderasi Beragama di lingkungan Kemenag, apa peran guru PAI dalam menanamkan nilai-nilai kebangsaan kepada peserta didik?",
    "o": [
      "Mengajarkan bahwa kebangsaan dan agama tidak bisa disatukan.",
      "Menanamkan pemahaman bahwa mencintai tanah air adalah bagian dari iman (hubbul wathan minal iman).",
      "Melarang siswa mempelajari sejarah nasional.",
      "Meminta siswa hanya fokus pada satu kelompok saja.",
      "Membatasi pergaulan siswa dengan penganut agama lain."
    ],
    "a": 1
  },
  {
    "q": "Guru ingin mengevaluasi perilaku disiplin siswa dalam melaksanakan shalat berjamaah di madrasah. Instrumen yang paling sesuai adalah…",
    "o": [
      "Soal pilihan ganda.",
      "Soal esai.",
      "Lembar observasi perilaku.",
      "Wawancara.",
      "Portofolio."
    ],
    "a": 2
  },
  {
    "q": "Setelah dilakukan analisis hasil evaluasi, ternyata 60% siswa belum mencapai tujuan pembelajaran pada materi \"Hukum Waris\". Langkah tindak lanjut yang paling tepat bagi guru adalah…",
    "o": [
      "Memberikan remedial kepada 60% siswa tersebut dengan metode yang sama.",
      "Melakukan remedial klasikal dengan metode atau media pembelajaran yang lebih efektif.",
      "Melanjutkan ke materi berikutnya.",
      "Meminta siswa belajar mandiri.",
      "Menurunkan standar nilai kelulusan."
    ],
    "a": 1
  },
  {
    "q": "Seorang guru Fiqih ingin menerapkan prinsip moderasi beragama dengan cara mengajarkan kepada siswa bahwa perbedaan pendapat di kalangan ulama mazhab mengenai masalah cabang (furu'iyah) adalah hal yang wajar dan harus dihormati.\n\nTindakan guru yang paling tepat adalah…",
    "o": [
      "Mewajibkan siswa mengikuti hanya satu mazhab saja.",
      "Mengajarkan sejarah timbulnya perbedaan pendapat dan menekankan pentingnya sikap toleransi (tasamuh).",
      "Melarang siswa membahas perbedaan pendapat mazhab.",
      "Menganggap mazhab tertentu paling benar dan yang lain salah.",
      "Meminta siswa menghafal semua perbedaan pendapat tanpa memahami konteksnya."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran SKI tentang \"Dakwah Nabi di Madinah\", guru ingin mengembangkan kemampuan berpikir kritis siswa (HOTS) terkait relevansi strategi dakwah Nabi dengan kondisi keberagaman di Indonesia saat ini.\n\nAktivitas siswa yang paling tepat adalah…",
    "o": [
      "Menghafal poin-poin Piagam Madinah.",
      "Menganalisis persamaan strategi dakwah Nabi dalam membangun masyarakat madani dengan upaya membangun kerukunan umat beragama di Indonesia.",
      "Menyebutkan nama-nama sahabat yang ikut hijrah ke Madinah.",
      "Menceritakan kembali kisah perang badar.",
      "Menggambar peta kota Madinah."
    ],
    "a": 1
  },
  {
    "q": "Guru PAI menggunakan media video pembelajaran interaktif untuk menjelaskan materi \"Tata Cara Pengurusan Jenazah\" agar siswa lebih mudah memahami tahapan-tahapannya secara visual.\n\nDalam konteks teknologi pendidikan, tindakan guru tersebut merupakan penerapan…",
    "o": [
      "Technological Knowledge (TK).",
      "Technological Content Knowledge (TCK).",
      "Technological Pedagogical Knowledge (TPK).",
      "Content Knowledge (CK).",
      "Pedagogical Knowledge (PK)."
    ],
    "a": 2
  },
  {
    "q": "Untuk menerapkan pembelajaran berdiferensiasi pada materi \"Zakat\", guru PAI membagi siswa ke dalam kelompok berdasarkan kesiapan belajar (learning readiness).\n\nKelompok yang belum paham konsep dasar zakat diberikan bimbingan intensif, sedangkan kelompok yang sudah paham diberikan tugas studi kasus.\n\nLangkah ini bertujuan untuk…",
    "o": [
      "Membuat siswa merasa rendah diri.",
      "Memenuhi kebutuhan belajar siswa yang berbeda-beda agar mencapai tujuan pembelajaran.",
      "Mempercepat waktu pembelajaran.",
      "Mengurangi tugas guru.",
      "Memisahkan siswa yang pintar dan kurang pintar."
    ],
    "a": 1
  },
  {
    "q": "Seorang guru PAI selalu memulai pembelajaran dengan membaca doa dan ayat Al-Qur'an serta memberikan keteladanan perilaku sopan santun kepada siswa.\n\nPerilaku guru tersebut merupakan contoh penerapan kompetensi…",
    "o": [
      "Pedagogik.",
      "Kepribadian dan Sosial.",
      "Profesional.",
      "Akademik.",
      "Teknologi."
    ],
    "a": 1
  },
  {
    "q": "Guru PAI menyusun instrumen penilaian proyek berupa pembuatan video pendek tentang \"Perilaku Jujur di Sekolah\".\n\nKomponen rubrik penilaian yang paling penting untuk menilai HOTS adalah…",
    "o": [
      "Kualitas pencahayaan video.",
      "Kreativitas cerita dan kedalaman refleksi nilai kejujuran.",
      "Durasi video.",
      "Kerapian seragam siswa dalam video.",
      "Kekompakan kelompok dalam video."
    ],
    "a": 1
  },
  {
    "q": "Dalam Kurikulum Merdeka, pada bagian komponen inti modul ajar, pendidik perlu merumuskan pertanyaan pemantik.\n\nApakah fungsi pertanyaan pemantik dalam pembelajaran PAI?",
    "o": [
      "Untuk menakut-nakuti siswa agar belajar.",
      "Untuk memancing rasa ingin tahu dan memulai diskusi kontekstual terkait materi yang akan dipelajari.",
      "Untuk menentukan nilai akhir siswa.",
      "Untuk menggantikan soal ujian.",
      "Untuk menghabiskan waktu pembelajaran."
    ],
    "a": 1
  },
  {
    "q": "Seorang guru PAI ingin menanamkan nilai cinta tanah air sesuai dengan semangat moderasi beragama.\n\nManakah contoh aktivitas yang tepat?",
    "o": [
      "Mengajarkan bahwa mencintai negara adalah syirik.",
      "Mengaitkan kisah perjuangan para pahlawan Islam di Indonesia dengan kewajiban mempertahankan NKRI.",
      "Melarang siswa hormat bendera.",
      "Mengabaikan sejarah perjuangan bangsa.",
      "Hanya mempelajari sejarah Timur Tengah saja."
    ],
    "a": 1
  },
  {
    "q": "Teknik penilaian yang paling tepat untuk mengukur kemampuan siswa dalam membaca Al-Qur'an sesuai kaidah tajwid adalah…",
    "o": [
      "Tes tertulis.",
      "Tes lisan/praktik.",
      "Penilaian antar teman.",
      "Portofolio.",
      "Angket."
    ],
    "a": 1
  },
  {
    "q": "Setelah mempelajari materi \"Perilaku Hidup Bersih dalam Islam\", guru ingin melihat perubahan perilaku siswa sehari-hari di madrasah.\n\nInstrumen yang paling tepat digunakan adalah…",
    "o": [
      "Tes tulis objektif.",
      "Lembar observasi perilaku harian.",
      "Kuisioner pengetahuan tentang kebersihan.",
      "Esai tentang manfaat kebersihan.",
      "Portofolio hasil karya poster."
    ],
    "a": 1
  },
    [
  {
    "q": "Seorang guru PAI ingin mengajarkan materi kisah Nabi Musa AS. Dalam prosesnya, guru menekankan pada nilai keteguhan hati dalam menghadapi kezaliman dan bagaimana nilai tersebut dapat diaplikasikan dalam kehidupan siswa saat ini menghadapi perundungan (bullying) di sekolah.\n\nPendekatan yang digunakan guru tersebut adalah…",
    "o": [
      "Pendekatan historis murni.",
      "Pendekatan kontekstual.",
      "Pendekatan doktriner.",
      "Pendekatan kognitif.",
      "Pendekatan naratif."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran materi 'Manusia dan Tanggung Jawab', guru ingin mengukur kompetensi sikap sosial siswa mengenai kepedulian terhadap sesama manusia.\n\nInstrumen yang paling tepat digunakan adalah…",
    "o": [
      "Tes tulis pilihan ganda.",
      "Lembar observasi perilaku sosial (peer assessment).",
      "Esai tentang teori tanggung jawab manusia.",
      "Tes lisan tentang nama-nama nabi.",
      "Ujian praktik shalat."
    ],
    "a": 1
  },
  {
    "q": "Sesuai dengan prinsip TPACK, guru PAI menggunakan aplikasi simulasi manasik haji dalam bentuk Virtual Reality (VR) untuk membantu siswa memahami tata cara haji secara nyata.\n\nFungsi teknologi dalam kasus ini adalah sebagai…",
    "o": [
      "Alat untuk menggantikan peran guru.",
      "Alat visualisasi untuk meningkatkan pemahaman konseptual dan pengalaman belajar.",
      "Alat untuk menghabiskan anggaran madrasah.",
      "Alat untuk mempercepat ujian akhir.",
      "Alat untuk mengganti buku paket."
    ],
    "a": 1
  },
  {
    "q": "Untuk materi 'Hukum Waris' di MA, guru PAI melakukan asesmen diagnostik di awal pembelajaran. Apa tujuan utama asesmen tersebut?",
    "o": [
      "Menentukan nilai rapor siswa.",
      "Mengetahui kemampuan awal siswa untuk merancang pembelajaran yang sesuai.",
      "Memberikan hukuman kepada siswa yang belum paham.",
      "Menyeleksi siswa untuk ikut lomba.",
      "Menggantikan ujian akhir semester."
    ],
    "a": 1
  },
  {
    "q": "Dalam diskusi kelas mengenai isu radikalisme, guru PAI menekankan bahwa Islam adalah agama rahmatan lil 'alamin dan melarang keras tindakan kekerasan atas nama agama.\n\nTindakan guru ini merupakan wujud dari…",
    "o": [
      "Fanatisme beragama.",
      "Moderasi beragama (Tawasuth).",
      "Radikalisme beragama.",
      "Liberalisme beragama.",
      "Sekularisme beragama."
    ],
    "a": 1
  },
  {
    "q": "Manakah pernyataan yang paling tepat menggambarkan kompetensi kepribadian seorang guru PAI?",
    "o": [
      "Guru yang menguasai materi PAI secara mendalam.",
      "Guru yang mampu mengajar dengan menggunakan teknologi canggih.",
      "Guru yang bertindak sesuai dengan norma agama, hukum, dan sosial, serta menjadi teladan bagi siswa.",
      "Guru yang mampu membuat soal ujian yang sulit.",
      "Guru yang disiplin dalam mengisi absensi."
    ],
    "a": 2
  },
  {
    "q": "Guru menggunakan teknik penilaian portofolio untuk mengukur kemampuan siswa dalam membuat karya seni kaligrafi selama satu semester.\n\nApa keunggulan penilaian portofolio?",
    "o": [
      "Penilaian menjadi sangat cepat.",
      "Melihat perkembangan dan kemajuan hasil karya siswa dari waktu ke waktu.",
      "Hanya menilai hasil akhir karya siswa.",
      "Siswa tidak perlu melakukan aktivitas pembelajaran.",
      "Nilai menjadi sangat objektif tanpa rubrik."
    ],
    "a": 1
  },
  {
    "q": "Dalam Kurikulum Merdeka, pada komponen Tujuan Pembelajaran (TP) materi 'Akidah Islam', guru menekankan aspek 'iman kepada hari akhir'.\n\nManakah contoh indikator pencapaian TP yang terukur?",
    "o": [
      "Siswa memahami makna hari akhir.",
      "Siswa mengetahui tanda-tanda hari akhir.",
      "Siswa dapat menyebutkan tiga perilaku yang mencerminkan iman kepada hari akhir dalam kehidupan sehari-hari.",
      "Siswa senang belajar tentang hari akhir.",
      "Siswa menghafal ayat tentang hari akhir."
    ],
    "a": 2
  },
  {
    "q": "Untuk meningkatkan keaktifan siswa dalam materi 'Sejarah Kebudayaan Islam', guru menggunakan metode debat pro-kontra mengenai suatu kebijakan khalifah.\n\nMetode ini melatih kemampuan siswa dalam hal…",
    "o": [
      "Hafalan sejarah.",
      "Berpikir kritis dan berargumentasi secara ilmiah.",
      "Membaca cepat.",
      "Menulis laporan.",
      "Menghafal nama tokoh."
    ],
    "a": 1
  },
  {
    "q": "Guru menemukan bahwa sebagian siswa kesulitan memahami materi 'Perjanjian Hudaibiyah'. Apa langkah yang tepat untuk memberikan remedial?",
    "o": [
      "Meminta siswa tersebut membaca kembali buku teks sendiri.",
      "Memberikan penjelasan ulang dengan menggunakan peta perjalanan dan diskusi kelompok kecil.",
      "Memberikan tugas tambahan yang sama sulitnya.",
      "Membiarkan siswa tersebut belajar sendiri.",
      "Memberikan nilai kasihan kepada siswa."
    ],
    "a": 1
  },
  {
    "q": "Seorang guru PAI menggunakan AI untuk membuat skenario kasus fiqih. Namun, guru mengamati siswa kesulitan memahami bagaimana hukum tersebut diterapkan dalam konteks masyarakat, pentingnya musyawarah atau kesepakatan dalam masalah komunal, atau dampak sosial dari penerapan suatu hukum, padahal pemahaman ini vital untuk Fiqih yang bermakna dalam kehidupan sosial mereka. Dalam skenario pembelajaran Fiqih yang bermakna dengan penggunaan AI ini, masalah utama yang teridentifikasi, dan pendekatan ilmiah yang paling relevan untuk menemukan solusinya guna menunjukkan jati diri guru profesional, adalah...",
    "o": [
      "Masalah: AI minim studi kasus fiqih sosial. Solusi: Kembangkan bank kasus fiqih sosial dan role-playing.",
      "Masalah: AI berfokus individu, menghambat pemahaman dimensi sosial. Solusi: Studi kualitatif, community projects, dan diskusi isu sosial.",
      "Masalah: Guru kurang terampil mengajarkan Fiqih sosial secara digital. Solusi: Pelatihan guru berkelanjutan.",
      "Masalah: Siswa enggan tugas komunal. Solusi: Peer tutoring berbasis AI.",
      "Masalah: Konten AI bias. Solusi: Audit konten dan verifikasi ahli lokal."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran SKI tentang 'Peran Tokoh Penyebar Islam di Indonesia', guru menggunakan pendekatan saintifik. Langkah 'Mengomunikasikan' dalam pendekatan tersebut dapat diwujudkan melalui...",
    "o": [
      "Siswa membaca buku paket secara diam.",
      "Siswa mempresentasikan hasil analisis kelompok tentang peran tokoh di depan kelas.",
      "Siswa merangkum materi sejarah.",
      "Siswa menjawab pertanyaan guru.",
      "Siswa mendengarkan ceramah guru."
    ],
    "a": 1
  },
  {
    "q": "Guru ingin menerapkan pembelajaran berdiferensiasi pada materi 'Akidah Islam'. Siswa yang memiliki gaya belajar visual diminta...",
    "o": [
      "Mendengarkan rekaman ceramah tentang akidah.",
      "Membuat poster atau infografis tentang rukun iman.",
      "Melakukan diskusi kelompok kecil.",
      "Menulis esai tentang tauhid.",
      "Bermain peran tentang perilaku terpuji."
    ],
    "a": 1
  },
  {
    "q": "Dalam kurikulum merdeka, asesmen yang bertujuan untuk memberikan informasi atau umpan balik bagi pendidik dan peserta didik untuk memperbaiki proses belajar disebut asesmen...",
    "o": [
      "Sumatif.",
      "Formatif.",
      "Diagnostik awal.",
      "Penempatan.",
      "Seleksi."
    ],
    "a": 1
  },
  {
    "q": "Guru PAI mengaitkan materi 'Perjanjian Hudaibiyah' dengan nilai toleransi dan perdamaian dalam kehidupan berbangsa saat ini. Pendekatan ini disebut pendekatan...",
    "o": [
      "Teoretis.",
      "Kontekstual.",
      "Historis murni.",
      "Doktriner.",
      "Kognitif."
    ],
    "a": 1
  },
  {
    "q": "Salah satu ciri utama guru profesional dalam mengelola kelas adalah mampu...",
    "o": [
      "Membiarkan siswa berbuat sesukanya.",
      "Menciptakan suasana belajar yang kondusif, aman, dan menyenangkan.",
      "Menghukum siswa yang tidak mengerjakan tugas secara fisik.",
      "Mendominasi pembicaraan di kelas.",
      "Hanya fokus pada siswa yang pintar saja."
    ],
    "a": 1
  },
  {
    "q": "Dalam mengevaluasi proyek video siswa, guru menggunakan rubrik penilaian. Aspek yang paling penting dinilai dalam konteks konten sejarah adalah...",
    "o": [
      "Keindahan editan video.",
      "Akurasi data sejarah dan kedalaman analisis.",
      "Durasi video yang panjang.",
      "Musik latar yang populer.",
      "Jumlah siswa dalam kelompok."
    ],
    "a": 1
  },
  {
    "q": "Manakah pernyataan yang tepat mengenai hubungan antara Kriteria Ketercapaian Tujuan Pembelajaran (KKTP) dengan Tujuan Pembelajaran (TP)?",
    "o": [
      "KKTP adalah penjabaran operasional dari TP yang digunakan untuk mengukur ketercapaian TP.",
      "KKTP dan TP adalah hal yang sama.",
      "KKTP dibuat oleh siswa, sedangkan TP dibuat oleh guru.",
      "KKTP tidak perlu disesuaikan dengan TP.",
      "KKTP hanya digunakan untuk asesmen sumatif."
    ],
    "a": 0
  },
  {
    "q": "Seorang guru ingin meningkatkan motivasi belajar siswa pada materi Fiqih 'Jual Beli'. Metode yang paling tepat adalah...",
    "o": [
      "Ceramah satu arah.",
      "Simulasi jual beli di kelas.",
      "Membaca buku teks mandiri.",
      "Mengerjakan soal pilihan ganda.",
      "Menghafal definisi jual beli."
    ],
    "a": 1
  },
  {
    "q": "Guru menggunakan media berbasis teknologi yang memungkinkan siswa belajar secara mandiri sesuai dengan kecepatan belajarnya masing-masing. Ini adalah contoh...",
    "o": [
      "Pembelajaran konvensional.",
      "Pembelajaran berbasis proyek.",
      "Pembelajaran mandiri berbantuan teknologi.",
      "Pembelajaran kelompok besar.",
      "Pembelajaran tradisional."
    ],
    "a": 2
  },
  {
    "q": "Seorang guru Fiqih ingin menerapkan model pembelajaran Problem Based Learning (PBL) pada materi 'Hukum Waris'. Masalah nyata yang paling relevan untuk diangkat adalah...",
    "o": [
      "Menghafal ayat-ayat waris dalam Al-Qur'an.",
      "Pembagian warisan yang tidak sesuai dengan ketentuan Fiqih di suatu masyarakat.",
      "Mengerjakan soal-soal latihan perhitungan waris.",
      "Membaca buku teks tentang sejarah ilmu faraid.",
      "Mendengarkan ceramah tentang keutamaan ilmu waris."
    ],
    "a": 1
  },
  {
    "q": "Guru mengajarkan nilai-nilai moderasi beragama dalam materi 'Sejarah Bani Umayyah'. Tindakan yang tepat adalah...",
    "o": [
      "Mengagungkan satu khalifah dan merendahkan khalifah lain.",
      "Menekankan pada aspek pencapaian ilmu pengetahuan dan keterbukaan terhadap budaya lain pada masa tersebut.",
      "Fokus pada konflik politik yang terjadi tanpa mengambil hikmah.",
      "Mengajarkan bahwa Bani Umayyah adalah dinasti terbaik.",
      "Melarang siswa mempelajari dinasti lain."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran TPACK, guru menggunakan VR (Virtual Reality) untuk membawa siswa 'berkunjung' ke situs sejarah Islam di Cordoba. Manakah aspek TPACK yang menonjol?",
    "o": [
      "Technological Content Knowledge (TCK).",
      "Technological Pedagogical Knowledge (TPK).",
      "Technological Knowledge (TK).",
      "Pedagogical Content Knowledge (PCK).",
      "Content Knowledge (CK)."
    ],
    "a": 0
  },
  {
    "q": "Apa fungsi umpan balik (feedback) yang konstruktif dalam asesmen formatif?",
    "o": [
      "Untuk memberikan nilai akhir kepada siswa.",
      "Untuk memberi tahu siswa kelemahan mereka tanpa saran perbaikan.",
      "Untuk membantu siswa memahami sejauh mana kemajuan belajar mereka dan apa yang perlu ditingkatkan.",
      "Untuk meranking siswa berdasarkan kemampuan.",
      "Untuk menggantikan fungsi nilai rapor."
    ],
    "a": 2
  },
  {
    "q": "Dalam materi 'Zakat', guru meminta siswa melakukan simulasi penghitungan zakat profesi. Aktivitas ini berada pada tingkat kognitif...",
    "o": [
      "C1 (Mengingat).",
      "C2 (Memahami).",
      "C3 (Mengaplikasikan).",
      "C4 (Menganalisis).",
      "C6 (Menciptakan)."
    ],
    "a": 2
  },
  {
    "q": "Guru profesional harus memiliki komitmen tinggi terhadap tugasnya. Contoh perilaku tersebut adalah...",
    "o": [
      "Datang ke kelas tepat waktu dan mempersiapkan materi pembelajaran dengan baik.",
      "Meninggalkan kelas sebelum jam pelajaran usai.",
      "Mengerjakan tugas administrasi sekolah saat mengajar.",
      "Menggunakan jam mengajar untuk urusan pribadi.",
      "Mengabaikan siswa yang bertanya."
    ],
    "a": 0
  },
  {
    "q": "Dalam konteks pembelajaran berpusat pada siswa, guru berperan sebagai...",
    "o": [
      "Sumber utama pengetahuan.",
      "Fasilitator dan motivator belajar.",
      "Pengawas ketat kegiatan siswa.",
      "Penentu tunggal hasil belajar.",
      "Pemberi informasi satu arah."
    ],
    "a": 1
  },
  {
    "q": "Manakah pernyataan yang paling tepat menggambarkan evaluasi pembelajaran?",
    "o": [
      "Evaluasi hanya dilakukan di akhir semester.",
      "Evaluasi bertujuan untuk mengukur keberhasilan proses dan hasil pembelajaran.",
      "Evaluasi hanya bertugas memberikan nilai kepada siswa.",
      "Evaluasi tidak perlu memperhatikan tujuan pembelajaran.",
      "Evaluasi hanya dilakukan oleh kepala sekolah."
    ],
    "a": 1
  },
  {
    "q": "Guru ingin mengajarkan nilai 'kejujuran' pada materi 'Jual Beli'. Metode yang paling efektif adalah...",
    "o": [
      "Metode ceramah tentang definisi kejujuran.",
      "Metode diskusi kelompok tentang contoh kejujuran.",
      "Metode pembiasaan dan modeling (keteladanan) melalui simulasi transaksi jual beli.",
      "Menghafal ayat tentang kejujuran.",
      "Tes tulis tentang perilaku jujur."
    ],
    "a": 2
  },
  {
    "q": "Proses pembelajaran di era digital menuntut guru untuk...",
    "o": [
      "Menghindari penggunaan teknologi.",
      "Menguasai dan mengintegrasikan teknologi dalam pembelajaran secara bijak (TPACK).",
      "Menyerahkan seluruh proses belajar kepada teknologi.",
      "Fokus pada hafalan konvensional.",
      "Mengurangi interaksi dengan siswa."
    ],
    "a": 1
  }
]
