[
  {
    "q": "Disajikan deskripsi materi tentang hakikat Akidah Islam dan posisi Akidah dalam ajaran Islam.\n\nAkidah Islam merupakan keyakinan dasar seorang muslim terhadap Allah SWT yang menjadi fondasi utama dalam seluruh ajaran Islam. Akidah menempati posisi paling mendasar karena menjadi landasan bagi pelaksanaan ibadah dan pembentukan akhlak mulia dalam kehidupan sehari-hari.\n\nBerdasarkan deskripsi tersebut, rumusan tujuan pembelajaran ranah sikap yang paling tepat adalah …",
    "o": [
      "Peserta didik dapat menyebutkan pengertian dan ruang lingkup Akidah Islam secara benar.",
      "Peserta didik dapat menjelaskan kedudukan Akidah dalam ajaran Islam secara sistematis.",
      "Peserta didik dapat menguraikan hubungan antara Akidah, ibadah, dan akhlak dalam Islam.",
      "Peserta didik menunjukkan sikap beriman dan bertakwa kepada Allah SWT yang tercermin dalam perilaku sehari-hari sesuai ajaran Islam.",
      "Peserta didik mampu menghafal dalil naqli tentang Akidah Islam."
    ],
    "a": 3
  },
  {
    "q": "Disajikan pernyataan materi tentang konsep dasar Asmaul Husna.\n\nAsmaul Husna merupakan nama-nama Allah SWT yang indah dan sempurna, mencerminkan sifat-sifat kesempurnaan-Nya. Memahami makna Asmaul Husna dapat membuka wawasan peserta didik tentang keagungan Allah dan mendorong mereka untuk berpikir kritis tentang penciptaan alam semesta.\n\nBerdasarkan pernyataan tersebut, rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai adalah …",
    "o": [
      "Peserta didik dapat menyebutkan 99 nama Allah secara berurutan.",
      "Peserta didik dapat menghafalkan makna setiap nama Allah dengan benar.",
      "Peserta didik mampu menganalisis makna Asmaul Husna dan hubungannya dengan fenomena alam untuk mengembangkan kemampuan berpikir kritis.",
      "Peserta didik menunjukkan sikap khusyuk dalam beribadah kepada Allah.",
      "Peserta didik dapat menggambar kaligrafi Asmaul Husna dengan indah."
    ],
    "a": 2
  },
  {
    "q": "Disajikan pernyataan materi tentang hakikat akhlak Islam dan kedudukan akhlak dalam ajaran Islam.\n\nAkhlak Islam merupakan perwujudan nilai-nilai keislaman dalam perilaku manusia sehari-hari. Akhlak menjadi ukuran kemuliaan seseorang di sisi Allah SWT dan menjadi cerminan keberhasilan pendidikan Islam. Pembentukan akhlak mulia memerlukan semangat gotong royong dalam lingkungan keluarga, sekolah, dan masyarakat.\n\nBerdasarkan pernyataan tersebut, rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai adalah …",
    "o": [
      "Peserta didik dapat menjelaskan pengertian akhlak menurut bahasa dan istilah.",
      "Peserta didik dapat membedakan antara akhlak mahmudah dan mazmumah.",
      "Peserta didik dapat mengidentifikasi faktor-faktor pembentuk akhlak.",
      "Peserta didik menunjukkan sikap hormat kepada orang tua dan guru.",
      "Peserta didik mampu berkolaborasi dengan teman dalam kegiatan pembiasaan akhlak mulia melalui semangat gotong royong."
    ],
    "a": 4
  },
  {
    "q": "Disajikan deskripsi kasus pengembangan materi tentang konsep aliran-aliran dalam ilmu kalam.\n\nGuru Akidah Akhlak di sebuah madrasah menyusun materi tentang aliran Mu'tazilah, Asy'ariyah, dan Maturidiyah. Dalam penyajiannya, guru tersebut menekankan bahwa setiap aliran memiliki tradisi keilmuan yang berharga dan perlu dipahami dengan sikap terbuka sebagai bagian dari khazanah keilmuan Islam.\n\nBerdasarkan deskripsi kasus tersebut, rumusan indikator tujuan pembelajaran ranah sikap yang paling sesuai adalah …",
    "o": [
      "Peserta didik dapat menyebutkan tokoh-tokoh utama dari setiap aliran ilmu kalam.",
      "Peserta didik dapat membandingkan konsep-konsep dasar antar aliran ilmu kalam.",
      "Peserta didik menunjukkan sikap penerimaan terhadap tradisi keilmuan Islam yang beragam dengan tetap berpegang teguh pada Ahlus Sunnah wal Jama'ah.",
      "Peserta didik mampu menganalisis kelemahan aliran Mu'tazilah secara kritis.",
      "Peserta didik dapat menulis esai tentang sejarah perkembangan ilmu kalam."
    ],
    "a": 2
  },
  {
    "q": "Disajikan deskripsi materi tentang makna objek pembahasan tasawuf beserta dalilnya.\n\nTasawuf merupakan ilmu yang mengkaji tentang penyucian jiwa, pembentukan akhlak mulia, dan upaya mendekatkan diri kepada Allah SWT. Objek pembahasan tasawuf mencakup hubungan manusia dengan Penciptanya (hablum min Allah) dan hubungan antarsesama manusia (hablum min al-nas) yang dinamis dan terus berkembang sesuai konteks zaman.\n\nBerdasarkan deskripsi tersebut, rumusan indikator tujuan pembelajaran ranah pengetahuan yang paling sesuai adalah …",
    "o": [
      "Peserta didik dapat menyebutkan definisi tasawuf menurut para sufi.",
      "Peserta didik dapat menghafal dalil-dalil tentang tasawuf.",
      "Peserta didik mampu menganalisis perkembangan konsep tasawuf secara dinamis dan inovatif dalam konteks kehidupan modern.",
      "Peserta didik menunjukkan sikap zuhud dalam kehidupan sehari-hari.",
      "Peserta didik dapat mempraktikkan dzikir secara rutin."
    ],
    "a": 2
  },
  {
    "q": "Disajikan deskripsi aktivitas pembelajaran guru dalam perencanaan tujuan pembelajaran pada materi Aqidah Islam dengan pendekatan PBL.\n\nSeorang guru merencanakan pembelajaran tentang Allah dan Kemaha-Esa-an Allah menggunakan pendekatan Problem Based Learning (PBL). Guru tersebut mengidentifikasi kompetensi dasar, menganalisis karakteristik peserta didik, menentukan masalah kontekstual tentang fenomena alam, dan menyusun langkah-langkah pemecahan masalah yang mengarah pada pemahaman konsep ketauhidan.\n\nBerdasarkan deskripsi tersebut, analisis materi ajar yang paling tepat berdasarkan struktur keilmuan adalah …",
    "o": [
      "Menguraikan definisi Allah menurut bahasa dan istilah saja.",
      "Menganalisis konsep Allah dan Kemaha-Esa-an Allah secara faktual, konseptual, dan prosedural dalam struktur keilmuan untuk merencanakan pembelajaran PBL.",
      "Menghafalkan sifat-sifat Allah secara mekanis tanpa pemahaman.",
      "Mengabaikan karakteristik peserta didik dalam perencanaan materi.",
      "Menggunakan metode ceramah tanpa adanya masalah kontekstual."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi aktivitas guru dalam pelaksanaan tujuan pembelajaran pada materi Asmaul Husna dengan pendekatan PjBL.\n\nGuru melaksanakan pembelajaran Asmaul Husna melalui Project Based Learning (PjBL) dengan membimbing peserta didik membuat proyek poster tentang penerapan nilai-nilai Asmaul Husna dalam kehidupan sehari-hari. Guru menganalisis materi tentang makna dan sifat Asmaul Husna secara mendalam sebelum pelaksanaan proyek.\n\nBerdasarkan deskripsi tersebut, analisis materi ajar yang paling tepat berdasarkan struktur keilmuan adalah …",
    "o": [
      "Mengajarkan Asmaul Husna hanya sebagai hafalan tanpa pemahaman makna.",
      "Menganalisis makna dan sifat Asmaul Husna secara faktual, konseptual, dan metafaktual dalam struktur keilmuan pada pelaksanaan pembelajaran PjBL.",
      "Memberikan proyek tanpa analisis materi terlebih dahulu.",
      "Mengabaikan keterkaitan Asmaul Husna dengan kehidupan nyata.",
      "Menggunakan pendekatan yang tidak sesuai dengan karakteristik peserta didik."
    ],
    "a": 1
  },
  {
    "q": "Disajikan narasi kasus guru melakukan evaluasi pembelajaran pada materi akhlak mahmudah atau akhlak mazmumah dengan pendekatan DBL.\n\nGuru Akidah Akhlak mengevaluasi pembelajaran tentang akhlak terpuji dan tercela menggunakan Discovery Based Learning (DBL). Evaluasi dilakukan dengan mengukur kemampuan peserta didik dalam menemukan contoh-contoh akhlak mahmudah dan mazmumah dalam kehidupan sosial, serta menganalisis dampaknya terhadap keharmonisan masyarakat.\n\nBerdasarkan narasi kasus tersebut, penguraian materi ajar yang paling tepat adalah …",
    "o": [
      "Mengevaluasi hafalan definisi akhlak mahmudah dan mazmumah.",
      "Menguraikan konsep akhlak terpuji (mahmudah) dan akhlak tercela (mazmumah) secara faktual, konseptual, dan prosedural dalam evaluasi pembelajaran DBL sesuai karakteristik peserta didik.",
      "Mengabaikan aspek sikap dalam evaluasi pembelajaran.",
      "Menilai peserta didik hanya dari aspek kognitif semata.",
      "Menggunakan instrumen evaluasi yang tidak sesuai dengan pendekatan DBL."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan praktik pedagogi tentang perencanaan materi ajar aliran-aliran ilmu kalam secara logis dengan pendekatan TPACK.\n\nSeorang guru merencanakan pembelajaran tentang aliran-aliran Ilmu Kalam dengan mengintegrasikan Technological Pedagogical Content Knowledge (TPACK). Guru menggunakan aplikasi digital untuk memetakan karakteristik utama Mu'tazilah, Asy'ariyah, dan Maturidiyah, serta merancang aktivitas pembelajaran yang memadukan konten, pedagogi, dan teknologi secara sinergis.\n\nBerdasarkan pernyataan tersebut, alur materi ajar yang paling tepat adalah …",
    "o": [
      "Menyajikan materi aliran kalam secara acak tanpa sistematika.",
      "Menentukan alur materi ajar karakteristik utama dari berbagai aliran Ilmu Kalam secara logis dalam perencanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik.",
      "Menggunakan teknologi tanpa kaitan dengan materi pembelajaran.",
      "Mengabaikan perbedaan karakteristik peserta didik dalam perencanaan.",
      "Menyampaikan materi hanya melalui ceramah tanpa variasi."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan praktik pedagogi tentang pelaksanaan materi ajar aliran tasawuf atau tokoh-tokohnya secara logis dengan pendekatan Deep Learning (DL).\n\nDalam pelaksanaan pembelajaran tentang aliran tasawuf, guru menerapkan pendekatan Deep Learning (DL) dengan membimbing peserta didik menganalisis sejarah munculnya tasawuf, faktor-faktor yang melatarbelakanginya, dan perkembangannya secara mendalam hingga dapat membuat koneksi dengan konteks kehidupan modern.\n\nBerdasarkan pernyataan tersebut, alur materi ajar yang paling tepat adalah …",
    "o": [
      "Menyajikan materi tasawuf secara dangkal tanpa analisis historis.",
      "Menentukan alur materi ajar tentang sejarah munculnya tasawuf, faktor-faktor yang melatarbelakanginya secara logis dalam pelaksanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik.",
      "Mengabaikan konteks historis dalam pembelajaran tasawuf.",
      "Tidak menghubungkan materi dengan kehidupan peserta didik.",
      "Menggunakan pendekatan yang tidak mendorong pemikiran mendalam."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan praktik pedagogi tentang pelaksanaan materi ajar objek pembahasan tasawuf secara logis dengan model pelayanan konseling.\n\nGuru menyelenggarakan layanan konseling untuk membantu peserta didik memahami objek pembahasan tasawuf dalam hubungan dengan Tuhan (hablum min Allah) dan hubungan antarsesama (hablum min al-nas). Layanan ini dirancang secara sistematis untuk mengevaluasi pemahaman dan aplikasi nilai-nilai tasawuf dalam kehidupan peserta didik.\n\nBerdasarkan pernyataan tersebut, alur materi ajar yang paling tepat adalah …",
    "o": [
      "Menyajikan materi tasawuf tanpa memperhatikan aspek spiritual peserta didik.",
      "Menentukan alur materi ajar ruang lingkup pembahasan tasawuf dalam hubungan antara makhluk dengan Tuhan (hablum min Allah) dan hubungan antar sesama makhluk (hablum min al-nas) dalam mengevaluasi tujuan pembelajaran sesuai dengan karakteristik peserta didik.",
      "Mengabaikan layanan konseling sebagai bagian dari evaluasi.",
      "Tidak menghubungkan antara teori tasawuf dengan praktik kehidupan.",
      "Mengevaluasi pembelajaran hanya dari aspek kognitif semata."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan praktik pedagogi tentang pelaksanaan program penguatan profil pelajar pancasila (P5) secara logis.\n\nSebuah satuan pendidikan menyusun program Penguatan Profil Pelajar Pancasila (P5) dengan mengintegrasikan nilai-nilai keimanan dan ketakwaan. Guru Akidah Akhlak mengembangkan materi ajar yang menghubungkan kompetensi sikap beriman, bertakwa, dan berakhlak mulia dengan dimensi-dimensi profil pelajar Pancasila dalam perencanaan pembelajaran.\n\nBerdasarkan pernyataan tersebut, pengembangan materi ajar nilai-nilai P5 yang paling tepat adalah …",
    "o": [
      "Mengabaikan integrasi nilai-nilai P5 dalam pembelajaran Akidah Akhlak.",
      "Menentukan pengembangan materi ajar nilai-nilai P5 dalam merencanakan tujuan pembelajaran sesuai dengan karakteristik peserta didik.",
      "Menyajikan nilai-nilai P5 secara terpisah dari materi Akidah Akhlak.",
      "Tidak memperhatikan dimensi profil pelajar Pancasila dalam perencanaan.",
      "Menggunakan pendekatan yang tidak melibatkan peserta didik secara aktif."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan praktik pedagogi tentang pelaksanaan program Penguatan Profil Pelajar Rahmatan lil 'Alamin (PPRA) secara logis.\n\nGuru Akidah Akhlak melaksanakan program PPRA dengan mengembangkan materi ajar yang menekankan nilai-nilai rahmatan lil 'alamin dalam berbagai aspek kehidupan. Materi dikembangkan berdasarkan struktur keilmuan dan disesuaikan dengan karakteristik peserta didik dalam pelaksanaan pembelajaran sehari-hari.\n\nBerdasarkan pernyataan tersebut, pengembangan materi ajar nilai-nilai PPRA yang paling tepat adalah …",
    "o": [
      "Mengabaikan konsep rahmatan lil 'alamin dalam pembelajaran.",
      "Menentukan pengembangan materi ajar nilai-nilai PPRA dalam melaksanakan tujuan pembelajaran sesuai dengan karakteristik peserta didik.",
      "Menyajikan materi PPRA tanpa kaitan dengan struktur keilmuan.",
      "Tidak menyesuaikan materi dengan karakteristik peserta didik.",
      "Menggunakan metode yang tidak mengembangkan sikap kepedulian sosial."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan praktik pedagog atau praktik di masyarakat tentang implementasi nilai-nilai moderasi beragama secara logis.\n\nDalam praktik di masyarakat multikultural, nilai-nilai moderasi beragama diimplementasikan melalui sikap wasathiyah (pertengahan), adil, toleran, dan saling menghormati. Guru Akidah Akhlak mengembangkan materi ajar yang menginternalisasikan nilai-nilai tersebut sebagai bagian dari pemahaman Islam sebagai agama moderat.\n\nBerdasarkan pernyataan tersebut, pengembangan materi ajar yang paling tepat adalah …",
    "o": [
      "Mengabaikan konteks moderasi beragama dalam materi pembelajaran.",
      "Menentukan pengembangan materi ajar nilai-nilai Islam sebagai agama moderat atau wasathiyah yang tepat sesuai dengan implementasi moderasi beragama dalam mengevaluasi tujuan pembelajaran sesuai dengan karakteristik peserta didik.",
      "Menyajikan materi tanpa kaitan dengan realitas kehidupan bermasyarakat.",
      "Tidak mengembangkan sikap toleransi dalam materi ajar.",
      "Menggunakan pendekatan yang tidak kontekstual dengan kehidupan nyata."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan praktik pedagogi atau praktik di masyarakat tentang alasan implementasi nilai-nilai moderasi beragama.\n\nImplementasi nilai-nilai moderasi beragama menjadi sangat penting karena Indonesia merupakan negara majemuk dengan keragaman agama, suku, dan budaya. Alasan ini menjadi landasan guru dalam mengembangkan materi ajar Islam sebagai agama moderat yang menekankan konsep wasathiyah dalam kehidupan bermasyarakat.\n\nBerdasarkan pernyataan tersebut, penilaian pengembangan materi ajar yang paling tepat adalah …",
    "o": [
      "Mengabaikan alasan kontekstual dalam pengembangan materi.",
      "Menilai pengembangan materi ajar Islam sebagai agama moderat atau wasathiyah dengan alasan yang tepat sesuai dengan implementasi moderasi beragama.",
      "Menyusun materi tanpa mempertimbangkan keragaman masyarakat.",
      "Tidak menghubungkan konsep wasathiyah dengan kehidupan nyata.",
      "Menggunakan alasan yang tidak relevan dengan konteks Indonesia."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi penerapan pembelajaran dengan materi tauhid dan berbagai aspeknya sesuai dengan struktur keilmuan.\n\nGuru merancang pembelajaran tentang konsep tauhid dengan pendekatan pembelajaran berbasis masalah (PBL). Materi disusun secara terstruktur mencakup pengertian tauhid, macam-macam tauhid, dan implikasinya dalam kehidupan, disajikan melalui permasalahan kontekstual yang memancing peserta didik untuk berpikir kritis.\n\nBerdasarkan deskripsi tersebut, rancangan pembelajaran yang paling tepat adalah …",
    "o": [
      "Menggunakan metode ceramah tanpa adanya masalah kontekstual.",
      "Memilih rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan materi pembelajaran.",
      "Menyajikan materi tauhid secara abstrak tanpa kaitan kehidupan.",
      "Mengabaikan struktur keilmuan dalam penyusunan materi.",
      "Tidak melibatkan peserta didik dalam proses pemecahan masalah."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan penerapan pembelajaran dengan materi tauhid dan berbagai aspeknya dalam kehidupan sehari-hari sesuai dengan struktur keilmuan.\n\nDalam merancang pembelajaran tauhid, guru mempertimbangkan pengetahuan pedagogik tentang bagaimana peserta didik memahami konsep abstrak ketauhidan. Guru menggunakan analogi, contoh konkret, dan pengalaman langsung untuk menjembatani pemahaman peserta didik tentang Allah sebagai pencipta dan pemelihara alam semesta.\n\nBerdasarkan pernyataan tersebut, rancangan pembelajaran yang paling tepat adalah …",
    "o": [
      "Menggunakan pendekatan abstrak tanpa bantuan analogi atau contoh.",
      "Memilih rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan pengetahuan pedagogik.",
      "Mengabaikan tahapan perkembangan kognitif peserta didik.",
      "Menyajikan materi tanpa mempertimbangkan gaya belajar peserta didik.",
      "Tidak menggunakan variasi metode dalam pembelajaran."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi kasus penerapan pembelajaran dengan materi nilai-nilai Asmaul Husna dalam kehidupan sehari-hari sesuai dengan struktur keilmuan.\n\nGuru merancang pembelajaran Asmaul Husna dengan memanfaatkan teknologi informasi dan komunikasi. Peserta didik menggunakan aplikasi pencarian untuk menemukan ayat-ayat Al-Qur'an yang berkaitan dengan Asmaul Husna, serta membuat video kreatif tentang penerapan nilai-nilai tersebut dalam kehidupan sehari-hari.\n\nBerdasarkan deskripsi kasus tersebut, rancangan pembelajaran yang paling tepat adalah …",
    "o": [
      "Melarang penggunaan teknologi dalam pembelajaran Asmaul Husna.",
      "Memilih rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan pengetahuan teknologi.",
      "Menggunakan teknologi tanpa kaitan dengan materi pembelajaran.",
      "Tidak memanfaatkan media digital untuk kreativitas peserta didik.",
      "Mengabaikan aspek praktis penerapan Asmaul Husna."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi kasus penerapan pembelajaran dengan materi macam-macam akhlak terpuji (mahmudah) dan akhlak tercela (mazmumah) sesuai dengan struktur keilmuan.\n\nGuru merancang pembelajaran tentang akhlak mahmudah dan mazmumah dengan pendekatan pembelajaran berbasis perbedaan individu. Materi disusun memperhatikan keragaman kemampuan, minat, dan gaya belajar peserta didik, dengan memberikan pilihan aktivitas sesuai karakteristik masing-masing.\n\nBerdasarkan deskripsi kasus tersebut, rancangan pembelajaran yang paling tepat adalah …",
    "o": [
      "Menggunakan pendekatan yang sama untuk semua peserta didik.",
      "Memilih rancangan pembelajaran berpendekatan pembelajaran berbasis perbedaan individu sesuai dengan materi pembelajaran.",
      "Mengabaikan keragaman karakteristik peserta didik.",
      "Tidak memberikan pilihan aktivitas yang sesuai dengan kemampuan.",
      "Menyamaratakan treatment pembelajaran tanpa diferensiasi."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan kasus penerapan pembelajaran dengan materi ajar kontribusi tokoh-tokoh utama dalam Ilmu Kalam sesuai dengan struktur keilmuan.\n\nDalam merancang pembelajaran tentang tokoh-tokoh Ilmu Kalam, guru menerapkan pendekatan pembelajaran berbasis perbedaan individu dengan mempertimbangkan pengetahuan pedagogik. Guru memahami bahwa setiap peserta didik memiliki latar belakang pengetahuan dan kemampuan berpikir yang berbeda dalam memahami kontribusi para tokoh.\n\nBerdasarkan pernyataan kasus tersebut, rancangan pembelajaran yang paling tepat adalah …",
    "o": [
      "Menggunakan pendekatan yang monoton tanpa variasi.",
      "Memilih rancangan pembelajaran berpendekatan pembelajaran berbasis perbedaan individu sesuai dengan pengetahuan pedagogi.",
      "Mengabaikan latar belakang pengetahuan peserta didik.",
      "Tidak mempertimbangkan perbedaan kemampuan berpikir.",
      "Menyajikan materi tanpa strategi diferensiasi."
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan penerapan pembelajaran dengan materi aliran-aliran dalam tasawuf serta kontribusi para tokoh dalam perkembangan spiritualitas Islam sesuai dengan struktur keilmuan.\n\nGuru merancang pembelajaran tentang aliran tasawuf dengan memanfaatkan berbagai teknologi pembelajaran seperti virtual tour ziarah makam wali, video dokumenter, dan platform kolaboratif online. Pendekatan ini dipilih untuk mengakomodasi karakteristik peserta didik digital native.\n\nBerdasarkan pernyataan tersebut, rancangan pembelajaran yang paling tepat adalah …",
    "o": [
      "Menggunakan metode tradisional tanpa memanfaatkan teknologi.",
      "Memilih rancangan pembelajaran berpendekatan pembelajaran berbasis perbedaan individu sesuai dengan pengetahuan teknologi.",
      "Mengabaikan karakteristik digital native peserta didik.",
      "Tidak memanfaatkan media teknologi yang tersedia.",
      "Menggunakan teknologi tanpa kaitan dengan materi tasawuf."
    ],
    "a": 1
  },
  {
    "q": "Disajikan narasi kasus penerapan pembelajaran dengan materi ruang lingkup pembahasan tasawuf dalam hubungan antara makhluk dengan Tuhan (hablum min Allah) atau hubungan antar sesama makhluk (hablum min al-nas) sesuai dengan struktur keilmuan.\n\nGuru merancang pembelajaran tentang objek pembahasan tasawuf dengan pendekatan pembelajaran mendalam (Deep Learning) untuk mengembangkan kemampuan critical thinking peserta didik. Materi dirancang secara sistematis untuk membimbing peserta didik menganalisis, mengevaluasi, dan menciptakan pemahaman mendalam tentang konsep hablum min Allah dan hablum min al-nas.\n\nBerdasarkan narasi kasus tersebut, rancangan pembelajaran yang paling tepat adalah …",
    "o": [
      "Menggunakan pendekatan surface learning tanpa analisis mendalam.",
      "Memilih rancangan pembelajaran berpendekatan pembelajaran berbasis pembelajaran mendalam sesuai dengan materi pembelajaran.",
      "Mengabaikan pengembangan kemampuan berpikir kritis.",
      "Tidak menyusun materi secara sistematis dan mendalam.",
      "Menggunakan pendekatan yang tidak mendorong evaluasi dan kreasi."
    ],
    "a": 1
  },
  {
    "q": "Disajikan narasi kasus penerapan pembelajaran dengan materi ruang lingkup pembahasan tasawuf dalam hubungan antara makhluk dengan Tuhan (hablum min Allah) atau hubungan antar sesama makhluk (hablum min al-nas) sesuai dengan struktur keilmuan.\n\nDalam merancang pembelajaran tasawuf, guru menerapkan pendekatan Deep Learning dengan mempertimbangkan pengetahuan pedagogik. Guru merancang aktivitas yang mendorong peserta didik untuk mengeksplorasi kreativitas dalam memahami dan mengaplikasikan konsep hubungan dengan Tuhan dan sesama manusia.\n\nBerdasarkan narasi kasus tersebut, rancangan pembelajaran yang paling tepat adalah …",
    "o": [
      "Menggunakan pendekatan yang menghambat kreativitas peserta didik.",
      "Memilih rancangan pembelajaran berpendekatan pembelajaran berbasis pembelajaran mendalam sesuai dengan pengetahuan pedagogi.",
      "Mengabaikan aspek kreativitas dalam pembelajaran.",
      "Tidak merancang aktivitas eksploratif bagi peserta didik.",
      "Menggunakan metode yang pasif dan tidak inovatif."
    ],
    "a": 1
  },
  {
    "q": "Disajikan kasus penerapan pembelajaran dengan materi pengertian pendidikan nilai dan pendidikan karakter sesuai dengan struktur keilmuan.\n\nGuru merancang pembelajaran tentang pendidikan nilai dan karakter dengan pendekatan Deep Learning yang memanfaatkan teknologi kolaboratif. Peserta didik bekerja dalam tim virtual untuk menganalisis kasus-kasus pendidikan nilai, berkomunikasi efektif, dan berkolaborasi menyusun solusi permasalahan karakter.\n\nBerdasarkan kasus tersebut, rancangan pembelajaran yang paling tepat adalah …",
    "o": [
      "Menggunakan pendekatan individual tanpa kolaborasi.",
      "Memilih rancangan pembelajaran berpendekatan pembelajaran berbasis pembelajaran mendalam sesuai dengan pengetahuan teknologi.",
      "Mengabaikan pengembangan kemampuan kolaborasi dan komunikasi.",
      "Tidak memanfaatkan teknologi untuk pembelajaran kolaboratif.",
      "Menggunakan teknologi tanpa tujuan pembelajaran yang jelas."
    ],
    "a": 1
  },
  {
    "q": "Disajikan kasus penerapan pembelajaran dengan materi konsep dan urgensi moderasi beragama sesuai dengan struktur keilmuan.\n\nGuru merancang pembelajaran tentang moderasi beragama dengan pendekatan TPACK (Technological Pedagogical Content Knowledge). Materi dikembangkan dengan memadukan aspek konten moderasi beragama, pedagogi pembelajaran kontekstual, dan teknologi informasi untuk mengembangkan kemampuan adaptif peserta didik dalam menghadapi keragaman.\n\nBerdasarkan kasus tersebut, rancangan pembelajaran yang paling tepat adalah …",
    "o": [
      "Menggunakan pendekatan terpisah antara konten, pedagogi, dan teknologi.",
      "Memilih rancangan pembelajaran berpendekatan pembelajaran berbasis TPACK sesuai dengan materi pembelajaran.",
      "Mengabaikan integrasi ketiga aspek TPACK.",
      "Tidak mengembangkan kemampuan adaptif peserta didik.",
      "Menggunakan teknologi tanpa kaitan dengan konten moderasi beragama."
    ],
    "a": 1
  },
  {
    "q": "Diberikan kasus penyajian materi Allah dan Kemaha-Esa-an Allah yang materinya kurang sesuai dengan perkembangan zaman.\n\nSeorang guru menyajikan materi tentang Allah dan Kemaha-Esa-an Allah dengan metode ceramah konvensional tanpa mengaitkan dengan fenomena kontemporer. Peserta didik tampak kurang termotivasi karena materi dianggap abstrak dan tidak relevan dengan kehidupan modern. Untuk mengatasi hal ini, guru perlu menerapkan strategi pembelajaran yang lebih kontekstual.\n\nBerdasarkan kasus tersebut, penggunaan strategi pembelajaran yang paling tepat adalah …",
    "o": [
      "Meneruskan metode ceramah tanpa perubahan.",
      "Menentukan penggunaan strategi pembelajaran berpendekatan PBL guna menciptakan suasana belajar yang aman untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing.",
      "Mengabaikan ketidakpuasan peserta didik terhadap pembelajaran.",
      "Tidak mengaitkan materi dengan konteks kehidupan modern.",
      "Menggunakan pendekatan yang tidak melibatkan peserta didik aktif."
    ],
    "a": 1
  },
  {
    "q": "Diberikan kasus penyajian materi tauhid dan berbagai aspeknya yang materinya kurang sesuai dengan perkembangan zaman.\n\nDalam penyajian materi tauhid, guru hanya menyampaikan konsep teoretis tanpa mengaitkan dengan aplikasi dalam kehidupan sehari-hari peserta didik. Akibatnya, peserta didik kesulitan memahami relevansi tauhid dalam menghadapi tantangan kehidupan modern. Guru perlu menciptakan suasana belajar yang lebih nyaman dan bermakna.\n\nBerdasarkan kasus tersebut, penggunaan strategi pembelajaran yang paling tepat adalah …",
    "o": [
      "Mempertahankan pendekatan teoretis tanpa aplikasi praktis.",
      "Menentukan penggunaan strategi pembelajaran berpendekatan PjBL guna menciptakan suasana belajar yang nyaman untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing.",
      "Mengabaikan kesulitan peserta didik dalam memahami relevansi materi.",
      "Tidak mengubah strategi pembelajaran yang sudah ada.",
      "Menggunakan pendekatan yang tidak mempertimbangkan kenyamanan belajar."
    ],
    "a": 1
  },
  {
    "q": "Diberikan kasus penyajian materi nilai-nilai Asmaul Husna dalam kehidupan sehari-hari yang materinya kurang sesuai dengan perkembangan zaman.\n\nGuru menyajikan materi Asmaul Husna dengan cara menghafalkan nama-nama Allah tanpa mengaitkan dengan fenomena alam dan kehidupan modern. Peserta didik merasa pembelajaran monoton dan tidak memicu rasa bahagia dalam belajar. Diperlukan strategi yang lebih menarik dan membahagiakan.\n\nBerdasarkan kasus tersebut, penggunaan strategi pembelajaran yang paling tepat adalah …",
    "o": [
      "Meneruskan metode hafalan tanpa variasi.",
      "Menentukan penggunaan strategi pembelajaran berpendekatan DBL guna menciptakan suasana belajar yang membahagiakan untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing.",
      "Mengabaikan perasaan peserta didik yang merasa bosan.",
      "Tidak mengaitkan Asmaul Husna dengan fenomena kontemporer.",
      "Menggunakan pendekatan yang tidak memicu kebahagiaan dalam belajar."
    ],
    "a": 1
  },
  {
    "q": "Diberikan kasus penyajian materi akhlak terpuji (mahmudah) dan akhlak tercela (mazmumah) dalam kehidupan sehari-hari yang materinya kurang sesuai dengan perkembangan zaman.\n\nGuru menyajikan materi akhlak dengan contoh-contoh yang usang dan tidak relevan dengan kehidupan peserta didik modern. Peserta didik kesulitan mengidentifikasi bentuk-bentuk akhlak mahmudah dan mazmumah dalam konteks kehidupan mereka saat ini. Dibutuhkan model pembelajaran yang lebih akomodatif terhadap keragaman konteks peserta didik.\n\nBerdasarkan kasus tersebut, penggunaan model pembelajaran yang paling tepat adalah …",
    "o": [
      "Mempertahankan contoh-contoh yang usang tanpa update.",
      "Menentukan penggunaan model pembelajaran berpendekatan DL guna menciptakan suasana belajar yang akomodatif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing.",
      "Mengabaikan kesulitan peserta didik dalam mengidentifikasi akhlak kontemporer.",
      "Tidak mengakomodasi keragaman konteks kehidupan peserta didik.",
      "Menggunakan model yang tidak fleksibel dan adaptif."
    ],
    "a": 1
  },
  {
    "q": "Diberikan kasus penyajian materi objek pembahasan Ilmu Kalam, seperti sifat-sifat Allah, qadha dan qadar, kebebasan manusia, iman dan kufur, atau hubungan akal dan wahyu yang materinya kurang sesuai dengan perkembangan zaman.\n\nGuru menyajikan materi Ilmu Kalam dengan pendekatan dogmatis tanpa mengaitkan dengan perkembangan ilmu pengetahuan modern dan isu-isu kontemporer. Peserta didik mengalami kesulitan dalam memahami relevansi materi dalam kehidupan modern. Diperlukan model pembelajaran yang adaptif terhadap perkembangan zaman.\n\nBerdasarkan kasus tersebut, penggunaan model pembelajaran yang paling tepat adalah …",
    "o": [
      "Mempertahankan pendekatan dogmatis tanpa kaitan dengan perkembangan IPTEK.",
      "Menentukan penggunaan model pembelajaran berpendekatan TPACK guna menciptakan suasana belajar yang adaptif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing.",
      "Mengabaikan kesulitan peserta didik dalam memahami relevansi materi.",
      "Tidak mengintegrasikan teknologi dan pedagogi dengan konten Ilmu Kalam.",
      "Menggunakan model yang tidak responsif terhadap perkembangan zaman."
    ],
    "a": 1
  },
  {
    "q": "Diberikan kasus penyajian materi aliran-aliran dalam tasawuf serta kontribusi para tokoh dalam perkembangan spiritualitas Islam yang materinya kurang sesuai dengan perkembangan zaman.\n\nGuru menyajikan materi tentang aliran tasawuf secara historis tanpa mengaitkan dengan perkembangan spiritualitas kontemporer dan tantangan kehidupan modern. Peserta didik kesulitan memahami relevansi tasawuf dalam menghadapi tekanan hidup modern. Dibutuhkan model pembelajaran yang progresif dan kontekstual.\n\nBerdasarkan kasus tersebut, penggunaan model pembelajaran yang paling tepat adalah …",
    "o": [
      "Mempertahankan penyajian historis tanpa kaitan kontemporer.",
      "Menentukan penggunaan model pembelajaran berbasis pelayanan bimbingan konseling guna menciptakan suasana belajar yang progresif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing.",
      "Mengabaikan kesulitan peserta didik dalam menghubungkan tasawuf dengan kehidupan modern.",
      "Tidak menyediakan layanan konseling untuk pengembangan spiritual.",
      "Menggunakan model yang tidak mendukung perkembangan progresif peserta didik."
    ],
    "a": 1
  },
  {
    "q": "Diberikan kasus penyajian materi ruang lingkup pembahasan tasawuf dalam hubungan antara makhluk dengan Tuhan (hablum min Allah) atau hubungan antar sesama makhluk (hablum min al-nas) yang materinya kurang sesuai dengan perkembangan zaman.\n\nGuru menyajikan materi tentang hablum min Allah dan hablum min al-nas dengan contoh yang tidak memperhatikan keragaman kebutuhan peserta didik, termasuk peserta didik dengan kebutuhan khusus. Lingkungan belajar belum sepenuhnya akomodatif terhadap keberagaman. Diperlukan pendekatan pembelajaran yang lebih inklusif.\n\nBerdasarkan kasus tersebut, penggunaan pendekatan pembelajaran yang paling tepat adalah …",
    "o": [
      "Mempertahankan contoh yang tidak inklusif dan tidak akomodatif.",
      "Menentukan penggunaan pendekatan pembelajaran berbasis pelayanan ABK guna menciptakan lingkungan belajar yang akomodatif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing.",
      "Mengabaikan keberagaman kebutuhan peserta didik.",
      "Tidak menyediakan layanan untuk peserta didik dengan kebutuhan khusus.",
      "Menggunakan pendekatan yang tidak inklusif dan tidak responsif."
    ],
    "a": 1
  },
  {
    "q": "Diberikan kasus penyajian materi ruang lingkup pembahasan tasawuf dalam hubungan antara makhluk dengan Tuhan (hablum min Allah) atau hubungan antar sesama makhluk (hablum min al-nas) yang materinya kurang sesuai dengan perkembangan zaman.\n\nGuru menyajikan materi tasawuf dengan pendekatan yang kaku dan tidak fleksibel terhadap perubahan sosial dan perkembangan zaman. Peserta didik kesulitan mengadaptasi nilai-nilai tasawuf dalam konteks kehidupan yang terus berubah. Diperlukan pendekatan pembelajaran yang relevan dan adaptif.\n\nBerdasarkan kasus tersebut, penggunaan pendekatan pembelajaran yang paling tepat adalah …",
    "o": [
      "Mempertahankan pendekatan kaku yang tidak responsif terhadap perubahan.",
      "Menentukan penggunaan pendekatan pembelajaran yang relevan guna menciptakan lingkungan belajar yang adaptif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing.",
      "Mengabaikan kebutuhan akan fleksibilitas dalam pembelajaran.",
      "Tidak mengadaptasi nilai-nilai tasawuf dengan konteks kekinian.",
      "Menggunakan pendekatan yang tidak mendukung kemampuan adaptif peserta didik."
    ],
    "a": 1
  },
  {
    "q": "Diberikan kasus penyajian materi tujuan atau macam-macam pendidikan nilai dan pendidikan karakter dalam pendidikan yang materinya kurang sesuai dengan perkembangan zaman.\n\nGuru menyajikan materi pendidikan nilai dan karakter dengan pendekatan yang stagnan dan tidak berkembang sesuai dengan dinamika pendidikan modern. Peserta didik merasa materi tidak memberikan bekal yang cukup untuk menghadapi tantangan masa depan. Diperlukan pendekatan pembelajaran yang progresif dan berorientasi masa depan.\n\nBerdasarkan kasus tersebut, penggunaan pendekatan pembelajaran yang paling tepat adalah …",
    "o": [
      "Mempertahankan pendekatan stagnan tanpa perkembangan.",
      "Menentukan penggunaan pendekatan pembelajaran yang relevan guna menciptakan lingkungan belajar yang progresif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing.",
      "Mengabaikan dinamika pendidikan modern.",
      "Tidak memberikan bekal menghadapi tantangan masa depan.",
      "Menggunakan pendekatan yang tidak berorientasi pada perkembangan peserta didik."
    ],
    "a": 1
  },
  {
    "q": "Diberikan kasus penyajian materi prinsip-prinsip moderasi beragama (tengah, adil, toleransi, atau saling menghormati) yang materinya kurang sesuai dengan perkembangan zaman.\n\nGuru menyajikan materi moderasi beragama dengan cara yang membosankan dan tidak memicu kebahagiaan dalam belajar. Peserta didik merasa materi penting tetapi disajikan dengan cara yang tidak menginspirasi. Diperlukan pendekatan pembelajaran yang dapat menciptakan kebahagiaan dan inspirasi dalam belajar.\n\nBerdasarkan kasus tersebut, penggunaan pendekatan pembelajaran yang paling tepat adalah …",
    "o": [
      "Mempertahankan cara penyajian yang membosankan.",
      "Menentukan penggunaan pendekatan pembelajaran yang relevan guna menciptakan lingkungan belajar yang membahagiakan untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing.",
      "Mengabaikan perasaan peserta didik yang kurang terinspirasi.",
      "Tidak mengubah strategi pembelajaran yang monoton.",
      "Menggunakan pendekatan yang tidak memicu kebahagiaan dalam belajar."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi pembelajaran materi Aqidah Islam dengan pendekatan PBL.\n\nGuru melaksanakan pembelajaran Aqidah Islam dengan pendekatan Problem Based Learning (PBL). Dalam proses pembelajaran, guru perlu menentukan teknik asesmen yang tepat untuk mengukur capaian peserta didik pada aspek sikap, pengetahuan, dan keterampilan sesuai dengan karakteristik peserta didik.\n\nBerdasarkan deskripsi tersebut, teknik asesmen yang paling tepat adalah …",
    "o": [
      "Menggunakan tes tulis objektif semata tanpa variasi teknik.",
      "Menentukan teknik asesmen yang tepat sesuai karakter peserta didik pada aspek sikap, pengetahuan atau keterampilan.",
      "Mengabaikan aspek sikap dalam penilaian.",
      "Menggunakan teknik asesmen yang tidak sesuai dengan pendekatan PBL.",
      "Menilai peserta didik tanpa mempertimbangkan karakteristik individu."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi pembelajaran materi Aqidah Islam dengan pendekatan PjBL.\n\nDalam pembelajaran Aqidah Islam menggunakan Project Based Learning (PjBL), guru perlu menentukan instrumen asesmen yang dapat mengukur proses dan hasil belajar peserta didik secara komprehensif. Instrumen harus mampu menilai aspek sikap, pengetahuan, dan keterampilan sesuai dengan karakteristik peserta didik.\n\nBerdasarkan deskripsi tersebut, instrumen asesmen yang paling tepat adalah …",
    "o": [
      "Menggunakan instrumen tes tertulis tanpa rubrik yang jelas.",
      "Menentukan instrumen asesmen yang tepat sesuai karakter peserta didik pada aspek sikap, pengetahuan atau keterampilan.",
      "Mengabaikan penilaian proses dalam pembelajaran PjBL.",
      "Menggunakan instrumen yang tidak mengukur aspek keterampilan.",
      "Menilai hasil proyek tanpa mempertimbangkan proses pembelajaran."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi pembelajaran materi Asmaul Husna dengan pendekatan DL.\n\nGuru melaksanakan pembelajaran Asmaul Husna dengan pendekatan Deep Learning (DL) di laboratorium alam terbuka. Dalam konteks lingkungan belajar yang berbeda dari kelas konvensional, guru perlu menentukan teknik asesmen yang dapat mengukur pemahaman mendalam peserta didik pada aspek sikap, pengetahuan, dan keterampilan.\n\nBerdasarkan deskripsi tersebut, teknik asesmen yang paling tepat adalah …",
    "o": [
      "Menggunakan teknik asesmen yang hanya cocok untuk kelas konvensional.",
      "Menentukan teknik asesmen yang tepat sesuai lingkungan belajar pada aspek sikap, pengetahuan atau keterampilan.",
      "Mengabaikan karakteristik lingkungan belajar non-konvensional.",
      "Menggunakan teknik asesmen yang tidak mendukung pembelajaran mendalam.",
      "Menilai peserta didik tanpa mempertimbangkan konteks lingkungan belajar."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi pembelajaran materi Akhlak Mahmudah atau Akhlak Mazmumah.\n\nGuru melaksanakan pembelajaran tentang akhlak mahmudah atau mazmumah dalam berbagai setting lingkungan belajar, termasuk di rumah, sekolah, dan masyarakat. Guru perlu menentukan instrumen asesmen yang dapat mengukur internalisasi nilai-nilai akhlak pada aspek sikap, pengetahuan, dan keterampilan sesuai dengan karakteristik lingkungan belajar.\n\nBerdasarkan deskripsi tersebut, instrumen asesmen yang paling tepat adalah …",
    "o": [
      "Menggunakan instrumen yang hanya berlaku untuk satu setting lingkungan.",
      "Menentukan instrumen asesmen yang tepat sesuai lingkungan belajar pada aspek sikap, pengetahuan atau keterampilan.",
      "Mengabaikan perbedaan setting dalam penilaian.",
      "Menggunakan instrumen yang tidak mengukur internalisasi nilai.",
      "Menilai tanpa mempertimbangkan konteks lingkungan belajar yang beragam."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi pembelajaran materi aliran-aliran ilmu kalam, tokoh, dan objek pembahasannya.\n\nGuru merancang pembelajaran tentang aliran-aliran ilmu kalam dengan tujuan mengembangkan pemahaman komprehensif peserta didik. Untuk menilai pencapaian tujuan pembelajaran pada aspek sikap, pengetahuan, dan keterampilan, guru perlu menentukan teknik asesmen yang selaras dengan tujuan yang telah ditetapkan.\n\nBerdasarkan deskripsi tersebut, teknik asesmen yang paling tepat adalah …",
    "o": [
      "Menggunakan teknik asesmen yang tidak selaras dengan tujuan pembelajaran.",
      "Menentukan teknik asesmen yang tepat sesuai tujuan pembelajaran pada aspek sikap, pengetahuan atau keterampilan.",
      "Mengabaikan keterkaitan antara teknik asesmen dan tujuan pembelajaran.",
      "Menggunakan satu teknik asesmen untuk semua tujuan pembelajaran.",
      "Menilai tanpa mempertimbangkan aspek sikap dan keterampilan."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi pembelajaran materi aliran tasawuf dan tokoh-tokohnya.\n\nDalam pembelajaran tentang aliran tasawuf dan tokoh-tokohnya, guru telah menetapkan tujuan pembelajaran yang komprehensif mencakup aspek sikap, pengetahuan, dan keterampilan. Untuk mengukur pencapaian tujuan tersebut, guru perlu menentukan instrumen asesmen yang valid dan reliabel sesuai dengan tujuan pembelajaran.\n\nBerdasarkan deskripsi tersebut, instrumen asesmen yang paling tepat adalah …",
    "o": [
      "Menggunakan instrumen asesmen yang tidak valid untuk tujuan pembelajaran.",
      "Menentukan instrumen asesmen yang tepat sesuai tujuan pembelajaran pada aspek sikap, pengetahuan atau keterampilan.",
      "Mengabaikan validitas dan reliabilitas instrumen asesmen.",
      "Menggunakan instrumen yang tidak mencakup aspek sikap spiritual.",
      "Menilai tanpa mempertimbangkan komprehensivitas tujuan pembelajaran."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi pembelajaran materi objek pembahasan tasawuf.\n\nGuru melaksanakan pembelajaran tentang objek pembahasan tasawuf secara berkelanjutan. Dalam siklus pembelajaran yang berkelanjutan, guru perlu menentukan teknik asesmen yang tepat dengan mempertimbangkan hasil asesmen sebelumnya untuk meningkatkan kualitas pembelajaran pada aspek sikap, pengetahuan, dan keterampilan.\n\nBerdasarkan deskripsi tersebut, teknik asesmen yang paling tepat adalah …",
    "o": [
      "Menggunakan teknik asesmen tanpa mempertimbangkan hasil sebelumnya.",
      "Menentukan teknik asesmen yang tepat dengan mempertimbangkan hasil asesmen sebelumnya pada aspek sikap, pengetahuan atau keterampilan.",
      "Mengabaikan siklus berkelanjutan dalam penilaian.",
      "Menggunakan teknik asesmen yang tidak responsif terhadap hasil sebelumnya.",
      "Menilai tanpa tindak lanjut dari asesmen sebelumnya."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi pembelajaran materi objek pembahasan tasawuf.\n\nDalam pembelajaran objek pembahasan tasawuf yang bersifat siklikal dan berkelanjutan, guru perlu menentukan instrumen asesmen yang tidak hanya mengukur capaian akhir, tetapi juga mempertimbangkan hasil asesmen sebelumnya untuk perbaikan pembelajaran berikutnya pada aspek sikap, pengetahuan, dan keterampilan.\n\nBerdasarkan deskripsi tersebut, instrumen asesmen yang paling tepat adalah …",
    "o": [
      "Menggunakan instrumen yang hanya fokus pada capaian akhir tanpa tindak lanjut.",
      "Menentukan instrumen asesmen yang tepat dengan mempertimbangkan hasil asesmen sebelumnya pada aspek sikap, pengetahuan atau keterampilan.",
      "Mengabaikan fungsi formatif dari asesmen berkelanjutan.",
      "Menggunakan instrumen yang tidak mendukung perbaikan pembelajaran.",
      "Menilai tanpa memanfaatkan data hasil asesmen sebelumnya."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi pembelajaran materi pendidikan nilai atau karakter.\n\nGuru melaksanakan pembelajaran pendidikan nilai atau karakter dengan pendekatan yang sistematis. Sebelum melaksanakan pembelajaran, guru telah melakukan asesmen awal untuk memahami profil peserta didik. Berdasarkan hasil asesmen awal tersebut, guru perlu menentukan teknik asesmen yang tepat selama dan setelah pembelajaran pada aspek sikap, pengetahuan, dan keterampilan.\n\nBerdasarkan deskripsi tersebut, teknik asesmen yang paling tepat adalah …",
    "o": [
      "Menggunakan teknik asesmen yang sama tanpa mempertimbangkan hasil asesmen awal.",
      "Menentukan teknik asesmen yang tepat dengan mempertimbangkan hasil asesmen awal pada aspek sikap, pengetahuan atau keterampilan.",
      "Mengabaikan hasil asesmen awal dalam perencanaan asesmen lanjutan.",
      "Menggunakan teknik asesmen yang tidak responsif terhadap profil peserta didik.",
      "Menilai tanpa memanfaatkan informasi dari asesmen diagnostik."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi pembelajaran materi Islam sebagai agama yang moderat.\n\nGuru merancang pembelajaran tentang Islam sebagai agama moderat berdasarkan hasil asesmen awal yang menunjukkan profil dan kebutuhan belajar peserta didik. Untuk menilai perkembangan dan pencapaian pembelajaran, guru perlu menentukan instrumen asesmen yang tepat dengan mempertimbangkan data hasil asesmen awal pada aspek sikap, pengetahuan, dan keterampilan.\n\nBerdasarkan deskripsi tersebut, instrumen asesmen yang paling tepat adalah …",
    "o": [
      "Menggunakan instrumen standar tanpa mempertimbangkan hasil asesmen awal.",
      "Menentukan instrumen asesmen yang tepat dengan mempertimbangkan hasil asesmen awal pada aspek sikap, pengetahuan atau keterampilan.",
      "Mengabaikan data profil peserta didik dari asesmen awal.",
      "Menggunakan instrumen yang tidak diferensiasi berdasarkan kebutuhan peserta didik.",
      "Menilai tanpa memanfaatkan hasil asesmen diagnostik awal."
    ],
    "a": 1
  },
  {
    "q": "Disajikan narasi praktek pembelajaran seorang guru dengan materi aqidah Islam dengan menekankan pada aspek konten, pedagogi dan teknologi yang berpotensi menimbulkan masalah pembelajaran.\n\nSeorang guru merencanakan pembelajaran aqidah Islam dengan konten yang akurat, namun menggunakan pedagogi yang kurang sesuai dengan karakteristik peserta didik dan teknologi yang tidak mendukung interaksi. Hal ini berpotensi menimbulkan masalah pembelajaran. Dari narasi tersebut, identifikasi praktik baik dalam merencanakan pembelajaran yang berkualitas secara berkelanjutan adalah …",
    "o": [
      "Mengabaikan aspek pedagogi dan teknologi dalam perencanaan.",
      "Mengidentifikasi praktik baik/best practice dalam merencanakan pembelajaran yang berkualitas secara berkelanjutan.",
      "Mempertahankan praktik yang berpotensi menimbulkan masalah.",
      "Tidak melakukan refleksi terhadap aspek konten, pedagogi, dan teknologi.",
      "Mengabaikan potensi masalah dalam perencanaan pembelajaran."
    ],
    "a": 1
  },
  {
    "q": "Disajikan narasi praktek pembelajaran seorang guru dengan materi akhlak mahmudah dan akhlak mazmumah dengan menekankan pada aspek konten, pedagogi dan teknologi yang berpotensi menimbulkan masalah pembelajaran.\n\nDalam pelaksanaan pembelajaran akhlak, guru menyajikan konten yang baik dengan bantuan teknologi, namun menggunakan pendekatan pedagogi yang terlalu teacher-centered sehingga peserta didik pasif. Kombinasi ketiga aspek ini perlu direfleksikan untuk meningkatkan kualitas pembelajaran.\n\nBerdasarkan narasi tersebut, identifikasi praktik baik dalam pelaksanaan pembelajaran yang berkualitas secara berkelanjutan adalah …",
    "o": [
      "Mempertahankan pendekatan teacher-centered yang membuat peserta didik pasif.",
      "Mengidentifikasi praktik baik/best practice dalam pelaksanaan pembelajaran yang berkualitas secara berkelanjutan.",
      "Mengabaikan ketidakefektifan pedagogi dalam pembelajaran.",
      "Tidak merefleksikan keseimbangan aspek konten, pedagogi, dan teknologi.",
      "Mengabaikan partisipasi aktif peserta didik dalam pembelajaran."
    ],
    "a": 1
  },
  {
    "q": "Disajikan narasi contoh praktek pembelajaran seorang guru dengan materi aliran-aliran ilmu kalam, tokoh, dan objek pembahasannya dengan menekankan pada aspek konten, pedagogi dan teknologi yang berpotensi menimbulkan masalah pembelajaran.\n\nGuru mengevaluasi pembelajaran tentang aliran ilmu kalam dengan instrumen yang hanya mengukur aspek kognitif semata, padahal konten, pedagogi, dan teknologi yang digunakan seharusnya mendukung pengukuran aspek sikap dan keterampilan juga. Evaluasi perlu direfleksikan secara komprehensif.\n\nBerdasarkan narasi tersebut, identifikasi praktik baik dalam evaluasi pembelajaran yang berkualitas secara berkelanjutan adalah …",
    "o": [
      "Mempertahankan instrumen evaluasi yang hanya mengukur aspek kognitif.",
      "Mengidentifikasi praktik baik/best practice dalam evaluasi pembelajaran yang berkualitas secara berkelanjutan.",
      "Mengabaikan aspek sikap dan keterampilan dalam evaluasi.",
      "Tidak merefleksikan kesesuaian instrumen dengan aspek konten, pedagogi, dan teknologi.",
      "Mengabaikan prinsip evaluasi komprehensif dalam pembelajaran."
    ],
    "a": 1
  },
  {
    "q": "Disajikan narasi kemampuan guru dalam penguasaan materi akidah akhlak di era digital dan AI.\n\nSeorang guru Akidah Akhlak menunjukkan penguasaan materi yang baik dengan mengintegrasikan pemahaman konseptual, pedagogi yang sesuai, dan pemanfaatan teknologi digital serta AI untuk pembelajaran yang bermakna. Kemampuan ini menjadi modal penting bagi pengembangan diri guru secara berkelanjutan.\n\nBerdasarkan narasi tersebut, penilaian kemampuan guru sebagai modal pengembangan diri yang paling tepat adalah …",
    "o": [
      "Mengabaikan penguasaan teknologi digital dan AI dalam penilaian.",
      "Menilai kemampuan guru sebagai modal pengembangan diri guru secara berkelanjutan.",
      "Menilai hanya dari aspek penguasaan konten tanpa pedagogi dan teknologi.",
      "Tidak memanfaatkan kemampuan guru untuk pengembangan diri.",
      "Mengabaikan integrasi ketiga aspek dalam penilaian kemampuan guru."
    ],
    "a": 1
  },
  {
    "q": "Disajikan narasi kemampuan guru dalam penggunaan AI untuk pembelajaran akidah akhlak yang bermakna.\n\nSeorang guru berhasil mengidentifikasi masalah pembelajaran akidah akhlak yang dihadapi peserta didik Gen Z dan Alpha, kemudian merumuskan solusi ilmiah dengan memanfaatkan teknologi AI untuk pembelajaran yang adaptif dan bermakna. Pendekatan ini menunjukkan jati diri guru profesional yang responsif terhadap perkembangan zaman.\n\nBerdasarkan narasi tersebut, identifikasi masalah dan solusinya secara ilmiah untuk menunjukkan jati diri sebagai guru profesional yang paling tepat adalah …",
    "o": [
      "Mengabaikan karakteristik Gen Z dan Alpha dalam pembelajaran.",
      "Mengidentifikasi masalah dan solusinya secara ilmiah untuk menunjukkan jati diri sebagai guru profesional sesuai dengan karakteristik dan Gaya Belajar Peserta Didik Gen Z dan Alpha.",
      "Tidak memanfaatkan teknologi AI untuk solusi pembelajaran.",
      "Mengabaikan pendekatan ilmiah dalam pemecahan masalah.",
      "Tidak menunjukkan responsivitas terhadap perkembangan zaman."
    ],
    "a": 1
  }
]
