[
  {
    "q": "Disajikan deskripsi materi tentang hakikat Akidah Islam dan posisi Akidah dalam ajaran Islam, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah sikap yang paling sesuai dengan indikator tujuan supaya peserta didik dapat meningkatkan keimanan, ketakwaan dan akhlak mulia.\n\nSeorang guru Akidah Akhlak di jenjang menengah menemukan bahwa sebagian peserta didik telah mampu menghafal rukun iman dan dalil-dalil akidah, namun perilaku mereka belum mencerminkan nilai keimanan, seperti kurang jujur, kurang disiplin, dan kurang bertanggung jawab. Guru kemudian merefleksikan bahwa pembelajaran selama ini lebih menekankan aspek kognitif dan belum optimal menyentuh ranah sikap (afektif). Dalam kajian materi, guru kembali menegaskan bahwa Akidah Islam menempati posisi sentral dalam ajaran Islam, karena akidah menjadi landasan bagi ibadah dan akhlak. Akidah yang tertanam kuat seharusnya mendorong peserta didik untuk memiliki ketakwaan kepada Allah SWT serta berperilaku mulia dalam berbagai situasi. Oleh sebab itu, guru berupaya merumuskan tujuan pembelajaran yang tidak hanya berorientasi pada pemahaman konsep, tetapi juga pada pembentukan sikap keimanan dan akhlak yang tercermin dalam tindakan nyata. Berdasarkan penjelasan tersebut, rumusan tujuan pembelajaran ranah sikap yang paling tepat untuk pembelajaran Akidah Islam adalah",
    "o": [
      "Peserta didik dapat menguraikan konsep akidah Islam sebagai dasar ajaran Islam melalui presentasi kelompok.",
      "Peserta didik dapat membandingkan dampak akidah yang benar dan akidah yang menyimpang terhadap kehidupan sosial.",
      "Peserta didik dapat menghafal dan menyebutkan dalil naqli tentang pentingnya akidah dalam Islam.",
      "Peserta didik menunjukkan kesadaran beriman kepada Allah SWT yang tercermin dalam sikap taat beribadah, jujur, disiplin, dan berakhlak mulia.",
      "Peserta didik dapat menyimpulkan keterkaitan antara akidah dan akhlak berdasarkan hasil kajian literatur."
    ],
    "a": 3
  },
  {
    "q": "Disajikan pernyataan materi tentang konsep dasar Asmaul Husna, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan indikator supaya peserta didik mampu berpikir kritis.\n\nSeorang guru menemukan bahwa peserta didik telah mampu menghafal Asmaul Husna dengan baik, namun ketika dihadapkan pada persoalan kehidupan, mereka belum mampu mengaitkan makna Asmaul Husna dengan realitas yang dihadapi. Guru kemudian merefleksikan bahwa tujuan pembelajaran yang dirumuskan selama ini masih berorientasi pada kognitif tingkat rendah, sehingga belum melatih peserta didik untuk berpikir kritis. Dalam perencanaan pembelajaran berikutnya, guru ingin menekankan bahwa konsep dasar Asmaul Husna harus dipahami sebagai sistem makna yang saling berkaitan dan dapat digunakan sebagai landasan berpikir dalam memahami sifat Allah SWT serta implikasinya bagi kehidupan manusia. Oleh sebab itu, guru berupaya merumuskan tujuan pembelajaran ranah pengetahuan yang mampu mendorong peserta didik untuk menganalisis, mengevaluasi, dan menarik kesimpulan secara rasional. Berdasarkan stimulus di atas, rumusan tujuan pembelajaran ranah pengetahuan yang paling tepat untuk melatih kemampuan berpikir kritis peserta didik adalah",
    "o": [
      "Peserta didik dapat menghafal Asmaul Husna beserta arti katanya dengan tepat.",
      "Peserta didik dapat menjelaskan pengertian Asmaul Husna dan kedudukannya dalam akidah Islam.",
      "Peserta didik dapat mengidentifikasi Asmaul Husna yang berkaitan dengan sifat rahmah dan keadilan Allah SWT.",
      "Peserta didik dapat menganalisis perbedaan makna beberapa Asmaul Husna serta mengevaluasi penerapannya dalam sikap manusia sehari-hari.",
      "Peserta didik dapat menyusun daftar Asmaul Husna berdasarkan urutan dalam Al-Qur'an."
    ],
    "a": 3
  },
  {
    "q": "Disajikan pernyataan materi tentang hakikat akhlak Islam dan kedudukan akhlak dalam ajaran Islam, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai dengan indikator supaya peserta didik memiliki semangat gotong royong.\n\nSeorang guru Akidah Akhlak mengamati bahwa sebagian peserta didik telah memahami konsep akhlak Islam dan dapat menjelaskan dalil-dalilnya, namun dalam kegiatan kelas mereka masih kurang bekerja sama, cenderung individualis, dan enggan membantu teman. Guru kemudian menyadari bahwa pembelajaran akhlak selama ini lebih menekankan ranah pengetahuan dan sikap, sementara ranah keterampilan sosial belum dikembangkan secara optimal. Dalam kajian materi, guru kembali menegaskan bahwa kedudukan akhlak dalam Islam sangat sentral, karena akhlak merupakan bukti nyata dari kualitas iman seseorang. Oleh sebab itu, pembelajaran akhlak perlu dirancang agar peserta didik terlibat langsung dalam aktivitas yang melatih kemampuan bekerja sama, berbagi peran, dan bertanggung jawab bersama. Dengan demikian, semangat gotong royong tidak hanya dipahami, tetapi juga menjadi keterampilan yang terlatih secara berkelanjutan. Berdasarkan penjelasan tersebut, rumusan tujuan pembelajaran ranah keterampilan yang paling tepat untuk menumbuhkan semangat gotong royong peserta didik adalah",
    "o": [
      "Peserta didik dapat menyebutkan contoh-contoh perilaku gotong royong dalam perspektif akhlak Islam.",
      "Peserta didik dapat menjelaskan kedudukan akhlak dalam ajaran Islam melalui diskusi kelas.",
      "Peserta didik dapat menunjukkan sikap setuju terhadap pentingnya gotong royong dalam kehidupan sosial.",
      "Peserta didik dapat mempraktikkan kegiatan gotong royong melalui proyek kelompok dengan pembagian tugas yang adil dan tanggung jawab bersama.",
      "Peserta didik dapat mengevaluasi perilaku gotong royong dalam lingkungan masyarakat berdasarkan nilai-nilai Islam."
    ],
    "a": 3
  },
  {
    "q": "Disajikan deskripsi kasus pengembangan materi tentang konsep aliran-aliran dalam ilmu kalam, mahasiswa dapat menentukan rumusan indikator tujuan pembelajaran ranah sikap yang paling sesuai dengan materi supaya peserta didik memiliki sikap penerimaan terhadap tradisi.\n\nDalam diskusi kelas tentang aliran-aliran dalam ilmu kalam, muncul perdebatan antarpeserta didik terkait perbedaan pandangan teologis yang berkembang dalam sejarah Islam. Sebagian peserta didik menganggap hanya satu pandangan yang paling benar, sementara pandangan lain dianggap menyimpang tanpa memahami konteks sejarah dan tradisi keilmuan yang melatarbelakanginya. Guru kemudian merefleksikan bahwa pembelajaran ilmu kalam seharusnya diarahkan untuk membentuk sikap dewasa dan moderat, bukan sekadar penguasaan konsep. Pemahaman terhadap aliran-aliran kalam perlu diiringi dengan sikap penerimaan terhadap tradisi pemikiran Islam yang beragam, sehingga peserta didik mampu bersikap bijak dalam menyikapi perbedaan dan tidak mudah bersikap eksklusif. Oleh sebab itu, guru perlu merumuskan indikator tujuan pembelajaran ranah sikap yang tepat. Berdasarkan stimulus tersebut, indikator tujuan pembelajaran ranah sikap yang paling tepat untuk menumbuhkan sikap penerimaan terhadap tradisi adalah",
    "o": [
      "Peserta didik dapat mengidentifikasi tokoh-tokoh utama dalam setiap aliran ilmu kalam.",
      "Peserta didik dapat menjelaskan persamaan dan perbedaan ajaran pokok antaraliran ilmu kalam.",
      "Peserta didik menunjukkan sikap menghormati dan menerima keberagaman tradisi pemikiran kalam sebagai bagian dari dinamika sejarah Islam.",
      "Peserta didik dapat mengevaluasi kelebihan dan kekurangan masing-masing aliran ilmu kalam secara argumentatif.",
      "Peserta didik dapat menyusun peta konsep tentang perkembangan aliran-aliran dalam ilmu kalam."
    ],
    "a": 2
  },
  {
    "q": "Disajikan deskripsi materi tentang makna objek pembahasan tasawuf beserta dalilnya, mahasiswa dapat menentukan rumusan indikator tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan materi supaya peserta didik memiliki kemampuan berpikir dinamis dan inovatif.\n\nDalam diskusi kelas, guru menemukan bahwa sebagian peserta didik memandang tasawuf hanya sebagai kajian spiritual klasik yang kurang relevan dengan kehidupan kontemporer. Guru kemudian menjelaskan bahwa tasawuf memiliki objek kajian yang bersifat universal dan kontekstual, seperti pengendalian diri, keikhlasan, dan kesadaran spiritual, yang semuanya didukung oleh dalil naqli yang kuat. Guru menekankan bahwa pembelajaran tasawuf seharusnya mampu melatih peserta didik untuk berpikir terbuka, adaptif, dan inovatif, sehingga nilai-nilai tasawuf dapat diterjemahkan menjadi solusi etis dan spiritual terhadap persoalan modern, seperti krisis moral, materialisme, dan disorientasi hidup. Oleh sebab itu, indikator tujuan pembelajaran ranah pengetahuan perlu dirumuskan secara tepat agar peserta didik tidak hanya memahami konsep, tetapi juga mampu mengembangkan pemikiran baru yang relevan. Berdasarkan stimulus tersebut, indikator tujuan pembelajaran ranah pengetahuan yang paling tepat untuk mendorong kemampuan berpikir dinamis dan inovatif peserta didik adalah",
    "o": [
      "Peserta didik dapat menjelaskan definisi tasawuf menurut para tokoh klasik.",
      "Peserta didik dapat menyebutkan dalil naqli yang menjadi dasar ajaran tasawuf.",
      "Peserta didik dapat mengidentifikasi objek-objek utama pembahasan tasawuf.",
      "Peserta didik dapat mengevaluasi makna objek pembahasan tasawuf dan merumuskan ide-ide baru penerapannya dalam kehidupan kekinian.",
      "Peserta didik dapat merangkum materi tasawuf beserta dalil-dalilnya dalam bentuk ringkasan tertulis."
    ],
    "a": 3
  },
  {
    "q": "Disajikan deskripsi aktivitas pembelajaran guru dalam perencanaan tujuan pembelajaran pada materi aqidah Islam dengan pendekatan PBL, mahasiswa dapat menganalisis materi ajar Allah dan Kemaha-Esa-an Allah berdasarkan struktur keilmuan pada perencanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik.\n\nIn dalam merancang pembelajaran Aqidah Islam berbasis Problem Based Learning (PBL), seorang guru menentukan bahwa materi Allah dan Kemaha-Esa-an Allah harus disajikan secara sistematis, mulai dari pengenalan konsep tauhid, penguatan dalil, hingga implikasinya dalam kehidupan peserta didik. Guru memilih masalah nyata yang dekat dengan kehidupan siswa, seperti perilaku menyandarkan harapan pada selain Allah atau menganggap semua keyakinan sama. Guru kemudian menyusun tujuan pembelajaran yang memungkinkan peserta didik mengonstruksi pengetahuan secara aktif, bukan sekadar menerima informasi. Dalam hal ini, struktur keilmuan akidah dijadikan dasar dalam merumuskan tujuan, sementara karakteristik peserta didik—seperti kebutuhan akan bimbingan bertahap dan pembelajaran kontekstual—menjadi pertimbangan utama agar tujuan pembelajaran realistis dan bermakna. Berdasarkan penjelasan tersebut, rumusan tujuan pembelajaran yang paling tepat secara analitis untuk materi Allah dan Kemaha-Esa-an Allah dengan pendekatan PBL adalah",
    "o": [
      "Peserta didik dapat menghafal dalil Al-Qur’an tentang keesaan Allah dengan benar.",
      "Peserta didik dapat menjelaskan pengertian tauhid rububiyah, uluhiyah, dan asma’ wa sifat.",
      "Peserta didik dapat mengidentifikasi contoh perilaku yang mencerminkan keimanan kepada Allah.",
      "Peserta didik dapat menganalisis masalah ketauhidan dalam kehidupan sehari-hari dengan mengaitkan konsep keesaan Allah, dalil naqli–aqli, dan tingkat pemahaman peserta didik.",
      "Peserta didik dapat menyimpulkan isi materi Allah dan Kemaha-Esa-an Allah melalui presentasi kelompok."
    ],
    "a": 3
  },
  {
    "q": "Disajikan deskripsi aktivitas guru dalam pelaksanaan tujuan pembelajaran pada materi Asmaul Husna dengan pendekatan PjBL, mahasiswa dapat menganalisis materi ajar makna dan sifat Asmaul Husna berdasarkan struktur keilmuan pada pelaksanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik.\n\nDalam pelaksanaan pembelajaran Asmaul Husna berbasis Project Based Learning (PjBL), guru merancang kegiatan proyek yang menuntut peserta didik membuat infografis tentang penerapan sifat-sifat Allah dalam kehidupan sosial. Guru memastikan alur materi bergerak dari pemahaman mendalam tentang makna teologis sifat Allah (kognitif) menuju penerapan nilai-nilai tersebut dalam konteks sosial (afektif dan keterampilan). Guru juga menyesuaikan tingkat kesulitan proyek dengan kemampuan peserta didik menengah. Berdasarkan analisis struktur keilmuan dan karakteristik peserta didik, pelaksanaan tujuan pembelajaran yang paling sesuai adalah",
    "o": [
      "Guru meminta peserta didik menghafal 99 Asmaul Husna dan artinya sebelum memulai proyek.",
      "Guru menekankan hanya pada keindahan desain infografis tanpa meninjau akurasi konten teologis.",
      "Guru membimbing peserta didik mengaitkan makna mendalam Asmaul Husna dengan contoh nyata dalam kehidupan sehari-hari melalui proyek kelompok.",
      "Guru membiarkan peserta didik memilih sifat Allah secara acak tanpa memperhatikan relevansinya dengan masalah sosial.",
      "Guru fokus pada teori sejarah kodifikasi Asmaul Husna tanpa mengaitkannya dengan perilaku."
    ],
    "a": 2
  },
  {
    "q": "Disajikan deskripsi kasus pengembangan materi tentang konsep aliran-aliran dalam ilmu kalam, mahasiswa dapat menentukan rumusan indikator tujuan pembelajaran ranah afektif/sikap yang paling sesuai dengan materi supaya peserta didik memiliki sikap moderat (tawasuth).\n\nDalam diskusi kelas tentang perbedaan pandangan teologis (contoh: Mu'tazilah dan Asy'ariyah), guru mengamati siswa cenderung fanatik pada satu pandangan dan menyalahkan yang lain. Materi tentang ilmu kalam tidak hanya bertujuan memahami sejarah, tetapi membentuk kerangka berpikir. Berdasarkan kisi-kisi UP PPG, fokus ranah afektif dalam materi ini adalah membangun sikap moderat dan menghargai perbedaan. Rumusan indikator tujuan pembelajaran ranah sikap yang paling tepat adalah",
    "o": [
      "Peserta didik dapat menyebutkan rukun-rukun iman menurut aliran tertentu.",
      "Peserta didik menunjukkan sikap terbuka dan menghargai perbedaan pandangan dalam memahami akidah Islam.",
      "Peserta didik dapat menyusun makalah sejarah perkembangan ilmu kalam.",
      "Peserta didik dapat menjelaskan perbedaan dalil yang digunakan oleh aliran-aliran kalam.",
      "Peserta didik mampu menghafal argumen-argumen tokoh kalam."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi materi tentang makna objek pembahasan tasawuf beserta dalilnya, mahasiswa dapat menentukan rumusan indikator tujuan pembelajaran ranah afektif yang paling sesuai dengan materi supaya peserta didik memiliki sikap zuhud dan wara'.\n\nDalam konteks materi tasawuf, guru ingin peserta didik tidak hanya memahami secara teoretis, tetapi juga menginternalisasi nilai-nilai spiritual dalam kehidupan sehari-hari yang cenderung materialistis. Fokus tujuan pembelajaran adalah membentuk sikap zuhud (tidak berlebihan terhadap dunia) dan wara' (berhati-hati dari yang syubhat). Indikator yang paling mencerminkan ketercapaian ranah afektif adalah",
    "o": [
      "Peserta didik dapat menjelaskan definisi zuhud dan wara' menurut para sufi.",
      "Peserta didik mampu menguraikan dalil naqli tentang keutamaan perilaku zuhud.",
      "Peserta didik menunjukkan perilaku hemat dan berhati-hati dalam bertindak sebagai implementasi nilai zuhud dan wara'.",
      "Peserta didik dapat menganalisis perbedaan tasawuf amali dan tasawuf falsafi.",
      "Peserta didik dapat menyebutkan tokoh-tokoh sufi yang terkenal dengan sikap wara'-nya."
    ],
    "a": 2
  },
  {
    "q": "Disajikan pernyataan praktik pedagogi tentang pelaksanaan materi ajar aliran tasawuf atau tokoh-tokohnya secara logis dengan pendekatan DL, mahasiswa dapat menentukan alur materi ajar tentang sejarah munculnya tasawuf, faktor-faktor yang melatarbelakanginya dalam pelaksanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik.\n\nDalam pelaksanaan pembelajaran berbasis Discovery Learning (DL), guru menyajikan materi aliran tasawuf dan tokoh-tokohnya melalui sumber belajar yang beragam, seperti teks sejarah, ilustrasi kondisi masyarakat Islam awal, dan kisah kehidupan para sufi. Peserta didik diarahkan untuk menemukan sendiri hubungan antara realitas sosial, perkembangan pemikiran keagamaan, dan lahirnya tasawuf. Guru menyusun tujuan pembelajaran agar peserta didik mampu memahami tasawuf secara kontekstual. Oleh karena itu, alur materi dirancang dari pengamatan fakta sejarah, dilanjutkan dengan penemuan faktor-faktor yang melatarbelakangi, hingga pada pemaknaan konseptual yang sesuai dengan tingkat perkembangan kognitif peserta didik. Berdasarkan kasus tersebut, alur materi ajar yang paling sesuai dengan pendekatan Discovery Learning dan karakteristik peserta didik adalah",
    "o": [
      "Menyajikan ajaran tasawuf secara konseptual, kemudian menambahkan sejarah singkat kemunculannya.",
      "Mengarahkan peserta didik mengamati fakta sejarah, menemukan faktor penyebab, dan menyimpulkan konsep tasawuf secara mandiri.",
      "Memusatkan pembelajaran pada biografi tokoh tasawuf sebelum membahas latar belakang kemunculannya.",
      "Menjelaskan faktor-faktor tasawuf terlebih dahulu, lalu menyajikan sejarah dan tokohnya secara umum.",
      "Menyusun materi tasawuf berdasarkan istilah-istilah kunci tanpa proses penemuan bertahap."
    ],
    "a": 1
  },
  {
    "q": "11. Disajikan deskripsi materi tentang hakikat Akidah Islam dan posisi Akidah dalam ajaran Islam, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah sikap yang paling sesuai dengan indikator tujuan supaya peserta didik dapat meningkatkan keimanan, ketakwaan dan akhlak mulia.\n\nSeorang guru Akidah Akhlak di jenjang menengah menemukan bahwa sebagian peserta didik telah mampu menghafal rukun iman dan dalil-dalil akidah, namun perilaku mereka belum mencerminkan nilai keimanan, seperti kurang jujur, kurang disiplin, dan kurang bertanggung jawab. Guru kemudian merefleksikan bahwa pembelajaran selama ini lebih menekankan aspek kognitif dan belum optimal menyentuh ranah sikap (afektif). Dalam kajian materi, guru kembali menegaskan bahwa Akidah Islam menempati posisi sentral dalam ajaran Islam, karena akidah menjadi landasan bagi ibadah dan akhlak. Akidah yang tertanam kuat seharusnya mendorong peserta didik untuk memiliki ketakwaan kepada Allah SWT serta berperilaku mulia dalam berbagai situasi. Oleh sebab itu, guru berupaya merumuskan tujuan pembelajaran yang tidak hanya berorientasi pada pemahaman konsep, tetapi juga pada pembentukan sikap keimanan dan akhlak yang tercermin dalam tindakan nyata. Berdasarkan penjelasan tersebut, rumusan tujuan pembelajaran ranah sikap yang paling tepat untuk pembelajaran Akidah Islam adalah",
    "o": [
      "Peserta didik dapat menguraikan konsep akidah Islam sebagai dasar ajaran Islam melalui presentasi kelompok.",
      "Peserta didik dapat membandingkan dampak akidah yang benar dan akidah yang menyimpang terhadap kehidupan sosial.",
      "Peserta didik dapat menghafal dan menyebutkan dalil naqli tentang pentingnya akidah dalam Islam.",
      "Peserta didik menunjukkan kesadaran beriman kepada Allah SWT yang tercermin dalam sikap taat beribadah, jujur, disiplin, dan berakhlak mulia.",
      "Peserta didik dapat menyimpulkan keterkaitan antara akidah dan akhlak berdasarkan hasil kajian literatur."
    ],
    "a": 3
  },
  {
    "q": "12. Disajikan narasi tentang evaluasi pembelajaran materi Asmaul Husna, mahasiswa dapat menentukan instrumen penilaian sikap yang tepat sesuai dengan indikator pencapaian kompetensi afektif.\n\nDalam sebuah pembelajaran materi Asmaul Husna (Al-Ghaffar dan Al-Afuww), guru ingin mengetahui apakah peserta didik tidak hanya hafal maknanya, tetapi juga mengimplementasikannya dalam bentuk sikap pemaaf dan tidak pendendam kepada teman sejawat. Guru memerlukan instrumen penilaian yang objektif untuk mengukur perubahan perilaku tersebut secara berkelanjutan. Instrumen penilaian yang paling tepat digunakan adalah",
    "o": [
      "Soal tes objektif pilihan ganda tentang arti Asmaul Husna.",
      "Tes lisan berupa hafalan dalil-dalil tentang Asmaul Husna.",
      "Lembar observasi jurnal sikap pemaaf dan catatan anekdot perilaku sehari-hari.",
      "Tugas membuat poster tentang keindahan kaligrafi Asmaul Husna.",
      "Ujian akhir semester dengan soal essay tingkat tinggi."
    ],
    "a": 2
  },
  {
    "q": "13. Disajikan pernyataan praktik pedagogi tentang pelaksanaan program Penguatan profil pelajar rahmatan lil alami (PPRA) secara logis, mahasiswa dapat menentukan pengembangan materi ajar nilai-nilai PPRA dalam melaksanakan tujuan pembelajaran sesuai dengan karakteristik peserta didik.\n\nDalam pelaksanaan pembelajaran PAI berbasis Program Penguatan Profil Pelajar Rahmatan lil ‘Alamin (PPRA), seorang guru merancang aktivitas pembelajaran kolaboratif berupa dialog lintas pandangan, simulasi pemecahan konflik sosial, dan refleksi nilai keislaman yang menekankan sikap inklusif, humanis, dan anti-kekerasan. Guru menyesuaikan pelaksanaan tujuan pembelajaran dengan karakteristik peserta didik yang berada pada fase remaja, memiliki kecenderungan berpikir kritis, serta kebutuhan untuk menumbuhkan sikap reflektif dan tanggung jawab sosial. Berdasarkan penjelasan tersebut, pengembangan materi ajar nilai-nilai PPRA yang paling sesuai untuk melaksanakan tujuan pembelajaran adalah",
    "o": [
      "Materi PPRA yang berisi uraian konseptual tentang rahmatan lil ‘alamin tanpa aktivitas pendukung pembelajaran.",
      "Materi PPRA yang mengaitkan nilai Islam moderat dengan pengalaman sosial peserta didik melalui dialog, simulasi, dan refleksi.",
      "Materi PPRA yang disusun dalam bentuk modul bacaan mandiri dan evaluasi berbasis tes tertulis.",
      "Materi PPRA yang memisahkan nilai rahmatan lil ‘alamin dari konteks kehidupan peserta didik.",
      "Materi PPRA yang menekankan penguasaan istilah dan konsep tanpa penerapan sikap dan perilaku."
    ],
    "a": 1
  },
  {
    "q": "14. Disajikan pernyataan praktik pedagog atau praktek di masyarakat tentang imlementasi nilai-nilai moderasi beragama secara logis, mahasiswa dapat menentukan pengembangan materi ajar niali-nilai Islam sebagai agama moderat atau wasathiyah yang tepat sesuai dengan implementasi moderasi beragama dalam mengevaluasi tujuan pembelajaran sesuai dengan karakteristik peserta didik.\n\nDalam sebuah kegiatan pembelajaran PAI, guru memanfaatkan pengalaman peserta didik yang tinggal di lingkungan multikultural untuk mengevaluasi pemahaman mereka tentang moderasi beragama. Peserta didik diminta merefleksikan pengalaman interaksi sosial lintas budaya dan agama, kemudian mengaitkannya dengan nilai-nilai Islam sebagai agama yang adil, seimbang, dan mengedepankan kemaslahatan bersama. Evaluasi pembelajaran dirancang untuk menyesuaikan dengan karakteristik peserta didik yang beragam, baik dari sisi latar belakang keluarga, tingkat pemahaman keagamaan, maupun kemampuan berpikir kritis. Berdasarkan penjelasan tersebut, pengembangan materi ajar nilai-nilai Islam sebagai agama moderat (wasathiyah) yang paling sesuai untuk mengevaluasi tujuan pembelajaran adalah",
    "o": [
      "Materi yang menyajikan konsep moderasi beragama secara teoritis tanpa melibatkan refleksi pengalaman peserta didik.",
      "Materi yang mengaitkan nilai wasathiyah Islam dengan pengalaman nyata peserta didik melalui refleksi, diskusi, dan analisis sosial.",
      "Materi yang disusun dalam bentuk modul bacaan mandiri dan penilaian berbasis tes objektif.",
      "Materi yang memisahkan praktik moderasi beragama dari tujuan evaluasi pembelajaran PAI.",
      "Materi yang menekankan penguasaan istilah dan konsep tanpa penilaian sikap dan penerapan."
    ],
    "a": 1
  },
  {
    "q": "15. Disajikan pernyataan praktik pedagogi atau praktek di masyarakat tentang alasan imlementasi nilai-nilai moderasi beragama, mahasiswa dapat menilai pegembangan materi ajar Islam sebagai agama moderat atau wasathiyah dengan alasan yang tepat sesuai dengan implementasi moderasi beragama.\n\nDalam pelaksanaan pembelajaran PAI, guru memanfaatkan kasus nyata di masyarakat terkait munculnya sikap ekstrem dalam beragama yang berdampak pada hubungan sosial. Guru menjelaskan bahwa penerapan nilai-nilai moderasi beragama bertujuan menanamkan sikap adil, seimbang, dan bijaksana dalam menyikapi perbedaan, tanpa mengurangi komitmen keagamaan peserta didik. Guru kemudian menilai kembali materi ajar yang digunakan agar alasan pengembangan Islam sebagai agama moderat dapat dipahami peserta didik secara logis dan sesuai dengan tingkat kedewasaan berpikir mereka. Berdasarkan penjelasan tersebut, penilaian pengembangan materi ajar Islam sebagai agama moderat (wasathiyah) yang paling sesuai dengan alasan implementasi moderasi beragama adalah",
    "o": [
      "Materi yang menekankan penyeragaman cara pandang keagamaan untuk menghindari perbedaan.",
      "Materi yang mengembangkan pemahaman Islam wasathiyah dengan alasan membentuk sikap adil, toleran, dan bertanggung jawab dalam kehidupan sosial.",
      "Materi yang disusun dalam bentuk modul konseptual tanpa keterkaitan dengan persoalan sosial peserta didik.",
      "Materi yang memisahkan tujuan moderasi beragama dari pembentukan sikap dan perilaku peserta didik.",
      "Materi yang menitikberatkan pada penguasaan istilah moderasi beragama tanpa evaluasi nilai dan sikap."
    ],
    "a": 1
  },
  {
    "q": "16. Disajikan deskripsi penerapan pembelajaran dengan materi tauhid dan berbagai aspeknya sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan materi pembelajaran.\n\nDalam rangka mengajarkan konsep tauhid uluhiyah dan rububiyah, seorang guru ingin menggunakan pendekatan Pembelajaran Berbasis Masalah (Problem Based Learning/PBL). Guru harus memilih rancangan pembelajaran yang mampu mendorong peserta didik menemukan makna tauhid melalui situasi problematis yang sesuai dengan struktur keilmuan. Rancangan pembelajaran berbasis masalah yang paling tepat dipilih untuk mengajarkan konsep tauhid tersebut adalah:",
    "o": [
      "Memberikan ceramah panjang lebar tentang konsep tauhid kemudian meminta siswa menghafalnya.",
      "Menyajikan kasus nyata tentang penyimpangan tauhid dalam kehidupan modern dan meminta siswa menganalisis solusinya berdasarkan prinsip-prinsip tauhid.",
      "Memberikan daftar istilah dalam ilmu tauhid dan meminta siswa menghafalkannya untuk ujian.",
      "Menugaskan siswa membuat poster bertema tauhid tanpa mengaitkan dengan problem aktual.",
      "Menjelaskan seluruh aspek tauhid secara terperinci tanpa mengajak siswa memecahkan masalah."
    ],
    "a": 1
  },
  {
    "q": "17. Disajikan pernyataan penerapan pembelajaran dengan materi tauhid dan berbagai aspeknya dalam kehidupan sehari-hari sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan pengetahuan pedagogik.\n\nDalam perencanaan pembelajaran tauhid asma wa shifat, guru ingin agar siswa mampu melihat keterkaitan antara keyakinan terhadap sifat-sifat Allah dan sikap hidup sehari-hari. Guru memilih pendekatan berbasis masalah agar siswa aktif berpikir dan menemukan konsep itu dalam kehidupan nyata. Pilihan rancangan pembelajaran berbasis masalah yang paling tepat dalam konteks tersebut adalah:",
    "o": [
      "Menyajikan masalah tentang sikap putus asa dalam hidup, lalu meminta siswa menganalisisnya berdasarkan keyakinan sifat Allah Al-Rahman dan Al-Rahim.",
      "Menyuruh siswa menghafal 99 Asmaul Husna dalam waktu singkat.",
      "Memberikan ceramah panjang tentang sifat-sifat Allah tanpa aktivitas siswa.",
      "Memberikan tugas tertulis tentang definisi sifat Allah dari buku teks.",
      "Menguji siswa dengan soal pilihan ganda tentang nama-nama Allah."
    ],
    "a": 0
  },
  {
    "q": "18. Disajikan deskripsi kasus penerapan pembelajaran dengan materi nilai-nilai asmaul husna dalam kehidupan sehari-hari sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan pengetahuan teknologi.\n\nSeorang guru ingin menerapkan pembelajaran nilai-nilai Asmaul Husna, khususnya tentang sifat Al-Adl (Maha Adil), dalam kehidupan sehari-hari. Guru ingin menggunakan platform teknologi seperti forum diskusi daring, agar siswa dapat mengeksplorasi kasus ketidakadilan di lingkungan mereka dan mengaitkannya dengan sifat Allah. Guru berencana menggunakan pendekatan pembelajaran berbasis masalah (PBL). Berdasarkan pengetahuan teknologi, rancangan pembelajaran berbasis masalah yang paling tepat adalah:",
    "o": [
      "Membuka forum daring, menyajikan kasus ketidakadilan di masyarakat, lalu meminta siswa berdiskusi dan menemukan solusi berdasarkan nilai Al-Adl.",
      "Mengirimkan materi tentang sifat Al-Adl dalam bentuk PDF untuk dibaca mandiri oleh siswa.",
      "Menayangkan video ceramah tentang Al-Adl, lalu meminta siswa membuat rangkuman.",
      "Memberikan soal pilihan ganda di aplikasi pembelajaran tentang definisi Al-Adl.",
      "Menginstruksikan siswa untuk mencari artikel tentang Al-Adl, kemudian menyalinnya ke dalam tugas tertulis."
    ],
    "a": 0
  },
  {
    "q": "19. Disajikan deskripsi kasus penerapan pembelajaran dengan materi macam-macam akhlak terpuji (mahmudah) dan akhlak tercela (mazmumah) sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis perbedaan individu sesuai dengan materi pembelajaran.\n\nDalam sebuah kelas, siswa memiliki latar belakang budaya dan karakteristik yang sangat beragam. Untuk mengajarkan materi akhlak terpuji seperti amanah dan tanggung jawab, guru ingin menggunakan pendekatan pembelajaran berbasis perbedaan individu (diferensiasi). Guru berencana menyesuaikan kegiatan pembelajaran berdasarkan minat dan kemampuan masing-masing siswa. Berdasarkan konsep pembelajaran berbasis perbedaan individu, rancangan yang paling tepat adalah:",
    "o": [
      "Membagi siswa menjadi kelompok berdasarkan minat mereka, lalu meminta masing-masing kelompok merancang proyek kecil tentang praktik amanah di lingkungan sekolah.",
      "Menyampaikan ceramah panjang tentang pentingnya amanah dan siswa diminta mendengarkan dengan baik.",
      "Menyuruh semua siswa membaca buku teks yang sama lalu mengerjakan soal pilihan ganda.",
      "Memberikan tugas hafalan tentang definisi amanah dan membuat resumenya.",
      "Menilai semua siswa dengan satu jenis soal ujian tertulis berupa soal essay yang panjang."
    ],
    "a": 0
  },
  {
    "q": "20. Disajikan pernyataan kasus penerapan pembelajaran dengan materi ajar kontribusi tokoh-tokoh utama dalam Ilmu Kalam sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis perbedaan individu sesuai dengan pengetahuan pedagogi.\n\nDalam sebuah kelas Aqidah Akhlak, guru hendak mengajarkan kontribusi tokoh-tokoh besar Ilmu Kalam, seperti Imam Al-Asy’ari dan Imam Al-Maturidi. Peserta didik memiliki gaya belajar berbeda: ada yang lebih unggul dalam visualisasi, verbal, dan kinestetik. Guru berencana menerapkan pendekatan pembelajaran berbasis perbedaan individu (diferensiasi) agar semua siswa terlibat aktif sesuai dengan kekuatan mereka. Rancangan pembelajaran berbasis perbedaan individu yang paling tepat untuk kasus tersebut adalah:",
    "o": [
      "Menyiapkan pilihan kepada siswa: membuat poster tentang perbedaan pemikiran tokoh Ilmu Kalam, menyusun artikel ilmiah pendek, atau membuat video drama biografi tokoh.",
      "Menyampaikan ceramah panjang tentang sejarah Ilmu Kalam dan memberikan soal pilihan ganda untuk semua siswa.",
      "Mengarahkan seluruh siswa membaca satu buku referensi lalu membuat rangkuman bersama.",
      "Membuat ujian tulis yang isinya mengharuskan siswa menghafal pendapat para tokoh Ilmu Kalam.",
      "Meminta semua siswa untuk menyanyikan lagu tentang biografi tokoh kalam secara bersama-sama."
    ],
    "a": 0
  },
  {
    "q": "21. Disajikan deskripsi kasus penerapan pembelajaran dengan materi ajar perilaku tercela (mazmumah) dalam kehidupan sehari-hari, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis teknologi sesuai dengan struktur keilmuan.\n\nDalam kelas Akidah Akhlak, guru ingin mengajarkan dampak negatif perilaku tercela seperti *hasad* (iri hati) dan *ghibah* (menggunjing) menggunakan pendekatan teknologi (TPACK). Tujuan pembelajarannya adalah agar siswa mampu menganalisis dampak sosial dan spiritual dari perilaku tersebut berdasarkan struktur keilmuan akhlak. Rancangan pembelajaran berbasis teknologi yang paling tepat adalah:",
    "o": [
      "Meminta siswa menghafal definisi perilaku tercela dari buku paket.",
      "Menayangkan video dokumenter tentang kasus *cyberbullying* dan meminta siswa menganalisis keterkaitannya dengan perilaku *hasad* dan *ghibah* melalui *platform* diskusi daring.",
      "Memberikan ceramah mengenai bahaya ghibah tanpa menggunakan media apapun.",
      "Menugaskan siswa membuat laporan tertulis tentang pengertian perilaku tercela tanpa contoh kasus.",
      "Mengadakan ujian tulis harian mengenai sejarah munculnya perilaku tercela."
    ],
    "a": 1
  },
  {
    "q": "22. Disajikan deskripsi kasus penerapan pembelajaran materi Akhlak Terpuji (Mahmudah) sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan berbasis teknologi (TPACK) dalam pembelajaran PAI.\n\nDalam mengajarkan materi akhlak terpuji seperti *sabar* dan *syukur*, guru ingin menggunakan media teknologi untuk memudahkan siswa memahami konsep secara konkret dan kontekstual. Rancangan pembelajaran berbasis teknologi yang paling sesuai adalah:",
    "o": [
      "Menggunakan aplikasi presentasi (PowerPoint) untuk menampilkan slide definisi sabar dan syukur.",
      "Membuat simulasi virtual atau *game* edukasi tentang pengambilan keputusan yang mencerminkan sikap sabar dan syukur dalam kehidupan sehari-hari.",
      "Meminta siswa membaca e-book tentang biografi tokoh-tokoh sufi.",
      "Menayangkan film pendek tentang kesabaran tanpa adanya diskusi atau analisis lanjut.",
      "Memberikan kuis online berupa pertanyaan benar-salah mengenai pengertian dasar mahmudah."
    ],
    "a": 1
  },
  {
    "q": "23. Disajikan deskripsi aktivitas evaluasi pembelajaran materi Akidah Islam, mahasiswa dapat menentukan instrumen penilaian keterampilan yang sesuai untuk mengukur kemampuan siswa dalam mempraktikkan nilai-nilai akidah.\n\nSeorang guru Akidah Akhlak ingin mengevaluasi kemampuan peserta didik dalam menerapkan perilaku tauhid dalam kehidupan sehari-hari (contoh: bersikap jujur dan tidak menyontek saat ujian). Instrumen penilaian keterampilan yang paling tepat untuk mengukur pencapaian tersebut adalah:",
    "o": [
      "Soal tes tertulis bentuk esai tentang pengertian tauhid.",
      "Lembar observasi perilaku (checklist) yang diisi oleh guru dan teman sejawat selama kegiatan di sekolah.",
      "Tes lisan tentang nama-nama Allah dalam Asmaul Husna.",
      "Ujian praktik hafalan dalil naqli.",
      "Kuisioner tentang pendapat siswa mengenai kejujuran."
    ],
    "a": 1
  },
  {
    "q": "24. Disajikan deskripsi situasi kelas dengan karakteristik peserta didik yang beragam (visual, auditori, kinestetik), mahasiswa dapat memilih model pembelajaran yang paling tepat untuk materi Ilmu Kalam.\n\nGuru Aqidah Akhlak ingin mengajarkan materi sejarah aliran-aliran Ilmu Kalam. Siswa di kelas memiliki gaya belajar yang berbeda-beda. Model pembelajaran yang paling sesuai untuk mengakomodasi keberagaman karakteristik peserta didik tersebut adalah:",
    "o": [
      "Model *Direct Instruction* (pembelajaran langsung) dengan ceramah intensif.",
      "Model *Project Based Learning* (PjBL) di mana siswa bebas memilih bentuk laporan hasil karya (visual, audio, atau kinestetik).",
      "Model *Lecture Based Learning* dengan fokus pada buku teks.",
      "Model *drill* untuk menghafal nama-nama tokoh.",
      "Model konvensional dengan diskusi searah dari guru ke siswa."
    ],
    "a": 1
  },
  {
    "q": "25. Disajikan deskripsi materi tentang Akhlak terhadap Lingkungan, mahasiswa dapat merumuskan tujuan pembelajaran ranah kognitif tingkat tinggi (HOTS) sesuai dengan struktur keilmuan.\n\nDalam materi tentang Akhlak terhadap Lingkungan, guru bertujuan agar siswa memahami bahwa menjaga alam adalah bagian dari iman. Rumusan tujuan pembelajaran ranah kognitif tingkat tinggi (HOTS) yang paling tepat adalah:",
    "o": [
      "Peserta didik dapat menyebutkan lima cara menjaga kebersihan lingkungan.",
      "Peserta didik dapat menjelaskan definisi kerusakan lingkungan menurut ayat Al-Qur'an.",
      "Peserta didik dapat menganalisis hubungan antara perilaku manusia, kerusakan lingkungan, dan dampak teologisnya menurut ajaran Islam.",
      "Peserta didik dapat menghafal dalil naqli tentang larangan berbuat kerusakan di muka bumi.",
      "Peserta didik dapat mengidentifikasi jenis-jenis sampah organik dan anorganik."
    ],
    "a": 2
  },
  {
    "q": "26. Disajikan kasus tentang rendahnya minat baca siswa terhadap buku teks Akidah Akhlak, mahasiswa dapat memilih solusi berbasis pedagogik inovatif.\n\nGuru mengamati bahwa siswa kurang antusias membaca buku teks yang padat materi. Untuk mengatasi hal tersebut dan meningkatkan pemahaman materi akhlak, solusi pedagogik yang paling tepat adalah:",
    "o": [
      "Memberikan hukuman bagi siswa yang tidak membaca buku teks.",
      "Menerapkan model pembelajaran *Storytelling* (bercerita) menggunakan kisah-kisah inspiratif dari buku teks tersebut.",
      "Mengganti buku teks dengan modul baru yang lebih tebal.",
      "Meminta siswa membuat rangkuman buku teks tanpa diskusi.",
      "Melanjutkan metode ceramah seperti biasa."
    ],
    "a": 1
  },
  {
    "q": "27. Disajikan deskripsi penerapan nilai-nilai tasawuf, mahasiswa dapat memilih rancangan aktivitas pembelajaran yang menekankan pada pendidikan karakter (spiritualitas).\n\nGuru ingin menanamkan nilai *ikhlas* dan *tawakal* dalam materi tasawuf. Aktivitas pembelajaran yang paling tepat untuk menekankan pada pendidikan karakter spiritualitas adalah:",
    "o": [
      "Diskusi kelompok mengenai sejarah perkembangan tasawuf.",
      "Simulasi atau refleksi diri di mana siswa menuliskan pengalaman hidup dan memaknainya dengan nilai ikhlas dan tawakal.",
      "Ujian tulis tentang biografi tokoh-tokoh sufi.",
      "Hafalan ayat-ayat tentang tasawuf.",
      "Membuat makalah tentang perbedaan tasawuf dan ilmu kalam."
    ],
    "a": 1
  },
  {
    "q": "28. Disajikan kasus tentang kesalahpahaman konsep akidah di kalangan siswa, mahasiswa dapat menentukan langkah perbaikan pembelajaran (remedial) yang tepat.\n\nBerdasarkan hasil tes, sebagian besar siswa masih salah dalam membedakan antara *Syirik Besar* dan *Syirik Kecil*. Langkah perbaikan pembelajaran (remedial) yang paling tepat adalah:",
    "o": [
      "Memberikan tes ulang dengan soal yang sama tanpa penjelasan.",
      "Mengadakan sesi diskusi ulang menggunakan peta konsep (*concept map*) untuk visualisasi perbedaan keduanya.",
      "Meminta siswa membaca ulang buku teks secara mandiri.",
      "Memberikan tugas tambahan menghafal definisi tanpa bimbingan.",
      "Melanjutkan materi ke pokok bahasan selanjutnya."
    ],
    "a": 1
  },
  {
    "q": "29. Disajikan pernyataan mengenai penggunaan teknologi dalam pembelajaran materi Asmaul Husna, mahasiswa dapat menilai efektivitas penggunaan media berbasis *Augmented Reality* (AR).\n\nGuru menggunakan aplikasi *Augmented Reality* (AR) untuk menampilkan proyeksi 3D mengenai kebesaran ciptaan Allah dalam materi Asmaul Husna *Al-Khaliq*. Penilaian yang tepat mengenai efektivitas penggunaan media ini adalah:",
    "o": [
      "Media ini tidak efektif karena membuat siswa bermain game.",
      "Media ini sangat efektif untuk meningkatkan *engagement* dan pemahaman visual siswa terhadap konsep *Al-Khaliq* secara konkret.",
      "Media ini hanya membuang waktu dan biaya.",
      "Media ini tidak relevan dengan struktur keilmuan akidah.",
      "Media ini membuat siswa malas membaca dalil."
    ],
    "a": 1
  },
  {
    "q": "30. Disajikan deskripsi tentang pentingnya jati diri guru profesional dalam mengajarkan Akidah Akhlak, mahasiswa dapat menentukan sikap yang paling tepat.\n\nSebagai guru Akidah Akhlak, Anda menyadari bahwa pembelajaran tidak hanya transfer pengetahuan (*transfer of knowledge*), tetapi juga penanaman nilai (*transfer of values*). Sikap yang paling tepat menunjukkan jati diri guru profesional adalah:",
    "o": [
      "Hanya fokus mengajar di kelas sesuai dengan jam pelajaran.",
      "Menjadi teladan (*uswah hasanah*) dalam berperilaku jujur, disiplin, dan santun di dalam maupun luar sekolah.",
      "Memberikan nilai tinggi agar siswa senang.",
      "Menggunakan teknologi canggih tanpa memperhatikan materi.",
      "Menyerahkan sepenuhnya pembentukan karakter kepada orang tua."
    ],
    "a": 1
  },
  {
    "q": "31. Disajikan materi tentang perilaku Akhlak Tercela (Mazmumah) seperti *nifaq* (munafik), mahasiswa dapat menentukan tindakan pedagogik yang tepat untuk menanamkan kejujuran dalam pembelajaran.",
    "o": [
      "Memberikan ceramah tentang ancaman siksa neraka bagi orang munafik.",
      "Mengadakan *role playing* (bermain peran) tentang situasi kejujuran vs ketidakjujuran di sekolah dan mendiskusikan dampaknya.",
      "Meminta siswa membaca kisah-kisah tentang nifaq di masa Rasulullah.",
      "Memberikan tes objektif tentang definisi nifaq.",
      "Menugaskan siswa mencari artikel internet tentang contoh nifaq."
    ],
    "a": 1
  },
  {
    "q": "32. Disajikan deskripsi tentang penerapan pembelajaran Tauhid berbasis Proyek (PjBL), mahasiswa dapat menentukan tahapan yang tepat untuk meningkatkan kreativitas peserta didik.",
    "o": [
      "Guru menjelaskan konsep tauhid, siswa menghafalnya, lalu guru memberikan tes.",
      "Siswa diminta membuat infografis tentang rukun iman menggunakan aplikasi desain, lalu mempresentasikannya.",
      "Siswa membaca buku paket tentang tauhid, lalu merangkumnya.",
      "Guru memberikan kuis lisan tentang materi tauhid.",
      "Siswa mendengarkan ceramah tentang tauhid, lalu mengerjakan soal essay."
    ],
    "a": 1
  },
  {
    "q": "33. Disajikan narasi mengenai penggunaan media sosial, mahasiswa dapat memilih tindakan pedagogik yang sesuai dengan materi *Akhlakul Karimah*.",
    "o": [
      "Melarang siswa menggunakan media sosial sama sekali.",
      "Memberikan tugas membuat konten positif (video edukasi/quote islami) di media sosial untuk mempraktikkan akhlak terpuji.",
      "Meminta siswa menghafal hadits tentang menjaga lisan.",
      "Menjelaskan pengertian media sosial dari sudut pandang sosiologi.",
      "Mengadakan ujian tertulis tentang sejarah teknologi internet."
    ],
    "a": 1
  },
  {
    "q": "34. Disajikan kasus tentang konflik antar siswa, mahasiswa dapat memilih pendekatan konseling berbasis nilai akhlak untuk menyelesaikannya.",
    "o": [
      "Menghukum kedua siswa yang berkonflik tanpa mendengarkan alasan mereka.",
      "Melakukan mediasi dengan pendekatan *tashamuh* (toleransi) dan *islah* (perbaikan/perdamaian) sesuai prinsip akhlak.",
      "Membiarkan konflik selesai dengan sendirinya.",
      "Memindahkan salah satu siswa ke kelas lain.",
      "Memanggil orang tua siswa tanpa melakukan mediasi terlebih dahulu."
    ],
    "a": 1
  },
  {
    "q": "35. Disajikan deskripsi materi tentang sejarah aliran ilmu kalam, mahasiswa dapat memilih model pembelajaran yang tepat menggunakan *discovery learning*.",
    "o": [
      "Guru menjelaskan sejarah aliran secara detail dan siswa mencatatnya.",
      "Guru memberikan dokumen sejarah, siswa menganalisis dan menemukan perbedaan pokok ajaran aliran kalam secara mandiri.",
      "Siswa menghafal nama-nama tokoh ilmu kalam.",
      "Siswa menonton film dokumenter tentang sejarah islam.",
      "Guru mengadakan kuis tanya jawab mengenai materi aliran kalam."
    ],
    "a": 1
  },
  {
    "q": "36. Disajikan kasus pembelajaran materi Akhlak Tercela di era digital, mahasiswa dapat memilih solusi teknologis yang tepat.",
    "o": [
      "Melarang penggunaan *smartphone* di sekolah.",
      "Menggunakan aplikasi *polling* interaktif untuk menganalisis pemahaman siswa tentang perilaku *cyberbullying*.",
      "Memberikan ceramah tentang bahaya perilaku tercela.",
      "Meminta siswa merangkum dampak perilaku tercela dari buku cetak.",
      "Mengadakan ujian tulis mengenai contoh perilaku tercela."
    ],
    "a": 1
  },
  {
    "q": "37. Disajikan materi tentang Tasawuf, mahasiswa dapat memilih tindakan pedagogik untuk mengembangkan sikap *tawadhu'* (rendah hati) pada peserta didik.",
    "o": [
      "Meminta siswa menghafal biografi tokoh sufi yang tawadhu'.",
      "Membuat kegiatan bakti sosial di mana siswa berinteraksi langsung dengan masyarakat kurang mampu tanpa menunjukkan kesombongan.",
      "Memberikan ceramah tentang pentingnya bersikap rendah hati.",
      "Mengadakan ujian esai tentang pengertian tawadhu'.",
      "Menugaskan siswa membaca buku tentang sejarah tasawuf."
    ],
    "a": 1
  },
  {
    "q": "38. Disajikan narasi tentang evaluasi pembelajaran, mahasiswa dapat menentukan bentuk penilaian afektif yang tepat sesuai kurikulum saat ini.",
    "o": [
      "Ujian tulis pilihan ganda.",
      "Penilaian diri sendiri (self-assessment) dan penilaian antarteman (peer-assessment) terkait perilaku harian.",
      "Tes lisan hafalan ayat.",
      "Tugas membuat makalah kelompok.",
      "Ujian praktik shalat."
    ],
    "a": 1
  },
  {
    "q": "39. Disajikan deskripsi kasus tentang pembelajaran Tauhid di SD, mahasiswa dapat memilih pendekatan yang sesuai dengan perkembangan kognitif anak.",
    "o": [
      "Menjelaskan konsep tauhid menggunakan dalil-dalil filosofis yang rumit.",
      "Menggunakan media konkret (gambar, cerita, atau lagu) untuk menjelaskan kebesaran Allah (tauhid rububiyah).",
      "Meminta anak menghafal rukun iman tanpa penjelasan.",
      "Mengadakan ujian esai tentang konsep tauhid.",
      "Membacakan buku teks tentang tauhid."
    ],
    "a": 1
  },
  {
    "q": "40. Disajikan kasus tentang pentingnya integrasi nilai akhlak dalam pelajaran umum, mahasiswa dapat memilih tindakan pedagogik guru PAI yang tepat.",
    "o": [
      "Fokus hanya pada materi PAI di jam pelajaran agama.",
      "Berkolaborasi dengan guru mata pelajaran umum untuk menyisipkan nilai-nilai kejujuran dan disiplin dalam pengerjaan tugas.",
      "Meminta guru lain fokus pada materi pelajaran masing-masing saja.",
      "Mengadakan doa bersama sebelum pelajaran umum.",
      "Mengurangi jam pelajaran umum dan menambah jam pelajaran PAI."
    ],
    "a": 1
  },
  {
    "q": "41. Disajikan materi tentang Akhlak terhadap Orang Tua (Birrul Walidain), mahasiswa dapat menentukan tindakan pedagogik yang tepat untuk menanamkan nilai-nilai tersebut secara kontekstual.",
    "o": [
      "Memberikan ceramah tentang ayat-ayat Al-Qur'an tentang berbakti kepada orang tua.",
      "Mengadakan diskusi kelompok tentang tantangan berbakti di era modern dan membuat jurnal harian kegiatan membantu orang tua.",
      "Meminta siswa menghafal hadits tentang keridhoan orang tua.",
      "Memberikan tugas essay tentang definisi Birrul Walidain.",
      "Menugaskan siswa mencari kisah inspiratif di internet tentang anak yang durhaka."
    ],
    "a": 1
  },
  {
    "q": "42. Disajikan narasi tentang evaluasi pembelajaran materi Akidah Islam, mahasiswa dapat menentukan instrumen penilaian sikap yang tepat sesuai dengan konsep penilaian otentik.",
    "o": [
      "Soal tes objektif pilihan ganda tentang rukun iman.",
      "Tes lisan berupa hafalan dalil-dalil akidah.",
      "Lembar observasi jurnal harian perilaku (jujur, disiplin, bertanggung jawab) dan catatan anekdot.",
      "Tugas membuat karya seni kaligrafi.",
      "Ujian akhir semester dengan soal essay tingkat tinggi."
    ],
    "a": 2
  },
  {
    "q": "43. Disajikan kasus tentang pembelajaran materi Ilmu Kalam, mahasiswa dapat memilih model pembelajaran yang tepat menggunakan pendekatan *Contextual Teaching and Learning* (CTL).",
    "o": [
      "Guru menjelaskan sejarah aliran ilmu kalam secara terperinci.",
      "Guru mengaitkan perbedaan pandangan aliran kalam dengan perbedaan pendapat (furu'iyah) di masyarakat saat ini dan meminta siswa berdialog.",
      "Siswa menghafal tokoh-tokoh utama aliran kalam.",
      "Siswa menonton video dokumenter tentang sejarah islam.",
      "Guru mengadakan kuis tanya jawab mengenai materi aliran kalam."
    ],
    "a": 1
  },
  {
    "q": "44. Disajikan deskripsi penerapan nilai-nilai Asmaul Husna, mahasiswa dapat memilih rancangan aktivitas pembelajaran yang menekankan pada pendidikan karakter.",
    "o": [
      "Diskusi kelompok mengenai sejarah kodifikasi Asmaul Husna.",
      "Simulasi atau proyek di mana siswa mengidentifikasi sifat Allah dalam kehidupan sehari-hari (misal: Al-Adl) dan menerapkannya dalam perilaku.",
      "Ujian tulis tentang biografi tokoh yang memahami Asmaul Husna.",
      "Hafalan ayat-ayat tentang nama-nama Allah.",
      "Membuat makalah tentang perbedaan Asmaul Husna dan Sifat Wajib Allah."
    ],
    "a": 1
  },
  {
    "q": "45. Disajikan kasus pembelajaran materi Akhlak Tercela (Mazmumah) di era digital, mahasiswa dapat memilih solusi teknologis (TPACK) yang tepat.",
    "o": [
      "Melarang penggunaan teknologi sama sekali di kelas.",
      "Menggunakan aplikasi media sosial untuk kampanye 'Anti-Ghibah Online' dan menganalisis dampaknya.",
      "Memberikan ceramah tentang bahaya perilaku tercela.",
      "Meminta siswa merangkum dampak perilaku tercela dari buku cetak.",
      "Mengadakan ujian tulis mengenai contoh perilaku tercela."
    ],
    "a": 1
  },
  {
    "q": "46. Disajikan materi tentang sejarah munculnya tasawuf, mahasiswa dapat memilih tindakan pedagogik untuk mengembangkan sikap *zuhud* pada peserta didik.",
    "o": [
      "Meminta siswa menghafal biografi tokoh sufi.",
      "Mengadakan diskusi tentang gaya hidup sederhana dan membuat proyek berbagi barang layak pakai kepada yang membutuhkan.",
      "Memberikan ceramah tentang pentingnya zuhud.",
      "Mengadakan ujian esai tentang pengertian zuhud.",
      "Menugaskan siswa membaca buku tentang sejarah perkembangan tasawuf."
    ],
    "a": 1
  },
  {
    "q": "47. Disajikan kasus tentang rendahnya hasil belajar materi Akhlak Terpuji, mahasiswa dapat menentukan langkah perbaikan pembelajaran (remedial) yang tepat.",
    "o": [
      "Memberikan tes ulang dengan soal yang sama tanpa penjelasan.",
      "Mengadakan sesi diskusi ulang menggunakan media video pendek untuk visualisasi contoh perilaku terpuji.",
      "Meminta siswa membaca ulang buku teks secara mandiri.",
      "Memberikan tugas tambahan menghafal tanpa bimbingan.",
      "Melanjutkan materi ke pokok bahasan selanjutnya."
    ],
    "a": 1
  },
  {
    "q": "48. Disajikan pernyataan mengenai penggunaan media pembelajaran, mahasiswa dapat menilai efektivitas penggunaan media berbasis *Virtual Reality* (VR).",
    "o": [
      "Media ini tidak efektif karena membuat siswa pusing.",
      "Media ini sangat efektif untuk meningkatkan *engagement* dan pemahaman pengalaman visual siswa secara konkret (misal: simulasi ibadah).",
      "Media ini hanya membuang waktu.",
      "Media ini tidak relevan dengan struktur keilmuan akidah.",
      "Media ini membuat siswa malas membaca dalil."
    ],
    "a": 1
  },
  {
    "q": "49. Disajikan deskripsi tentang pentingnya jati diri guru profesional dalam mengajarkan Akidah Akhlak, mahasiswa dapat menentukan tindakan yang paling tepat.",
    "o": [
      "Hanya fokus mengajar di kelas sesuai dengan jam pelajaran.",
      "Menjadi teladan (*uswah hasanah*) dalam berperilaku santun dan berintegritas di dalam maupun luar sekolah.",
      "Memberikan nilai tinggi agar siswa senang.",
      "Menggunakan teknologi canggih tanpa memperhatikan materi.",
      "Menyerahkan sepenuhnya pembentukan karakter kepada orang tua."
    ],
    "a": 1
  },
  {
    "q": "50. Disajikan kasus tentang konflik siswa di sekolah, mahasiswa dapat memilih pendekatan konseling berbasis nilai akhlak untuk menyelesaikannya.",
    "o": [
      "Menghukum kedua siswa tanpa mendengarkan alasan mereka.",
      "Melakukan mediasi dengan pendekatan *tashamuh* (toleransi) dan *islah* (perbaikan/perdamaian) sesuai prinsip akhlak.",
      "Membiarkan konflik selesai dengan sendirinya.",
      "Memindahkan salah satu siswa ke kelas lain.",
      "Memanggil orang tua siswa tanpa melakukan mediasi terlebih dahulu."
    ],
    "a": 1
  }
]
