[
  {
    "q": "1. Disajikan deskripsi materi tentang hakikat Akidah Islam dan posisi Akidah dalam ajaran Islam, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah sikap yang paling sesuai dengan indikator tujuan supaya peserta didik dapat meningkatkan keimanan, ketakwaan dan akhlak mulia. Dalam pembelajaran tentang hakikat akidah Islam, penting bagi guru untuk tidak hanya menyampaikan aspek kognitif semata, tetapi juga membentuk sikap religius peserta didik. Sikap ini harus terlihat dalam perilaku nyata yang mencerminkan nilai-nilai iman, ketakwaan, dan akhlak mulia sebagai wujud dari internalisasi akidah yang dipelajari. Tujuan pembelajaran ranah sikap yang paling sesuai untuk mencapai hal tersebut adalah:",
    "o": [
      "Peserta didik dapat menyebutkan definisi akidah Islam menurut para ulama.",
      "Peserta didik membiasakan diri melaksanakan ibadah dan berperilaku terpuji dalam kehidupan sehari-hari.",
      "Peserta didik mampu menyusun makalah tentang akidah Islam.",
      "Peserta didik aktif dalam diskusi tentang konsep ketuhanan dalam berbagai agama.",
      "Peserta didik mampu mengidentifikasi bentuk penyimpangan akidah di masyarakat."
    ],
    "a": 1
  },
  {
    "q": "2. Disajikan pernyataan materi tentang konsep dasar Asmaul Husna, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan indikator supaya peserta didik mampu berpikir kritis. Dalam sebuah pembelajaran tentang Asmaul Husna, seorang guru mengajukan pertanyaan-pertanyaan analitis kepada peserta didik, seperti: \"Apa makna Al-Hakim (Maha Bijaksana) dalam kehidupan bermasyarakat?\" atau \"Bagaimana sifat Ar-Rahim (Maha Penyayang) dapat diinternalisasikan dalam perilaku sosial?\". Guru tersebut bertujuan agar peserta didik tidak hanya menghafal nama-nama Allah, tetapi juga berpikir kritis tentang nilai-nilai yang terkandung di dalamnya dan penerapannya. Berdasarkan pendekatan tersebut, rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai adalah:",
    "o": [
      "Peserta didik mampu menghafal nama-nama Asmaul Husna dengan baik.",
      "Peserta didik mampu mendefinisikan arti setiap Asmaul Husna.",
      "Peserta didik mampu mengidentifikasi hubungan antara sifat-sifat Asmaul Husna dengan perilaku manusia.",
      "Peserta didik mampu mendemonstrasikan pelafalan Asmaul Husna dengan tartil.",
      "Peserta didik mampu menyusun daftar Asmaul Husna berdasarkan kategori sifat."
    ],
    "a": 2
  },
  {
    "q": "3. Disajikan pernyataan materi tentang hakikat akhlak Islam dan kedudukan akhlak dalam ajaran Islam, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai dengan indikator supaya peserta didik memiliki semangat gotong royong. Dalam suatu proyek di sekolah, peserta didik diminta merancang kegiatan sosial seperti membersihkan lingkungan sekitar atau mengadakan bakti sosial. Guru mengarahkan kegiatan ini sebagai bentuk penerapan nilai-nilai akhlak Islam, khususnya dalam mengembangkan semangat gotong royong dan kebersamaan. Tujuan pembelajaran harus mencerminkan keterampilan nyata yang ingin dibentuk dari kegiatan tersebut. Rumusan tujuan pembelajaran ranah keterampilan yang paling tepat sesuai dengan pendekatan tersebut adalah:",
    "o": [
      "Peserta didik mampu menghafal ayat-ayat tentang tolong-menolong dalam Al-Qur'an.",
      "Peserta didik mampu melaksanakan kegiatan sosial secara bersama-sama untuk menerapkan nilai gotong royong.",
      "Peserta didik mampu menguraikan konsep ta'awun dalam akhlak Islam.",
      "Peserta didik mampu menulis laporan tentang kegiatan sosial di masyarakat.",
      "Peserta didik mampu mengidentifikasi bentuk-bentuk gotong royong dalam budaya lokal."
    ],
    "a": 1
  },
  {
    "q": "4. Disajikan deskripsi kasus pengembangan materi tentang konsep aliran-aliran dalam ilmu kalam, mahasiswa dapat menentukan rumusan indikat tujuan pembelajaran ranah sikap yang paling sesuai dengan materi supaya peserta didik memiliki sikap penerimaan terhadap tradisi. Pada suatu diskusi kelas tentang aliran dalam ilmu kalam, beberapa peserta didik menunjukkan kecenderungan menilai satu aliran lebih benar dan merendahkan aliran lainnya. Guru kemudian mengarahkan diskusi untuk menanamkan kesadaran bahwa setiap aliran merupakan hasil ijtihad ilmiah yang perlu dihargai sebagai warisan intelektual umat Islam. Tujuan pembelajaran ranah sikap yang paling sesuai untuk mengatasi masalah tersebut adalah:",
    "o": [
      "Peserta didik mampu menghafal nama-nama aliran dalam ilmu kalam.",
      "Peserta didik mampu menjelaskan persamaan dan perbedaan antar aliran kalam.",
      "Peserta didik mampu menunjukkan sikap terbuka dan menghormati tradisi keberagaman pemikiran dalam Islam.",
      "Peserta didik mampu menuliskan pendapat pribadinya tentang aliran yang paling benar.",
      "Peserta didik mampu membuat peta konsep tentang tokoh-tokoh aliran kalam."
    ],
    "a": 2
  },
  {
    "q": "5. Disajikan deskripsi materi tentang makna objek pembahasan tasawuf beserta dalilnya, mahasiswa dapat menentukan rumusan indikator tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan materi supaya peserta didik memiliki kemampuan berpikir dinamis dan inovatif. Pada sebuah diskusi kelas, guru menjelaskan bahwa tasawuf bukan hanya soal ritus keagamaan, tetapi juga tentang pemahaman yang mendalam terhadap hakikat diri, Allah, dan dunia. Dengan menggunakan pendekatan tasawuf, peserta didik diminta untuk berpikir kritis tentang cara-cara yang dapat dilakukan untuk menerapkan ajaran tasawuf dalam kehidupan pribadi dan sosial, termasuk bagaimana dzikir dapat membantu membersihkan hati dan meningkatkan kedekatan dengan Allah. Rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan pendekatan ini adalah:",
    "o": [
      "Peserta didik mampu menjelaskan berbagai jenis dzikir dalam tasawuf.",
      "Peserta didik mampu menghubungkan konsep tasawuf dengan ajaran-ajaran Islam lainnya.",
      "Peserta didik mampu berinovasi dalam merancang aktivitas yang memadukan tasawuf dengan kehidupan sehari-hari.",
      "Peserta didik mampu menilai perbedaan antara ajaran tasawuf dan ajaran fikih.",
      "Peserta didik mampu mendiskusikan tafsir ayat-ayat yang berhubungan dengan tasawuf."
    ],
    "a": 2
  },
  {
    "q": "6. Disajikan deskripsi aktivitas pembelajaran guru dalam perencanaan tujuan pembelajaran pada materi aqidah Islam dengan pendekatan PBL, mahasiswa dapat menganalisis materi ajar Allah dan Kemaha-Esa-an Allah berdasarkan struktur keilmuan pada perencanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik. Ketika menjabarkan materi tentang kemaha-Esa-an Allah, seorang guru perlu mengintegrasikan pengetahuan dari teologi, filsafat, dan tafsir. Dalam teologi Islam, kemaha-Esa-an Allah dipahami sebagai konsep yang tidak terbagi, sedangkan dalam filsafat Islam, pandangan tentang esensi Tuhan dapat dipahami melalui pendekatan rasional. Tafsir Al-Qur'an memberikan penjelasan melalui ayat-ayat yang menegaskan keesaan Allah. Berdasarkan informasi tersebut, cara terbaik untuk menjabarkan materi ajar kemaha-Esa-an Allah dari perspektif keilmuan yang berbeda adalah:",
    "o": [
      "Menyusun materi ajar dengan fokus hanya pada ajaran-ajaran teologis dan mengabaikan aspek filsafat dan tafsir.",
      "Menyusun materi ajar kemaha-Esa-an Allah dengan memadukan pendekatan rasional dari filsafat dan teks wahyu dari Al-Qur'an dan Hadis.",
      "Menyusun materi ajar dengan hanya mengacu pada teks-teks filsafat Islam tanpa penjelasan dari Al-Qur'an dan Hadis.",
      "Menggunakan pendekatan tafsir sebagai satu-satunya sumber dalam menjabarkan materi ajar tentang kemaha-Esa-an Allah.",
      "Menyajikan materi ajar tentang kemaha-Esa-an Allah hanya dari perspektif sejarah perkembangan pemikiran Islam."
    ],
    "a": 1
  },
  {
    "q": "7. Disajikan deskripsi aktivitas guru dalam pelaksanaan tujuan pembelajaran pada materi asmaul husna dengan pendekatan PjBL, mahasiswa dapat menganalisis materi ajar makna dan sifat Asmaul Husna berdasarkan struktur keilmuan pada pelaksanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik. Dalam sebuah proses pembelajaran di kelas, guru memberikan tugas kepada peserta didik untuk melakukan analisis mendalam tentang makna dan sifat-sifat Asmaul Husna berdasarkan struktur keilmuan. Materi ajar ini dijabarkan melalui pendekatan teologi Islam yang memandang sifat-sifat Allah sebagai hakikat ketuhanan, filsafat Islam yang melihat sifat Allah sebagai konsep yang dapat dijelaskan melalui rasio, dan tasawuf yang memahami sifat-sifat Allah dalam konteks pengalaman spiritual. Peserta didik diminta untuk membuat presentasi tentang bagaimana sifat-sifat Asmaul Husna dapat diterapkan dalam kehidupan sehari-hari. Berdasarkan deskripsi tersebut, penjabaran materi ajar tentang makna dan sifat Asmaul Husna dengan pendekatan PjBL yang paling tepat adalah:",
    "o": [
      "Penjabaran materi ajar Asmaul Husna dilakukan hanya melalui penjelasan teologis, tanpa memasukkan pendekatan filsafat atau tasawuf.",
      "Penjabaran materi ajar Asmaul Husna dilakukan dengan menggunakan pendekatan filsafat Islam yang lebih menekankan aspek rasional dan filosofis tentang sifat-sifat Allah.",
      "Penjabaran materi ajar Asmaul Husna dilakukan dengan menggabungkan teologi, filsafat, dan tasawuf, serta mendorong peserta didik untuk melihat hubungan antara sifat-sifat Allah dan praktik kehidupan mereka.",
      "Penjabaran materi ajar Asmaul Husna hanya melalui pendekatan tasawuf yang fokus pada pengalamannya tanpa mengaitkan dengan keilmuan lainnya.",
      "Penjabaran materi ajar Asmaul Husna hanya dilakukan dengan menghafal nama-nama Allah tanpa memahami makna dan implikasi sifat-sifat tersebut."
    ],
    "a": 2
  },
  {
    "q": "8. Disajikan narasi kasus guru melakukan evaluasi pembelajaran pada materi akhlak mahmudah atau akhlak mazmumah dengan pendekatan DBL, mahasiswa dapat menguraikan materi ajar konsep akhlak terpuji (mahmudah) dan akhlak tercela (mazmumah) pada evaluasi tujuan pembelajaran sesuai dengan karakteristik peserta didik. Dalam pendekatan Differentiated Based Learning (DBL), guru memberikan materi tentang akhlak mahmudah (akhlak terpuji) dan akhlak mazmumah (akhlak tercela) dengan memperhatikan perbedaan karakteristik peserta didik. Guru memberikan evaluasi yang disesuaikan dengan kebutuhan peserta didik, termasuk menyediakan berbagai pilihan tugas yang mengakomodasi gaya belajar visual, auditori, dan kinestetik. Dalam tugas akhir, peserta didik diminta untuk mengeksplorasi cara-cara mengembangkan akhlak terpuji dalam kehidupan mereka dan menghindari akhlak tercela. Berdasarkan pernyataan di atas, penjabaran materi ajar tentang akhlak mahmudah (akhlak terpuji) dan akhlak mazmumah (akhlak tercela) dalam evaluasi tujuan pembelajaran yang paling tepat untuk pendekatan DBL adalah:",
    "o": [
      "Memberikan materi yang sama kepada semua peserta didik dan memberikan tes tertulis tanpa memberikan pilihan tugas yang berbeda sesuai dengan gaya belajar mereka.",
      "Menyediakan beberapa pilihan tugas yang sesuai dengan gaya belajar peserta didik (misalnya visual, auditori, kinestetik) dan memberikan kesempatan untuk mendiskusikan pengembangan akhlak dalam kehidupan nyata.",
      "Menggunakan metode pengajaran yang hanya berfokus pada teori tanpa memberikan kesempatan bagi peserta didik untuk terlibat dalam diskusi atau proyek berbasis aplikasi nyata.",
      "Memberikan tugas yang sama untuk seluruh peserta didik tanpa membedakan tingkat kesulitan atau cara penyampaian materi.",
      "Menggunakan pendekatan yang hanya berfokus pada evaluasi akhir berupa ujian tertulis tanpa mengakomodasi kebutuhan gaya belajar peserta didik."
    ],
    "a": 1
  },
  {
    "q": "9. Disajikan pernyataan praktik pedagogi tentang perencanaan materi ajar aliran-aliran ilmu kalam secara logis dengan pendekatan TPACK, mahasiswa dapat menentukan alur materi ajar karakteristik utama dari berbagai aliran Ilmu Kalam dalam perencanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik. Dalam merencanakan materi ajar tentang aliran-aliran dalam ilmu kalam, guru memanfaatkan pendekatan TPACK, yang mengintegrasikan teknologi, pedagogi, dan konten untuk mencapai tujuan pembelajaran. Guru memilih berbagai metode dan alat berbasis teknologi untuk membantu peserta didik memahami karakteristik utama dari Asy'ariyah, Maturidiyah, dan Mu'tazilah, serta mendiskusikan perbedaan mendasar di antara aliran-aliran tersebut dengan cara yang menarik dan sesuai dengan gaya belajar peserta didik. Berdasarkan pendekatan TPACK dalam perencanaan materi ajar, yang termasuk dalam alur materi ajar yang tepat untuk pembelajaran aliran-aliran ilmu kalam adalah:",
    "o": [
      "Menggunakan slide presentasi untuk menjelaskan teori dasar tentang aliran-ilmu kalam, diikuti dengan ujian tertulis untuk mengukur pemahaman peserta didik.",
      "Memanfaatkan aplikasi teknologi interaktif untuk memfasilitasi diskusi dan tugas berbasis proyek, yang memungkinkan peserta didik mendalami karakteristik setiap aliran dan berbagi pendapat melalui forum diskusi online.",
      "Hanya menggunakan materi teks bacaan untuk mengajarkan aliran-ilmu kalam, dengan evaluasi berbasis soal pilihan ganda yang menilai pemahaman teoretis.",
      "Menyajikan materi ajar dalam bentuk ceramah langsung, dengan tugas yang hanya berbentuk soal-soal tertulis tanpa aplikasi atau teknologi pendukung lainnya.",
      "Menggunakan video pembelajaran sebagai sumber utama untuk mengajarkan perbedaan aliran-ilmu kalam, namun tanpa memberikan kesempatan bagi peserta didik untuk berkolaborasi atau menggunakan teknologi lain dalam pembelajaran."
    ],
    "a": 1
  },
  {
    "q": "10. Disajikan pernyataan praktik pedagogi tentang pelaksanaan materi ajar aliran tasawuf atau tokoh-tokohnya secara logis dengan pendekatan DL, mahasiswa dapat menentukan alur materi ajar tetang sejarah munculnya tasawuf, faktor faktor yang melatarbelakanginya dalam pelaksanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik. Dalam suatu sesi pembelajaran, guru mengajak peserta didik untuk mendalami sejarah munculnya tasawuf dan faktor-faktor yang melatarbelakanginya melalui pendekatan Discovery Learning (DL). Pembelajaran dilakukan dengan cara yang mendorong peserta didik untuk menemukan konsep-konsep utama tasawuf melalui pengalaman langsung, eksplorasi, dan diskusi yang dipandu oleh guru. Alur materi ajar yang tepat dalam pelaksanaan pembelajaran tentang tasawuf, menggunakan pendekatan Discovery Learning (DL), adalah:",
    "o": [
      "Menyampaikan informasi sejarah tasawuf dengan ceramah dan dilanjutkan dengan tes tertulis untuk mengevaluasi pemahaman peserta didik.",
      "Membimbing peserta didik untuk mencari informasi mengenai sejarah tasawuf dan faktor-faktor yang melatarbelakanginya, kemudian mengorganisir hasil temuan mereka dalam presentasi kelompok.",
      "Menyediakan materi bacaan tentang tasawuf, dan meminta peserta didik menulis rangkuman tanpa berdiskusi atau berinteraksi dengan teman sekelas.",
      "Menggunakan ceramah interaktif yang diikuti dengan pertanyaan-pertanyaan pemahaman untuk mengukur sejauh mana peserta didik telah memahami materi.",
      "Memberikan tugas individu untuk menulis tentang tokoh-tokoh tasawuf, sambil memberikan sedikit waktu untuk mendalami sejarah dan faktor yang melatarbelakangi tasawuf."
    ],
    "a": 1
  },
  {
    "q": "11. Disajikan pernyataan praktik pedagogi tentang pelaksanaan materi ajar objek pembahasan tawawuf secara logis dengan model pelayanan konseling, mahasiswa dapat menentukan alur materi ajar ruang lingkup pembahasan tasawuf dalam hubungan antara makhluk dengan Tuhan (hablum min Allah) dan hubungan antar sesama makhluk (hablum min al-nas) dalam mengevaluasi tujuan pembelajaran sesuai dengan karakteristik peserta didik. Dalam sebuah sesi pembelajaran, guru mengimplementasikan model pelayanan konseling untuk mengajarkan ruang lingkup tasawuf terkait hablum min Allah dan hablum min al-nas. Pembelajaran difokuskan pada membangun kesadaran spiritual dan sosial peserta didik melalui interaksi personal yang mendalam. Pendekatan alur materi ajar yang paling tepat berdasarkan praktik pedagogi tersebut adalah:",
    "o": [
      "Mengarahkan peserta didik menemukan makna hablum min Allah dan hablum min al-nas dalam kehidupan mereka melalui diskusi konseling, lalu menyusun rencana perubahan sikap sebagai evaluasi.",
      "Menjelaskan konsep hablum min Allah dan hablum min al-nas secara teoritis di depan kelas, lalu memberikan tugas membuat makalah tentang teori tersebut.",
      "Menyampaikan kuliah umum tentang hubungan makhluk dengan Tuhan dan sesama makhluk, diikuti dengan tes objektif.",
      "Menugaskan peserta didik membaca teks kitab kuning tentang akhlak tasawuf, lalu membuat rangkuman secara individu.",
      "Menyediakan infografis tentang hablum min Allah dan hablum min al-nas, kemudian meminta peserta didik menghafal isinya sebagai bahan evaluasi."
    ],
    "a": 0
  },
  {
    "q": "12. Disajikan pernyataan praktik pedagogi tentang pelaksanaan program penguatan profile pelajar pancasila (P5) secara logis, mahasiswa dapat menentukan pengembangan materi ajar nilai-nilai P5 dalam merencanakan tujuan pembelajaran sesuai dengan karakteristik peserta didik. Dalam pelaksanaan P5, guru mengadakan kegiatan kolaboratif bertema \"Inovasi Sosial\". Peserta didik diminta membuat proyek sosial yang memecahkan permasalahan lokal, seperti mengelola sampah, mengembangkan taman hijau, atau membuat kampanye kesehatan. Langkah pengembangan materi ajar yang paling sesuai untuk mendukung tujuan pembelajaran berbasis P5 dalam kasus tersebut adalah:",
    "o": [
      "Menyusun skenario proyek nyata yang mendorong kreativitas, kolaborasi, dan kemampuan berpikir kritis peserta didik dalam menyelesaikan masalah sosial.",
      "Memberikan daftar teori inovasi sosial kepada peserta didik untuk dihafalkan dalam waktu satu minggu.",
      "Menugaskan peserta didik membuat esai tentang makna sosial Pancasila berdasarkan buku teks.",
      "Menyajikan pidato guru tentang keberhasilan program sosial di negara lain tanpa mengaitkannya dengan pengalaman lokal peserta didik.",
      "Membuat soal ujian tertulis tentang prinsip gotong royong dan membahasnya dalam satu sesi pembelajaran."
    ],
    "a": 0
  },
  {
    "q": "13. Disajikan pernyataan praktik pedagogi tentang pelaksanaan program Penguatan profile pelajar rahmatan lil alami (PPRA) secara logis, mahasiswa dapat menentukan pengembangan materi ajar nilai-nilai PPRA dalam melaksanakan tujuan pembelajaran sesuai dengan karakteristik peserta didik. Seorang guru merancang proyek kelas bertema \"Menebar Kebaikan di Sekitar Kita\". Peserta didik diminta mengidentifikasi kebutuhan sosial di lingkungan mereka, seperti membantu sesama, peduli kepada kaum dhuafa, dan menjaga kebersihan lingkungan. Setiap kelompok diminta membuat laporan dan refleksi tentang pengalaman proyek tersebut. Dalam pelaksanaan proyek tersebut, pengembangan materi ajar nilai-nilai PPRA yang paling tepat adalah:",
    "o": [
      "Menyusun teks panjang tentang teori sosial Islam untuk dibaca peserta didik.",
      "Menyusun lembar kerja proyek berbasis tindakan nyata yang membangun nilai kasih sayang, kepedulian, dan toleransi.",
      "Mengadakan kuis hafalan tentang sejarah konsep rahmatan lil alamin.",
      "Memberikan pidato tentang pentingnya ukhuwah Islamiyah tanpa memberi ruang refleksi pengalaman pribadi.",
      "Memberikan tugas menulis makalah tentang teori umum rahmat Islam di masa lalu."
    ],
    "a": 1
  },
  {
    "q": "14. Disajikan pernyataan praktik pedagog atau praktek di masyarakat tentang imlementasi nilai-nilai moderasi beragama secara logis, mahasiswa dapat menentukan pengembangan materi ajar niali-nilai Islam sebagai agama moderat atau wasathiyah yang tepat sesuai dengan implementasi moderasi beragama dalam mengevaluasi tujuan pembelajaran sesuai dengan karakteristik peserta didik. Dalam praktik pembelajaran, seorang guru mengadakan diskusi kelas dengan tema \"Menghargai Keragaman dalam Islam\". Peserta didik dibagi menjadi beberapa kelompok, masing-masing menganalisis contoh-contoh moderasi beragama dalam kehidupan nyata, seperti musyawarah antarumat beragama atau solidaritas sosial lintas agama. Dalam kasus tersebut, pengembangan materi ajar nilai-nilai moderasi beragama yang paling efektif adalah:",
    "o": [
      "Menyusun bahan bacaan yang menekankan pentingnya dialog, sikap adil, dan penghargaan terhadap keberagaman, disertai latihan studi kasus nyata.",
      "Menyusun modul hafalan ayat Al-Qur’an tentang persatuan umat tanpa diskusi aplikasinya dalam kehidupan sehari-hari.",
      "Memberikan ceramah tentang konsep ukhuwah Islamiyah tanpa mengaitkannya dengan masalah sosial kekinian.",
      "Menyajikan tugas membaca buku-buku klasik tentang perbedaan mazhab tanpa diskusi kritis.",
      "Memberikan kuis pilihan ganda tentang sejarah konflik umat tanpa membahas solusi moderasi."
    ],
    "a": 0
  },
  {
    "q": "15. Disajikan pernyataan praktik pedagogi atau praktek di masyarakat tentang alasan imlementasi nilai-nilai moderasi beragama, mahasiswa dapat menilai pegembangan materi ajar Islam sebagai agama moderat atau wasathiyah dengan alasan yang tepat sesuai dengan implementasi moderasi beragama. Di sebuah sekolah, guru agama Islam mengembangkan proyek \"Dialog Lintas Keyakinan\" yang mengundang tokoh dari berbagai agama untuk berdiskusi tentang nilai-nilai kemanusiaan universal. Peserta didik kemudian merefleksikan pentingnya toleransi dan hidup berdampingan damai. Dalam kasus ini, alasan paling tepat yang mendasari pengembangan materi ajar Islam sebagai agama moderat adalah:",
    "o": [
      "Membangun keteguhan mempertahankan identitas kelompok dengan mengabaikan perbedaan.",
      "Memberikan pengalaman nyata kepada peserta didik tentang pentingnya nilai keadilan, kasih sayang, dan saling menghormati.",
      "Menanamkan kekhawatiran terhadap potensi percampuran nilai budaya asing.",
      "Mengedepankan keseragaman pandangan dalam masyarakat agar stabilitas lebih mudah dijaga.",
      "Membentuk opini bahwa agama sendiri paling toleran tanpa harus menghargai pengalaman agama lain."
    ],
    "a": 1
  },
  {
    "q": "16. Disajikan pernyataan praktik pedagogi atau praktek di masyarakat tentang alasan implementasi nilai-nilai moderasi beragama, mahasiswa dapat menilai pegembangan materi ajar Islam sebagai agama moderat atau wasathiyah dengan alasan yang tepat sesuai dengan implementasi moderasi beragama. Dalam sebuah diskusi, guru menekankan bahwa menjadi muslim yang moderat berarti bersikap adil dan tidak ekstrem dalam beragama. Guru memberikan contoh perilaku Nabi Muhammad SAW yang lemah lembut namun tetap tegas dalam prinsip. Alasan yang paling tepat dari pengembangan materi ajar tersebut adalah:",
    "o": [
      "Membentuk kepribadian muslim yang kaku dalam memegang pendapat.",
      "Menanamkan pemahaman bahwa moderasi beragama bertujuan untuk mencampuradukkan ajaran agama.",
      "Membentuk pemahaman peserta didik bahwa Islam adalah agama yang seimbang (wasathiyah) dalam menyikapi perbedaan.",
      "Memastikan peserta didik hanya mengikuti satu mazhab pemikiran saja.",
      "Menghindari diskusi mengenai isu-isu kontemporer yang sensitif."
    ],
    "a": 2
  },
  {
    "q": "17. Disajikan narasi kasus tentang penerapan metode pembelajaran inquiry pada materi sejarah kebudayaan Islam, mahasiswa dapat menentukan langkah-langkah metode inquiry dalam mengembangkan materi ajar secara logis. Seorang guru ingin mengajarkan tentang sejarah masuknya Islam di Nusantara. Guru tersebut tidak langsung menceritakan sejarahnya, melainkan memberikan beberapa artefak dan catatan sejarah, lalu meminta peserta didik menyelidiki bagaimana dan melalui jalur apa Islam masuk ke Nusantara. Langkah pertama yang paling tepat dalam metode inquiry pada kasus tersebut adalah:",
    "o": [
      "Merumuskan masalah atau pertanyaan penelitian tentang jalur masuknya Islam.",
      "Mengumpulkan data melalui observasi langsung ke situs sejarah.",
      "Menganalisis data yang telah ditemukan oleh peserta didik.",
      "Menarik kesimpulan dari hasil investigasi.",
      "Menyusun laporan hasil penelitian kelompok."
    ],
    "a": 0
  },
  {
    "q": "18. Disajikan narasi tentang penggunaan media pembelajaran berbasis teknologi pada materi Fikih, mahasiswa dapat memilih media pembelajaran yang tepat sesuai dengan karakteristik materi dan peserta didik. Guru ingin mengajarkan tata cara haji kepada peserta didik. Materi ini cukup kompleks dan membutuhkan pemahaman visual yang baik. Guru ingin peserta didik merasakan pengalaman seolah-olah berada di Tanah Suci. Media pembelajaran yang paling tepat untuk digunakan adalah:",
    "o": [
      "Buku paket teks sejarah haji.",
      "Video dokumenter haji tanpa narasi.",
      "Aplikasi virtual reality (VR) simulasi manasik haji.",
      "Gambar cetak tata cara haji.",
      "Audio rekaman bacaan talbiyah."
    ],
    "a": 2
  },
  {
    "q": "19. Disajikan pernyataan tentang penilaian autentik pada materi Akhlak, mahasiswa dapat menentukan instrumen penilaian yang sesuai untuk mengukur kompetensi sikap peserta didik. Guru ingin menilai sikap jujur peserta didik dalam kehidupan sehari-hari di sekolah. Guru ingin instrumen tersebut mencerminkan perilaku nyata, bukan sekadar jawaban kognitif. Instrumen penilaian autentik yang paling tepat digunakan adalah:",
    "o": [
      "Tes tertulis objektif tentang pengertian jujur.",
      "Lembar observasi perilaku siswa selama di sekolah.",
      "Soal esai mengenai dampak ketidakjujuran.",
      "Wawancara dengan teman sebaya mengenai pendapat mereka.",
      "Portofolio kumpulan tugas-tugas sekolah."
    ],
    "a": 1
  },
  {
    "q": "20. Disajikan deskripsi tentang pembelajaran remedial pada materi Al-Qur'an Hadis, mahasiswa dapat menentukan strategi pembelajaran remedial yang efektif. Setelah dilakukan tes harian, sebagian besar peserta didik belum mencapai kriteria ketuntasan minimal (KKM) pada materi hukum bacaan Tajwid. Guru ingin memberikan remedial yang berfokus pada perbaikan pemahaman konsep secara individual. Strategi pembelajaran remedial yang paling tepat adalah:",
    "o": [
      "Memberikan tugas tambahan berupa merangkum buku paket.",
      "Mengadakan pembelajaran ulang dengan metode yang sama untuk seluruh siswa.",
      "Memberikan bimbingan khusus secara perorangan atau kelompok kecil (tutor sebaya).",
      "Meminta siswa mempelajari materi secara mandiri di perpustakaan.",
      "Memberikan tes ulang tanpa memberikan penjelasan ulang materi."
    ],
    "a": 2
  },
  {
    "q": "21. Disajikan deskripsi kasus tentang pemanfaatan lingkungan sebagai sumber belajar, mahasiswa dapat memilih lingkungan yang tepat untuk materi tertentu. Guru ingin mengajarkan materi tentang 'Akhlak kepada Lingkungan' dan pentingnya menjaga kebersihan. Lingkungan belajar yang paling relevan untuk dioptimalkan sebagai sumber belajar untuk materi tersebut adalah:",
    "o": [
      "Perpustakaan sekolah yang tenang.",
      "Ruang kelas yang nyaman.",
      "Taman sekolah atau lingkungan sekitar sekolah yang kotor.",
      "Laboratorium komputer sekolah.",
      "Ruang guru yang tertata rapi."
    ],
    "a": 2
  },
  {
    "q": "22. Disajikan narasi tentang pengembangan bahan ajar pada materi Akidah Akhlak, mahasiswa dapat menentukan karakteristik bahan ajar yang baik. Guru ingin membuat modul ajar sendiri tentang 'Sifat-sifat Allah' agar lebih sesuai dengan kebutuhan siswa. Agar modul tersebut efektif dan mudah dipahami, karakteristik apa yang paling utama harus dipenuhi?",
    "o": [
      "Modul harus tebal dan memuat semua teori sejarah.",
      "Modul harus menggunakan bahasa yang puitis.",
      "Modul harus interaktif, sistematis, dan sesuai dengan tahap perkembangan kognitif siswa.",
      "Modul hanya berisi kumpulan soal tanpa penjelasan.",
      "Modul menggunakan bahasa asing agar terlihat keren."
    ],
    "a": 2
  },
  {
    "q": "23. Disajikan contoh kasus pembelajaran di kelas yang kurang aktif, mahasiswa dapat menentukan model pembelajaran yang dapat meningkatkan partisipasi siswa. Dalam pelajaran Akidah Akhlak, guru mendapati siswa cenderung pasif dan hanya mendengarkan ceramah. Guru ingin mengubah suasana agar siswa lebih terlibat dalam memecahkan masalah terkait perilaku sehari-hari. Model pembelajaran yang paling sesuai adalah:",
    "o": [
      "Ceramah konvensional.",
      "Project Based Learning (PjBL).",
      "Direct Instruction.",
      "Demonstrasi.",
      "Resitasi."
    ],
    "a": 1
  },
  {
    "q": "24. Disajikan kasus tentang perbedaan kecepatan belajar siswa, mahasiswa dapat menerapkan prinsip diferensiasi dalam pembelajaran. Di kelas terdapat siswa yang sangat cepat memahami materi dan siswa yang lambat. Guru ingin mengakomodasi perbedaan tersebut agar semua siswa mencapai tujuan pembelajaran. Langkah pembelajaran yang tepat adalah:",
    "o": [
      "Mengajar dengan kecepatan lambat agar semua siswa mengerti.",
      "Mengajar dengan kecepatan cepat agar materi cepat selesai.",
      "Memberikan materi pengayaan bagi siswa yang cepat dan remedial bagi siswa yang lambat (diferensiasi produk/proses).",
      "Membiarkan siswa yang lambat belajar sendiri.",
      "Mengabaikan perbedaan tersebut karena waktu terbatas."
    ],
    "a": 2
  },
  {
    "q": "25. Disajikan deskripsi materi tentang sejarah Nabi Muhammad SAW, mahasiswa dapat memilih metode pembelajaran yang tepat untuk menanamkan nilai keteladanan. Guru ingin siswa tidak hanya tahu sejarah Nabi, tetapi bisa meneladani akhlak beliau. Metode pembelajaran yang paling tepat adalah:",
    "o": [
      "Metode ceramah tentang tahun-tahun penting.",
      "Metode tanya jawab tentang silsilah Nabi.",
      "Metode kisah atau bercerita dengan menekankan pada nilai moral dan keteladanan.",
      "Metode dikte cerita sejarah.",
      "Metode menghafal nama-nama istri Nabi."
    ],
    "a": 2
  },
  {
    "q": "26. Disajikan narasi kasus tentang konflik antar teman di sekolah, mahasiswa dapat menentukan materi ajar yang relevan untuk mengatasi masalah tersebut. Sering terjadi pertengkaran dan aksi *bullying* di kelas. Guru ingin memberikan materi ajar yang menekankan pentingnya persaudaraan dan toleransi dalam Islam. Materi yang paling relevan adalah:",
    "o": [
      "Materi tentang hukum waris dalam Islam.",
      "Materi tentang konsep *Ukhuwah* (persaudaraan) dan *Tasamuh* (toleransi).",
      "Materi tentang sejarah perang dalam Islam.",
      "Materi tentang tata cara penyembelihan hewan.",
      "Materi tentang tata cara shalat sunnah."
    ],
    "a": 1
  },
  {
    "q": "27. Disajikan data hasil penilaian, mahasiswa dapat melakukan analisis *item* soal untuk perbaikan pembelajaran. Sebuah soal ujian pada materi Akidah Akhlak memiliki daya pembeda yang rendah, artinya siswa yang pintar dan kurang pintar menjawab sama benar atau salahnya. Apa tindakan yang tepat bagi guru?",
    "o": [
      "Membuang soal tersebut tanpa diperbaiki.",
      "Menggunakan kembali soal tersebut pada ujian berikutnya.",
      "Menganalisis dan memperbaiki soal agar memiliki daya pembeda yang lebih baik.",
      "Mengurangi nilai siswa yang salah menjawab.",
      "Menyalahkan siswa karena kurang belajar."
    ],
    "a": 2
  },
  {
    "q": "28. Disajikan kasus tentang pentingnya nilai-nilai kejujuran dalam berbisnis, mahasiswa dapat menghubungkan materi akhlak dengan kehidupan nyata. Guru sedang mengajarkan tentang jujur. Agar materi ini bermakna, bagaimana cara menghubungkannya dengan kehidupan nyata siswa?",
    "o": [
      "Meminta siswa menghafal definisi jujur menurut KBBI.",
      "Memberikan contoh kasus *bullying* di sekolah.",
      "Mendiskusikan pentingnya kejujuran dalam jual beli di kantin sekolah.",
      "Menulis esai tentang kejujuran para sahabat Nabi.",
      "Menceritakan kisah fiksi tentang kejujuran."
    ],
    "a": 2
  },
  {
    "q": "29. Disajikan narasi tentang pengembangan diri guru, mahasiswa dapat memilih aktivitas pengembangan diri yang tepat. Guru Akidah Akhlak ingin meningkatkan kemampuan dalam mengintegrasikan teknologi dalam pembelajaran. Aktivitas apa yang paling tepat?",
    "o": [
      "Mengikuti seminar tentang metode ceramah yang menarik.",
      "Mengikuti *workshop* pelatihan pembuatan media pembelajaran berbasis Canva dan Quizizz.",
      "Membaca buku sejarah peradaban Islam.",
      "Mengikuti pelatihan penulisan karya ilmiah populer.",
      "Menjadi pengurus majelis taklim di lingkungan rumah."
    ],
    "a": 1
  },
  {
    "q": "30. Disajikan kasus tentang evaluasi kurikulum, mahasiswa dapat menentukan langkah perbaikan kurikulum tingkat satuan pendidikan. Hasil evaluasi menunjukkan bahwa kurikulum Akidah Akhlak kurang relevan dengan perkembangan zaman. Langkah apa yang paling tepat dilakukan?",
    "o": [
      "Menambah jam pelajaran Akidah Akhlak.",
      "Mengganti seluruh guru Akidah Akhlak.",
      "Melakukan revisi kurikulum dengan memasukkan materi terkait tantangan moral di era digital.",
      "Mengurangi beban materi tanpa mengubah konten.",
      "Menghapus mata pelajaran Akidah Akhlak."
    ],
    "a": 2
  },
  {
    "q": "31. Disajikan kasus tentang rendahnya minat baca siswa pada materi sejarah kebudayaan Islam, mahasiswa dapat menentukan strategi motivasi belajar yang tepat. Siswa merasa bosan dengan teks panjang dalam buku paket. Strategi apa yang paling tepat untuk meningkatkan minat baca dan pemahaman siswa?",
    "o": [
      "Mewajibkan siswa menghafal seluruh isi buku paket.",
      "Menggunakan teknik *storytelling* (bercerita) yang menarik dengan bantuan media visual.",
      "Memberikan hukuman bagi siswa yang tidak membaca buku.",
      "Menyuruh siswa merangkum buku paket tanpa penjelasan.",
      "Mengganti materi sejarah dengan materi fikih saja."
    ],
    "a": 1
  },
  {
    "q": "32. Disajikan narasi tentang pembelajaran Akidah Akhlak yang menekankan pada nilai-nilai moderasi, mahasiswa dapat mengidentifikasi perilaku yang mencerminkan sikap *wasathiyah*. Manakah perilaku di bawah ini yang paling mencerminkan sikap *wasathiyah* (moderat) dalam kehidupan beragama?",
    "o": [
      "Memaksakan pendapat sendiri kepada orang lain.",
      "Bersikap apatis dan tidak peduli terhadap urusan agama.",
      "Menghormati perbedaan pendapat dan menjunjung tinggi toleransi.",
      "Meyakini bahwa hanya kelompoknya yang masuk surga.",
      "Menolak segala bentuk perubahan dan modernisasi."
    ],
    "a": 2
  },
  {
    "q": "33. Disajikan kasus tentang pelanggaran tata tertib sekolah, mahasiswa dapat menentukan pendekatan konseling yang tepat dalam pembelajaran Akidah Akhlak. Seorang siswa sering membolos dan tidak mengerjakan tugas. Pendekatan apa yang paling sesuai untuk diterapkan guru sebagai upaya mendidik?",
    "o": [
      "Memberikan sanksi fisik langsung.",
      "Memarahi siswa di depan kelas.",
      "Melakukan pendekatan konseling individual untuk mencari akar masalah.",
      "Mengeluarkan siswa dari kelas secara permanen.",
      "Mengabaikan perilaku siswa karena dianggap kenakalan biasa."
    ],
    "a": 2
  },
  {
    "q": "34. Disajikan deskripsi tentang penggunaan *e-learning* pada mata pelajaran Akidah Akhlak, mahasiswa dapat menentukan fitur *e-learning* yang sesuai untuk interaksi aktif. Guru ingin siswa dapat berdiskusi secara fleksibel di luar jam pelajaran. Fitur apa yang paling tepat digunakan?",
    "o": [
      "Fitur unggah materi (dokumen).",
      "Fitur forum diskusi online.",
      "Fitur kuis pilihan ganda.",
      "Fitur chat pribadi.",
      "Fitur statistik nilai."
    ],
    "a": 1
  },
  {
    "q": "35. Disajikan narasi tentang evaluasi pembelajaran berbasis proyek (PjBL), mahasiswa dapat menentukan indikator keberhasilan proyek yang tepat. Proyek yang dikerjakan siswa adalah 'Membuat Video Kampanye Anti-Bullying'. Apa indikator keberhasilan proyek yang paling utama?",
    "o": [
      "Keindahan video dan kualitas grafis.",
      "Durasi video yang sangat panjang.",
      "Pesan kampanye tersampaikan dan memengaruhi perilaku siswa lain.",
      "Video menggunakan kamera canggih.",
      "Video dibuat oleh satu siswa saja."
    ],
    "a": 2
  },
  {
    "q": "36. Disajikan kasus tentang kebutuhan pengembangan profesi guru, mahasiswa dapat memilih organisasi profesi guru yang relevan untuk peningkatan kompetensi pedagogik dan profesional. Guru ingin meningkatkan kemampuan dalam membuat soal UP PPG. Organisasi apa yang paling tepat diikuti?",
    "o": [
      "Serikat Pekerja.",
      "Musyawarah Guru Mata Pelajaran (MGMP).",
      "Organisasi Olahraga.",
      "Lembaga Swadaya Masyarakat.",
      "Ikatan Alumni."
    ],
    "a": 1
  },
  {
    "q": "37. Disajikan narasi tentang implementasi nilai-nilai P5, mahasiswa dapat menentukan topik proyek yang relevan dengan tema 'Gaya Hidup Berkelanjutan'. Manakah topik proyek yang paling tepat?",
    "o": [
      "Pembuatan film sejarah nabi.",
      "Pembuatan kerajinan tangan dari barang bekas (recycle).",
      "Lomba azan antarkelas.",
      "Kunjungan ke museum.",
      "Debat tentang aliran ilmu kalam."
    ],
    "a": 1
  },
  {
    "q": "38. Disajikan kasus tentang keragaman budaya di kelas, mahasiswa dapat menentukan tindakan guru yang mencerminkan nilai-nilai Rahmatan lil 'Alamin. Apa yang harus dilakukan guru ketika ada siswa dari budaya lain yang kesulitan mengikuti pelajaran?",
    "o": [
      "Meminta siswa tersebut belajar lebih keras sendiri.",
      "Memberikan pendampingan khusus dan menciptakan suasana kelas yang inklusif.",
      "Meminta siswa tersebut pindah sekolah.",
      "Mengabaikan siswa tersebut karena dianggap lambat.",
      "Memberikan label negatif kepada siswa tersebut."
    ],
    "a": 1
  },
  {
    "q": "39. Disajikan deskripsi kasus penerapan model *flipped classroom*, mahasiswa dapat menentukan langkah pembelajaran yang tepat. Apa yang harus dilakukan siswa sebelum masuk kelas dalam model *flipped classroom*?",
    "o": [
      "Mengerjakan soal ujian.",
      "Mempelajari materi mandiri (menonton video/membaca) yang diberikan guru.",
      "Mendengarkan ceramah guru di kelas.",
      "Mengerjakan PR di kelas.",
      "Tidur untuk persiapan belajar."
    ],
    "a": 1
  },
  {
    "q": "40. Disajikan data tentang hasil belajar kognitif siswa, mahasiswa dapat menentukan jenis instrumen evaluasi yang tepat untuk mengukur kemampuan berpikir tingkat tinggi (*HOTS*). Jenis soal apa yang paling tepat?",
    "o": [
      "Soal pilihan ganda yang jawabannya ada di buku paket.",
      "Soal esai yang meminta siswa menganalisis sebuah kasus nyata.",
      "Soal menjodohkan istilah dan definisi.",
      "Soal benar-salah.",
      "Soal isian singkat."
    ],
    "a": 1
  },
  {
    "q": "41. Disajikan narasi tentang bimbingan konseling pada perilaku *cyberbullying*, mahasiswa dapat menentukan tindakan pencegahan yang tepat. Tindakan apa yang paling efektif dilakukan guru untuk mencegah *cyberbullying*?",
    "o": [
      "Menyita semua HP siswa.",
      "Mengadakan edukasi tentang etika berinternet dan dampak *cyberbullying*.",
      "Melarang siswa menggunakan media sosial.",
      "Menghukum siswa yang bermain HP di kelas.",
      "Mengabaikan kejadian *cyberbullying* karena terjadi di luar sekolah."
    ],
    "a": 1
  },
  {
    "q": "42. Disajikan deskripsi materi tentang 'Akhlak Tercela', mahasiswa dapat memilih media pembelajaran yang tepat untuk memvisualisasikan dampak negatif perilaku tercela. Media apa yang paling efektif?",
    "o": [
      "Gambar kartun statis.",
      "Buku teks.",
      "Video studi kasus atau film pendek.",
      "Rekaman suara.",
      "Teks pidato."
    ],
    "a": 2
  },
  {
    "q": "43. Disajikan narasi tentang penilaian portofolio, mahasiswa dapat menentukan komponen yang harus ada dalam portofolio siswa. Apa komponen utama dalam penilaian portofolio?",
    "o": [
      "Hanya kumpulan soal ujian tertulis.",
      "Kumpulan hasil karya, laporan proyek, dan refleksi diri siswa.",
      "Daftar hadir siswa.",
      "Catatan guru tentang perilaku siswa saja.",
      "Buku teks pelajaran."
    ],
    "a": 1
  },
  {
    "q": "44. Disajikan kasus tentang motivasi belajar rendah, mahasiswa dapat menentukan langkah remedial yang tepat untuk meningkatkan *self-efficacy* siswa. Langkah apa yang paling tepat?",
    "o": [
      "Memberikan nilai rendah agar siswa termotivasi.",
      "Memberikan umpan balik positif dan tugas yang bertahap dari mudah ke sukar.",
      "Meminta siswa belajar bersama teman yang pintar saja.",
      "Memberikan banyak latihan soal tanpa umpan balik.",
      "Membandingkan hasil belajar siswa dengan siswa lain."
    ],
    "a": 1
  },
  {
    "q": "45. Disajikan deskripsi tentang pembelajaran kontekstual pada materi Fikih, mahasiswa dapat memilih contoh penerapan yang sesuai. Manakah penerapan kontekstual untuk materi 'Jual Beli'?",
    "o": [
      "Menghafal rukun jual beli.",
      "Simulasi jual beli di pasar tradisional atau kantin sekolah.",
      "Mengerjakan soal pilihan ganda tentang jual beli.",
      "Menonton video tentang sejarah perdagangan.",
      "Membaca buku teks tentang jual beli."
    ],
    "a": 1
  },
  {
    "q": "46. Disajikan kasus tentang penggunaan teknologi yang tidak tepat, mahasiswa dapat mengevaluasi penggunaan teknologi dalam pembelajaran. Guru menggunakan media video yang tidak relevan dengan materi hanya agar terlihat modern. Evaluasi apa yang tepat?",
    "o": [
      "Penggunaan teknologi sudah tepat karena menggunakan video.",
      "Teknologi hanyalah alat, yang utama adalah kesesuaian media dengan tujuan pembelajaran.",
      "Guru harus membeli video yang lebih mahal.",
      "Teknologi tidak penting dalam pembelajaran.",
      "Guru harus menggunakan semua jenis teknologi sekaligus."
    ],
    "a": 1
  },
  {
    "q": "47. Disajikan narasi tentang penguatan karakter profil pelajar Pancasila, mahasiswa dapat menentukan kegiatan yang sesuai untuk dimensi 'Berkebinekaan Global'. Kegiatan apa yang paling tepat?",
    "o": [
      "Lomba azan tingkat nasional.",
      "Pertukaran budaya antarkelas atau mengenalkan kebudayaan daerah lain.",
      "Menghafal teks proklamasi.",
      "Mengerjakan soal matematika.",
      "Membersihkan kelas."
    ],
    "a": 1
  },
  {
    "q": "48. Disajikan kasus tentang pentingnya refleksi diri bagi guru, mahasiswa dapat menentukan langkah refleksi yang tepat untuk peningkatan kualitas pembelajaran. Apa langkah refleksi guru setelah mengajar?",
    "o": [
      "Langsung pulang setelah jam pelajaran selesai.",
      "Menganalisis kekurangan dan kelebihan metode pengajaran yang baru dilakukan.",
      "Menyalahkan siswa karena tidak mengerti materi.",
      "Mengecek kehadiran siswa saja.",
      "Meminta siswa mengerjakan tugas mandiri."
    ],
    "a": 1
  },
  {
    "q": "49. Disajikan narasi tentang hubungan antara akidah dan akhlak, mahasiswa dapat menentukan rumusan materi ajar yang tepat dalam pembelajaran. Materi apa yang paling tepat untuk menjelaskan hubungan akidah dan akhlak?",
    "o": [
      "Akidah sebagai pondasi perilaku dan akhlak sebagai buah dari keimanan.",
      "Akidah dan akhlak adalah dua hal yang tidak berkaitan.",
      "Akhlak lebih penting daripada akidah.",
      "Akidah hanya berkaitan dengan ibadah ritual saja.",
      "Akhlak hanya berkaitan dengan hubungan antarmanusia saja."
    ],
    "a": 0
  },
  {
    "q": "50. Disajikan kasus tentang penggunaan metode diskusi kelompok, mahasiswa dapat menentukan teknik yang tepat untuk mengaktifkan seluruh anggota kelompok. Teknik apa yang paling tepat?",
    "o": [
      "Membagi kelompok besar dan membiarkan ketua kelompok yang mengerjakan.",
      "Menggunakan teknik *Jigsaw* atau berbagi peran spesifik kepada setiap anggota.",
      "Memberikan tugas yang hanya bisa dikerjakan oleh satu orang.",
      "Membiarkan kelompok memilih anggota yang tidak aktif.",
      "Memberikan waktu diskusi yang sangat singkat."
    ],
    "a": 1
  }
]
