[
  {
    "q": "Seorang guru sedang mengajarkan tentang hakikat akidah Islam dan posisinya dalam ajaran Islam. Ia berharap peserta didiknya tidak hanya memahami konsep tersebut secara teoritis, tetapi juga menunjukkan peningkatan keimanan, ketakwaan, dan akhlak mulia dalam kesehariannya. Rumusan tujuan pembelajaran ranah sikap yang paling tepat untuk situasi ini adalah...",
    "o": [
      "Peserta didik dapat menyebutkan definisi akidah Islam.",
      "Peserta didik dapat menunjukkan perilaku beriman dan bertakwa kepada Allah dalam kehidupan sehari-hari.",
      "Peserta didik dapat membedakan akidah Islam dengan akidah lainnya.",
      "Peserta didik dapat menjelaskan posisi akidah dalam ajaran Islam.",
      "Peserta didik dapat menyusun makalah tentang akidah Islam."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran tentang konsep dasar Asmaul Husna, seorang guru menggunakan metode diskusi untuk mengasah kemampuan peserta didik dalam berpikir kritis. Rumusan tujuan pembelajaran ranah pengetahuan yang sesuai adalah...",
    "o": [
      "Peserta didik dapat menghafal seluruh Asmaul Husna.",
      "Peserta didik dapat mengkaji makna dan relevansi Asmaul Husna dalam kehidupan modern.",
      "Peserta didik dapat menirukan bacaan Asmaul Husna dengan tartil.",
      "Peserta didik dapat membuat lagu bertema Asmaul Husna.",
      "Peserta didik dapat mengamalkan sifat-sifat Allah dalam perilaku sehari-hari."
    ],
    "a": 1
  },
  {
    "q": "Pada pelajaran tentang hakikat akhlak Islam dan kedudukannya dalam ajaran Islam, guru mendorong siswa untuk membentuk kelompok dan menyelesaikan tugas secara gotong royong. Rumusan tujuan pembelajaran ranah keterampilan yang sesuai adalah...",
    "o": [
      "Peserta didik dapat menjelaskan definisi akhlak Islam.",
      "Peserta didik dapat menunjukkan kerja sama dalam menyelesaikan tugas kelompok sebagai cerminan akhlak mulia.",
      "Peserta didik dapat menyusun esai tentang akhlak Islam.",
      "Peserta didik dapat menghafalkan contoh-contoh akhlak mulia.",
      "Peserta didik dapat membandingkan akhlak Islam dan akhlak non-Islam."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran tentang aliran-aliran dalam ilmu kalam, seorang guru memperkenalkan perbedaan antar-aliran secara terbuka dan meminta peserta didik menghargai perbedaan tersebut. Rumusan tujuan pembelajaran ranah sikap yang sesuai adalah...",
    "o": [
      "Peserta didik dapat menyebutkan nama-nama aliran dalam ilmu kalam.",
      "Peserta didik dapat menolak aliran selain yang dipelajari.",
      "Peserta didik dapat menerima keberagaman pemikiran dalam tradisi ilmu kalam dengan sikap terbuka.",
      "Peserta didik dapat membuat diagram tentang aliran ilmu kalam.",
      "Peserta didik dapat mendebat pandangan aliran lain secara emosional."
    ],
    "a": 2
  },
  {
    "q": "Dalam membahas makna objek pembahasan tasawuf dan dalil-dalilnya, guru mendorong peserta didik untuk berpikir secara dinamis dan inovatif dalam memahami konsep tersebut. Rumusan indikator tujuan pembelajaran ranah pengetahuan yang tepat adalah...",
    "o": [
      "Peserta didik dapat menghafalkan dalil-dalil tasawuf.",
      "Peserta didik dapat menganalisis makna tasawuf dan menghubungkannya dengan tantangan kehidupan modern.",
      "Peserta didik dapat membaca buku-buku tasawuf klasik.",
      "Peserta didik dapat menyebutkan contoh tokoh-tokoh sufi.",
      "Peserta didik dapat membentuk komunitas pecinta tasawuf."
    ],
    "a": 1
  },
  {
    "q": "Seorang guru merancang aktivitas pembelajaran aqidah Islam dengan pendekatan Project Based Learning (PBL). Ia meminta mahasiswa menganalisis materi tentang Allah dan Kemaha-Esa-an Allah berdasarkan struktur keilmuan dan karakteristik peserta didik. Tujuan pembelajaran yang paling tepat dalam konteks ini adalah...",
    "o": [
      "Peserta didik mampu menyebutkan nama-nama Allah.",
      "Peserta didik mampu membuat proyek mini tentang konsep tauhid sesuai dengan tahap perkembangan kognitif mereka.",
      "Peserta didik mampu menghafalkan dalil tentang keesaan Allah.",
      "Peserta didik mampu membandingkan konsep ketuhanan dalam berbagai agama.",
      "Peserta didik mampu menulis makalah akademik tentang tauhid."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran tentang Asmaul Husna menggunakan pendekatan Project Based Learning (PjBL), guru melaksanakan aktivitas dengan fokus pada struktur keilmuan dan karakteristik peserta didik. Tujuan pembelajaran yang paling sesuai adalah...",
    "o": [
      "Peserta didik dapat menghafalkan seluruh Asmaul Husna dengan cepat.",
      "Peserta didik dapat membuat proyek kreatif tentang makna dan sifat Asmaul Husna yang relevan dengan kehidupan mereka.",
      "Peserta didik dapat berdebat tentang pentingnya Asmaul Husna.",
      "Peserta didik dapat menulis sejarah penyusunan Asmaul Husna.",
      "Peserta didik dapat membuat soal pilihan ganda tentang Asmaul Husna."
    ],
    "a": 1
  },
  {
    "q": "Dalam kegiatan evaluasi pembelajaran tentang akhlak mahmudah (terpuji) dan akhlak mazmumah (tercela) menggunakan Discovery Based Learning (DBL), guru ingin mengetahui sejauh mana peserta didik memahami konsep akhlak dalam kehidupan nyata. Materi ajar yang perlu diuraikan oleh mahasiswa adalah...",
    "o": [
      "Perbedaan mendasar antara akhlak mahmudah dan akhlak mazmumah.",
      "Sejarah perkembangan akhlak dalam peradaban Islam.",
      "Pengaruh budaya asing terhadap akhlak Islam.",
      "Metode menghafalkan istilah akhlak mahmudah.",
      "Definisi literal dari akhlak menurut bahasa Arab."
    ],
    "a": 0
  },
  {
    "q": "Seorang mahasiswa ditugaskan untuk merancang perencanaan materi ajar tentang aliran-aliran dalam ilmu kalam menggunakan pendekatan TPACK (Technological, Pedagogical, and Content Knowledge). Alur materi ajar yang tepat untuk tugas ini adalah...",
    "o": [
      "Menghafalkan nama-nama aliran tanpa pemahaman mendalam.",
      "Menyusun peta konsep karakteristik utama dari masing-masing aliran ilmu kalam berdasarkan integrasi teknologi, pedagogi, dan konten.",
      "Membuat daftar aliran secara alfabetis.",
      "Mengkritisi semua aliran selain aliran yang dianut guru.",
      "Menyusun soal pilihan ganda tanpa kajian karakteristik aliran."
    ],
    "a": 1
  },
  {
    "q": "Dalam pelaksanaan pembelajaran tentang aliran tasawuf dan tokoh-tokohnya menggunakan Discovery Learning (DL), guru meminta mahasiswa menelusuri sejarah kemunculan tasawuf dan faktor-faktor yang melatarbelakanginya. Alur materi ajar yang seharusnya dipilih adalah...",
    "o": [
      "Membandingkan tokoh tasawuf dengan tokoh non-Islam.",
      "Meneliti secara logis sebab-sebab kemunculan tasawuf dan perkembangannya di dunia Islam.",
      "Menyusun daftar tokoh tasawuf tanpa penjelasan sejarah.",
      "Menghafal tahun-tahun penting dalam sejarah tasawuf.",
      "Menghafal nama-nama tokoh tasawuf tanpa mengkaji faktor penyebabnya."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran tentang tasawuf, guru menggunakan model pelayanan konseling untuk mengembangkan pemahaman peserta didik tentang hubungan makhluk dengan Tuhan (hablum min Allah) dan hubungan sesama makhluk (hablum min al-nas). Alur materi ajar yang paling tepat dalam mengevaluasi tujuan pembelajaran adalah...",
    "o": [
      "Menjelaskan secara hafalan konsep hablum min Allah dan hablum min al-nas.",
      "Mengaitkan ruang lingkup tasawuf dengan sikap sosial dan spiritual peserta didik.",
      "Menghafal nama tokoh-tokoh tasawuf terkenal.",
      "Membuat poster tentang tasawuf.",
      "Menyusun pertanyaan tentang hablum min al-nas saja."
    ],
    "a": 1
  },
  {
    "q": "Seorang guru merencanakan program Penguatan Profil Pelajar Pancasila (P5). Ia ingin mengembangkan nilai-nilai P5 ke dalam tujuan pembelajaran yang sesuai dengan karakteristik peserta didik. Langkah pengembangan materi ajar yang tepat adalah...",
    "o": [
      "Menyisipkan hafalan teks Pancasila dalam semua mata pelajaran.",
      "Mengembangkan tema proyek berbasis nilai gotong royong, mandiri, kreatif, dan beriman.",
      "Membuat soal pilihan ganda tentang sejarah Pancasila saja.",
      "Mengadakan lomba hafalan nilai-nilai P5.",
      "Membatasi pembelajaran hanya pada nilai keadilan sosial."
    ],
    "a": 1
  },
  {
    "q": "Dalam pelaksanaan program Penguatan Profil Pelajar Rahmatan lil Alamin (PPRA), guru perlu mengembangkan materi ajar nilai-nilai Islam yang mencerminkan rahmat bagi semesta. Pengembangan materi ajar yang tepat adalah...",
    "o": [
      "Mengajarkan sikap toleransi, kepedulian sosial, dan cinta lingkungan.",
      "Menghafal nama-nama Nabi dan Rasul.",
      "Membahas konflik agama tanpa solusi.",
      "Menyuruh peserta didik membuat jurnal hafalan ayat-ayat Al-Qur'an saja.",
      "Mengkritik agama lain dalam pembelajaran."
    ],
    "a": 0
  },
  {
    "q": "Guru mengajak peserta didik mengkaji moderasi beragama berdasarkan praktik nyata di masyarakat. Pengembangan materi ajar yang sesuai adalah...",
    "o": [
      "Membahas pentingnya sikap fanatik terhadap agama sendiri.",
      "Menjelaskan Islam sebagai agama yang ekstrem dan kaku.",
      "Mengembangkan materi tentang Islam sebagai agama moderat (wasathiyah) yang mendorong toleransi dan keadilan.",
      "Menghafal hadis tentang jihad tanpa konteks.",
      "Membandingkan agama untuk menonjolkan keunggulan Islam secara eksklusif."
    ],
    "a": 2
  },
  {
    "q": "Dalam membahas alasan implementasi moderasi beragama, mahasiswa diharapkan dapat menilai pengembangan materi ajar Islam sebagai agama wasathiyah dengan alasan yang tepat. Pilihan yang paling sesuai adalah...",
    "o": [
      "Karena Islam harus mendominasi semua aspek kehidupan masyarakat.",
      "Karena moderasi beragama mendorong kehidupan beragama yang harmonis, adil, dan damai.",
      "Karena moderasi bertujuan membentuk superioritas agama tertentu.",
      "Karena Islam harus dibela dengan kekerasan jika perlu.",
      "Karena moderasi membuat agama menjadi lemah."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran materi tauhid sesuai dengan struktur keilmuan, guru menggunakan pendekatan Problem Based Learning (PBL). Rancangan pembelajaran yang paling tepat adalah...",
    "o": [
      "Memberikan kasus kehidupan sehari-hari tentang ketauhidan untuk dianalisis peserta didik.",
      "Menugaskan peserta didik menghafalkan dalil tauhid.",
      "Membacakan makalah tentang tauhid tanpa diskusi.",
      "Mengadakan kuis cepat tentang rukun iman.",
      "Membuat peta konsep hafalan tentang tauhid."
    ],
    "a": 0
  },
  {
    "q": "Dalam penerapan materi tauhid dalam kehidupan sehari-hari dengan struktur keilmuan, mahasiswa harus memilih rancangan dengan pendekatan PBL berbasis pengetahuan pedagogik. Strategi yang tepat adalah...",
    "o": [
      "Memberikan studi kasus tentang penerapan tauhid dalam perilaku jujur dan bertanggung jawab.",
      "Menghafalkan syahadat.",
      "Menghafalkan nama-nama Nabi saja.",
      "Membaca kitab klasik tanpa kontekstualisasi.",
      "Mengadakan lomba hafalan Al-Qur'an."
    ],
    "a": 0
  },
  {
    "q": "Guru memberikan kasus tentang penerapan nilai-nilai Asmaul Husna dalam kehidupan sehari-hari sesuai struktur keilmuan berbasis teknologi. Rancangan pembelajaran yang tepat adalah...",
    "o": [
      "Membuat proyek digital seperti video kreatif tentang pengamalan Asmaul Husna.",
      "Menghafalkan seluruh Asmaul Husna saja.",
      "Membuat poster tradisional tentang Asmaul Husna.",
      "Mengadakan lomba adzan.",
      "Membuat makalah tentang sejarah Asmaul Husna."
    ],
    "a": 0
  },
  {
    "q": "Dalam materi macam-macam akhlak terpuji (mahmudah) dan akhlak tercela (mazmumah), pembelajaran dirancang menggunakan pendekatan berbasis perbedaan individu. Rancangan pembelajaran yang paling sesuai adalah...",
    "o": [
      "Memberikan tugas reflektif yang memperhatikan latar belakang dan karakter peserta didik.",
      "Menyuruh semua peserta didik menghafal definisi akhlak.",
      "Menggunakan metode ceramah satu arah.",
      "Membuat soal pilihan ganda seragam untuk semua peserta.",
      "Memberikan hukuman kepada yang tidak hafal materi."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran tentang kontribusi tokoh-tokoh utama dalam Ilmu Kalam, guru ingin menerapkan pendekatan berbasis perbedaan individu sesuai pengetahuan pedagogik. Rancangan pembelajaran yang paling tepat adalah...",
    "o": [
      "Menyesuaikan aktivitas pembelajaran dengan gaya belajar peserta didik saat mempelajari tokoh-tokoh Ilmu Kalam.",
      "Memaksa semua peserta didik menulis makalah panjang.",
      "Memberikan satu soal untuk seluruh peserta tanpa diskusi.",
      "Menyuruh peserta didik menonton dokumenter tanpa refleksi.",
      "Menghafalkan nama-nama tokoh tanpa memahami kontribusinya."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran tentang aliran-aliran tasawuf dan kontribusi tokohnya terhadap perkembangan spiritualitas Islam, guru ingin menerapkan pembelajaran berbasis perbedaan individu dengan memanfaatkan teknologi. Rancangan pembelajaran yang paling tepat adalah...",
    "o": [
      "Membuat blog pribadi peserta didik tentang tokoh tasawuf pilihannya.",
      "Membacakan daftar tokoh-tokoh tasawuf saja.",
      "Memberikan tes hafalan tentang aliran tasawuf.",
      "Menghafal nama aliran tasawuf tanpa diskusi.",
      "Menyuruh semua peserta membuat makalah seragam."
    ],
    "a": 0
  },
  {
    "q": "Seorang guru memberikan kasus pembelajaran mengenai hubungan makhluk dengan Tuhan (hablum min Allah) dan hubungan sesama makhluk (hablum min al-nas) dalam tasawuf. Guru menerapkan pembelajaran mendalam (deep learning). Langkah terbaik dalam merancang pembelajaran adalah...",
    "o": [
      "Menghafalkan ayat-ayat Al-Qur'an yang berkaitan dengan tasawuf saja.",
      "Menganalisis makna hubungan spiritual dan sosial dalam kehidupan nyata peserta didik.",
      "Membuat daftar nama-nama sufi terkenal.",
      "Menyuruh peserta menulis ulang teori tasawuf.",
      "Mengadakan ulangan hafalan."
    ],
    "a": 1
  },
  {
    "q": "Pada kasus serupa tentang hablum min Allah dan hablum min al-nas, guru ingin menyusun pembelajaran mendalam berbasis pengetahuan pedagogi. Pilihan langkah terbaik adalah...",
    "o": [
      "Menggunakan metode diskusi kritis dan reflektif terhadap praktik hubungan spiritual dan sosial.",
      "Menghafalkan definisi hubungan makhluk dengan Tuhan.",
      "Membuat sketsa hubungan makhluk dengan Tuhan tanpa penjelasan.",
      "Memberi tugas hafalan nama sufi.",
      "Memberikan ceramah panjang tanpa melibatkan peserta didik."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran tentang pendidikan nilai dan pendidikan karakter, guru memilih pendekatan pembelajaran mendalam berbasis pengetahuan teknologi. Rancangan pembelajaran yang sesuai adalah...",
    "o": [
      "Membuat media interaktif digital untuk menumbuhkan sikap jujur, disiplin, dan tanggung jawab.",
      "Menghafalkan slogan-slogan karakter.",
      "Membaca buku karakter tanpa diskusi.",
      "Memberikan tugas menulis panjang tentang pendidikan karakter.",
      "Melakukan ceramah satu arah tentang nilai-nilai."
    ],
    "a": 0
  },
  {
    "q": "In pembelajaran tentang moderasi beragama, guru menggunakan pendekatan TPACK untuk merancang pembelajaran. Langkah paling tepat adalah...",
    "o": [
      "Mengintegrasikan konten Islam moderat dengan teknologi digital dan metode pedagogi kreatif.",
      "Menghafal pengertian moderasi saja.",
      "Menyuruh peserta mendengarkan ceramah saja.",
      "Membuat soal pilihan ganda biasa tentang moderasi.",
      "Memberikan tugas menghafal saja tanpa aplikasi teknologi."
    ],
    "a": 0
  },
  {
    "q": "Diberikan kasus penyajian materi Allah dan Kemaha-Esa-an Allah yang kurang relevan dengan zaman sekarang, mahasiswa memilih pendekatan Problem Based Learning (PBL). Strategi yang tepat adalah...",
    "o": [
      "Memberikan masalah nyata tentang pengamalan tauhid dalam dunia modern untuk dianalisis peserta didik.",
      "Membacakan kitab klasik tanpa konteks.",
      "Menyuruh peserta membuat peta konsep hafalan.",
      "Mengadakan kuis hafalan dalil saja.",
      "Memberikan tugas makalah kaku tanpa diskusi."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran tauhid dan aspeknya yang kurang sesuai perkembangan zaman, mahasiswa menggunakan Project Based Learning (PjBL). Rancangan pembelajaran yang paling sesuai adalah...",
    "o": [
      "Mengembangkan proyek sosial tentang nilai tauhid dalam kehidupan masyarakat modern.",
      "Menghafalkan 99 Asmaul Husna saja.",
      "Menyuruh peserta membuat makalah panjang.",
      "Memberikan ceramah tentang tauhid tanpa refleksi.",
      "Membuat soal pilihan ganda tentang rukun iman."
    ],
    "a": 0
  },
  {
    "q": "Dalam kasus pembelajaran nilai-nilai Asmaul Husna yang kurang sesuai zaman, mahasiswa menggunakan pendekatan Design Based Learning (DBL). Strategi terbaik adalah...",
    "o": [
      "Mendesain produk kreatif berbasis nilai-nilai Asmaul Husna yang dapat diterapkan dalam kehidupan nyata.",
      "Menghafalkan seluruh Asmaul Husna tanpa makna.",
      "Membuat tabel nama-nama Asmaul Husna.",
      "Membuat ringkasan dari kitab tafsir saja.",
      "Memberikan soal hafalan tentang arti Asmaul Husna."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran akhlak terpuji dan tercela, mahasiswa menggunakan pendekatan Discovery Learning (DL) untuk menciptakan suasana belajar akomodatif. Strategi pembelajaran yang paling tepat adalah...",
    "o": [
      "Membimbing peserta didik menemukan contoh akhlak mahmudah dan mazmumah dari kehidupan sehari-hari.",
      "Menyuruh semua peserta menghafal definisi akhlak.",
      "Mengadakan tes pilihan ganda tanpa diskusi.",
      "Membacakan cerita akhlak tanpa tanya jawab.",
      "Memberikan tugas membuat makalah tanpa panduan."
    ],
    "a": 0
  },
  {
    "q": "Dalam kasus pembelajaran tentang objek pembahasan Ilmu Kalam (seperti qadha-qadar, sifat Allah, kebebasan manusia), mahasiswa menggunakan pendekatan TPACK untuk menciptakan suasana belajar adaptif. Rancangan pembelajaran yang sesuai adalah...",
    "o": [
      "Menggabungkan materi keilmuan, teknologi pembelajaran, dan metode pedagogik inovatif dalam membahas isu-isu Ilmu Kalam.",
      "Membacakan ringkasan buku saja.",
      "Memberikan hafalan definisi qadha dan qadar.",
      "Menyuruh peserta menulis soal essay panjang.",
      "Menghafalkan ayat Al-Qur'an saja."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran tentang aliran-aliran tasawuf dan kontribusi tokohnya yang kurang sesuai perkembangan zaman, guru memilih pendekatan pelayanan bimbingan konseling. Strategi yang paling tepat adalah...",
    "o": [
      "Memberikan konseling kelompok tentang aktualisasi nilai tasawuf dalam kehidupan.",
      "Membacakan daftar nama tokoh tasawuf.",
      "Menyuruh peserta membuat peta hafalan.",
      "Mengadakan hafalan aliran tasawuf.",
      "Ceramah tentang sejarah tasawuf tanpa diskusi."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran hubungan makhluk dengan Tuhan dan sesama makhluk, guru memilih pendekatan berbasis pelayanan ABK (Anak Berkebutuhan Khusus). Strategi yang sesuai adalah...",
    "o": [
      "Menyediakan berbagai metode pembelajaran yang adaptif terhadap kebutuhan peserta didik.",
      "Memberikan tugas seragam kepada semua peserta.",
      "Menyuruh hafalan dalil tanpa pemahaman.",
      "Mengadakan ulangan umum tanpa diferensiasi.",
      "Menyuruh semua peserta membuat makalah."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran hubungan makhluk dengan Tuhan dan sesama, guru ingin memilih pendekatan pembelajaran yang relevan. Langkah terbaik adalah...",
    "o": [
      "Menyesuaikan metode dengan kebutuhan zaman dan karakteristik peserta didik.",
      "Membacakan teks kitab tasawuf tanpa pengembangan.",
      "Menyuruh menghafalkan teori-teori klasik.",
      "Memberikan ceramah satu arah tentang tasawuf.",
      "Menyuruh menghafal hubungan hablum min Allah saja."
    ],
    "a": 0
  },
  {
    "q": "Pada pembelajaran pendidikan nilai dan pendidikan karakter yang materinya kurang relevan, pendekatan yang relevan adalah...",
    "o": [
      "Mengaitkan nilai-nilai karakter dengan tantangan kehidupan peserta didik masa kini.",
      "Menghafalkan definisi nilai-nilai pendidikan saja.",
      "Membaca buku nilai pendidikan tanpa diskusi.",
      "Membuat soal pilihan ganda hafalan.",
      "Memberikan ceramah nilai-nilai klasik."
    ],
    "a": 0
  },
  {
    "q": "Pada materi prinsip-prinsip moderasi beragama yang perlu disesuaikan zaman, pendekatan yang relevan adalah...",
    "o": [
      "Mengaitkan prinsip moderasi dengan kasus nyata kehidupan sosial peserta didik.",
      "Menyuruh menghafalkan prinsip moderasi.",
      "Membuat tabel prinsip moderasi tanpa diskusi.",
      "Membacakan makalah tanpa melibatkan peserta didik.",
      "Memberikan ulangan hafalan prinsip moderasi."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran aqidah Islam menggunakan pendekatan PBL, teknik asesmen yang tepat adalah...",
    "o": [
      "Observasi sikap peserta saat diskusi problematika aqidah.",
      "Tes pilihan ganda hafalan.",
      "Tes essay hafalan saja.",
      "Menyuruh peserta menghafal dalil.",
      "Membacakan materi tanpa asesmen."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran aqidah Islam menggunakan PjBL, instrumen asesmen yang paling sesuai adalah...",
    "o": [
      "Rubrik penilaian proyek karya nyata terkait nilai-nilai aqidah.",
      "Lembar jawaban hafalan.",
      "Tes pilihan ganda hafalan.",
      "Tes tertulis biasa.",
      "Ulangan harian."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran Asmaul Husna dengan pendekatan Discovery Learning (DL), teknik asesmen yang tepat adalah...",
    "o": [
      "Observasi dan portofolio hasil penemuan nilai-nilai Asmaul Husna.",
      "Tes pilihan ganda hafalan.",
      "Ceramah tanpa asesmen.",
      "Tes essay menghafal Asmaul Husna.",
      "Memberikan soal-soal hafalan."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran akhlak mahmudah dan mazmumah, instrumen asesmen yang sesuai adalah...",
    "o": [
      "Rubrik penilaian praktik sikap dan refleksi nilai akhlak.",
      "Tes hafalan nilai-nilai akhlak.",
      "Tes tertulis definisi akhlak.",
      "Kuis pilihan ganda saja.",
      "Menyuruh membuat makalah."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran tentang objek pembahasan Ilmu Kalam, teknik asesmen yang tepat adalah...",
    "o": [
      "Observasi sikap analitis peserta dalam memahami masalah kalam.",
      "Tes pilihan ganda saja.",
      "Ceramah hafalan.",
      "Tes essay panjang.",
      "Tes hafalan dalil saja."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran tentang aliran tasawuf dan tokohnya, instrumen asesmen yang tepat adalah...",
    "o": [
      "Rubrik analisis kontribusi tokoh terhadap tasawuf.",
      "Tes hafalan nama tokoh.",
      "Membuat tabel daftar aliran tasawuf.",
      "Menulis definisi tokoh tasawuf.",
      "Mengadakan ulangan hafalan."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran objek pembahasan tasawuf, teknik asesmen yang mempertimbangkan hasil asesmen sebelumnya adalah...",
    "o": [
      "Observasi perkembangan sikap spiritual dan sosial peserta didik.",
      "Tes pilihan ganda.",
      "Hafalan teori tasawuf.",
      "Membuat soal essay hafalan.",
      "Ceramah tentang tasawuf."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran objek pembahasan tasawuf, instrumen asesmen yang mempertimbangkan hasil asesmen sebelumnya adalah...",
    "o": [
      "Portofolio pengembangan sikap dan pemahaman peserta.",
      "Tes pilihan ganda biasa.",
      "Ulangan hafalan nama-nama sufi.",
      "Essay hafalan objek tasawuf.",
      "Ceramah tanpa asesmen."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran pendidikan nilai atau karakter, teknik asesmen yang mempertimbangkan hasil asesmen awal adalah...",
    "o": [
      "Observasi perubahan perilaku peserta didik.",
      "Tes hafalan nilai karakter.",
      "Membuat daftar nilai karakter.",
      "Essay tentang nilai karakter.",
      "Tes pilihan ganda nilai-nilai."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran Islam sebagai agama moderat, instrumen asesmen yang mempertimbangkan hasil asesmen awal adalah...",
    "o": [
      "Rubrik sikap toleransi, keadilan, dan moderasi peserta didik.",
      "Tes hafalan dalil moderasi.",
      "Ulangan definisi moderasi.",
      "Essay panjang tanpa refleksi.",
      "Membacakan prinsip-prinsip moderasi."
    ],
    "a": 0
  },
  {
    "q": "Dalam praktek pembelajaran aqidah Islam berbasis konten, pedagogi, dan teknologi, mahasiswa perlu mengidentifikasi praktik baik. Yang termasuk praktik baik adalah...",
    "o": [
      "Integrasi materi, metode, dan teknologi sesuai kebutuhan peserta didik.",
      "Hanya menggunakan ceramah klasik.",
      "Mengabaikan teknologi baru.",
      "Fokus pada hafalan.",
      "Memberikan tugas tanpa pembimbingan."
    ],
    "a": 0
  },
  {
    "q": "Dalam praktek pembelajaran akhlak mahmudah dan mazmumah, praktik baik pelaksanaan pembelajaran adalah...",
    "o": [
      "Melibatkan peserta didik dalam simulasi nilai akhlak dalam kehidupan nyata.",
      "Memberikan ceramah panjang saja.",
      "Menyuruh membuat makalah hafalan.",
      "Memberikan tes pilihan ganda saja.",
      "Membaca buku akhlak tanpa diskusi."
    ],
    "a": 0
  },
  {
    "q": "Dalam praktek pembelajaran aliran ilmu kalam, praktik baik dalam evaluasi pembelajaran adalah...",
    "o": [
      "Menilai kemampuan analisis kritis peserta terhadap konsep-konsep kalam.",
      "Memberikan soal pilihan ganda hafalan.",
      "Membuat soal essay hafalan.",
      "Ceramah hafalan objek kalam.",
      "Memberikan daftar hafalan aliran kalam."
    ],
    "a": 0
  },
  {
    "q": "Dalam menilai kemampuan guru di era digital dan AI terhadap akidah akhlak, penilaian yang relevan adalah...",
    "o": [
      "Kemampuan beradaptasi dan mengembangkan pembelajaran berbasis AI.",
      "Hafalan kitab klasik.",
      "Fokus ceramah saja.",
      "Mengabaikan teknologi baru.",
      "Mengandalkan hafalan manual."
    ],
    "a": 0
  },
  {
    "q": "Dalam penggunaan AI untuk pembelajaran akidah akhlak bermakna, masalah dan solusi ilmiahnya adalah...",
    "o": [
      "Mengidentifikasi tantangan penggunaan AI dan merancang inovasi pembelajaran adaptif.",
      "Menolak penggunaan AI dalam pendidikan.",
      "Fokus hafalan teks keagamaan.",
      "Menggunakan metode ceramah tradisional.",
      "Menyuruh peserta hafalan dalil saja."
    ],
    "a": 0
  }
]
