[
    {
      "q": "Disajikan deskripsi materi tentang zakat hasil tanah yang disewakan.\n\nSeorang petani menyewakan lahan pertaniannya kepada pihak lain dengan sistem bagi hasil. Hasil panen yang diperoleh kemudian dikenakan zakat sesuai ketentuan fiqih. Dalam konteks ini, zakat hasil tanah yang disewakan memiliki ketentuan khusus yang berbeda dengan zakat tanah yang digarap sendiri.\n\nBerdasarkan deskripsi tersebut, rumusan tujuan pembelajaran ranah sikap yang paling sesuai dengan indikator tujuan supaya peserta didik dapat meningkatkan keimanan, ketakwaan dan akhlak mulia adalah …",
      "o": [
        "Peserta didik dapat menghitung nisab dan haul zakat hasil tanah yang disewakan dengan tepat.",
        "Peserta didik mampu membedakan ketentuan zakat tanah yang digarap sendiri dengan yang disewakan.",
        "Peserta didik menunjukkan sikap taat kepada Allah SWT dengan membayar zakat hasil tanah yang disewakan sesuai ketentuan syariat.",
        "Peserta didik dapat menjelaskan dalil-dalil naqli tentang kewajiban zakat hasil tanah.",
        "Peserta didik mampu menganalisis sistem bagi hasil dalam penyewaan tanah pertanian."
      ],
      "a": 2
    },
    {
      "q": "Disajikan pernyataan materi tentang zakat profesi dan zakat produktif.\n\nDi era modern, profesi seperti dokter, pengacara, dan konsultan menghasilkan penghasilan yang signifikan. Para fuqaha kontemporer berbeda pendapat mengenai kewajiban zakat atas penghasilan tersebut. Beberapa berpendapat bahwa penghasilan profesi terkena zakat dengan nisab dan haul yang disederhanakan, sementara yang lain mengikuti ketentuan zakat perdagangan.\n\nBerdasarkan pernyataan tersebut, rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan indikator supaya peserta didik mampu berpikir kritis adalah …",
      "o": [
        "Peserta didik dapat menghafal dalil-dalil tentang zakat profesi secara lengkap.",
        "Peserta didik mampu menganalisis perbedaan pendapat para fuqaha mengenai zakat profesi dan mengevaluasi argumentasi masing-masing mazhab secara kritis.",
        "Peserta didik dapat menyebutkan jenis-jenis profesi yang wajib dizakati.",
        "Peserta didik menunjukkan sikap rajin bekerja dalam menjalankan profesi masing-masing.",
        "Peserta didik mampu menghitung zakat profesi dengan metode sederhana."
      ],
      "a": 1
    },
    {
      "q": "Disajikan pernyataan materi tentang penyaluran zakat untuk pembangunan masjid.\n\nSebuah masjid di daerah terpencil membutuhkan renovasi besar-besaran karena kondisi bangunan yang sudah tidak layak. Panitia zakat setempat berencana menggunakan sebagian dana zakat untuk pembangunan masjid tersebut dengan pertimbangan bahwa masjid merupakan fasilitas umum yang bermanfaat untuk masyarakat banyak.\n\nBerdasarkan pernyataan tersebut, rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai dengan indikator supaya peserta didik memiliki semangat gotong royong adalah …",
      "o": [
        "Peserta didik dapat menghitung jumlah zakat yang boleh disalurkan untuk pembangunan masjid.",
        "Peserta didik mampu mengidentifikasi golongan yang berhak menerima zakat.",
        "Peserta didik dapat berpartisipasi aktif dalam kegiatan penggalangan dana dan pembangunan fasilitas umum seperti masjid melalui kerja sama tim dengan semangat gotong royong.",
        "Peserta didik dapat menjelaskan dalil tentang delapan asnaf zakat.",
        "Peserta didik mampu menganalisis kelayakan bangunan masjid dari sisi fiqih."
      ],
      "a": 2
    },
    {
      "q": "Disajikan deskripsi kasus pengembangan materi tentang monogami, poligami, atau nikah mut'ah.\n\nDi sebuah komunitas, terdapat perdebatan mengenai praktik poligami yang dilakukan oleh sebagian anggota masyarakat. Sementara itu, ada pula kelompok yang menganggap nikah mut'ah sebagai solusi praktis untuk kebutuhan sosial tertentu. Guru fiqih dituntut untuk menyikapi perbedaan pandangan ini dengan bijaksana tanpa menghakimi tradisi masing-masing kelompok.\n\nBerdasarkan deskripsi kasus tersebut, rumusan indikator tujuan pembelajaran ranah sikap yang paling sesuai dengan materi supaya peserta didik memiliki sikap penerimaan terhadap tradisi adalah …",
      "o": [
        "Peserta didik dapat menyebutkan syarat-syarat sah poligami menurut fiqih.",
        "Peserta didik mampu membedakan antara nikah mut'ah dan nikah permanen.",
        "Peserta didik menunjukkan sikap menghargai dan menerima perbedaan tradisi dalam masyarakat tanpa diskriminasi, serta mampu berdialog konstruktif tentang hukum Islam.",
        "Peserta didik dapat menghafal dalil-dalil tentang poligami dalam al-Qur'an.",
        "Peserta didik mampu menganalisis dampak sosial poligami dalam masyarakat modern."
      ],
      "a": 2
    },
    {
      "q": "Disajikan deskripsi materi tentang bank, rente, dan fee.\n\nPerkembangan sistem perbankan syariah menawarkan alternatif bagi masyarakat yang ingin menghindari riba. Namun, praktik fee dan rente dalam transaksi keuangan modern seringkali memunculkan pertanyaan mengenai batasan-batasan syariah. Diperlukan pemikiran dinamis dan inovatif untuk mengadaptasi ketentuan fiqih klasik dengan realitas ekonomi kontemporer.\n\nBerdasarkan deskripsi tersebut, rumusan indikator tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan materi supaya peserta didik memiliki kemampuan berpikir dinamis dan inovatif adalah …",
      "o": [
        "Peserta didik dapat menghafal definisi riba menurut para ulama klasik.",
        "Peserta didik mampu menganalisis mekanisme bank syariah dan konvensional secara komparatif.",
        "Peserta didik dapat mengembangkan solusi inovatif untuk transaksi keuangan modern yang sesuai dengan prinsip-prinsip fiqih muamalat dengan berpikir dinamis dan kreatif.",
        "Peserta didik dapat menyebutkan jenis-jenis transaksi yang terlarang dalam Islam.",
        "Peserta didik menunjukkan sikap anti riba dalam setiap transaksi keuangan."
      ],
      "a": 2
    },
    {
      "q": "Disajikan deskripsi aktivitas pembelajaran guru dalam perencanaan tujuan pembelajaran dengan pendekatan PBL.\n\nSeorang guru fiqih merencanakan pembelajaran tentang zakat hasil tanah yang disewakan menggunakan pendekatan Problem-Based Learning (PBL). Guru tersebut mengidentifikasi struktur keilmuan materi yang meliputi: (1) pengertian dan ruang lingkup, (2) dalil-dalil hukum, (3) ketentuan fikih, (4) perbedaan pendapat ulama, dan (5) aplikasi kontemporer. Karakteristik peserta didik yang menjadi pertimbangan adalah kemampuan berpikir analitis yang sudah berkembang.\n\nBerdasarkan deskripsi aktivitas tersebut, analisis materi ajar zakat hasil tanah yang disewakan berdasarkan struktur keilmuan pada perencanaan tujuan pembelajaran yang paling tepat sesuai dengan karakteristik peserta didik adalah …",
      "o": [
        "Menyajikan materi secara deskriptif tanpa mengaitkan dengan masalah nyata.",
        "Mengorganisasi materi dari kasus konkret penyewaan tanah, menganalisis problematika zakatnya, mengeksplorasi dalil dan kaidah fiqih, serta merumuskan solusi berdasarkan perbedaan pendapat ulama.",
        "Menghafalkan dalil-dalil tentang zakat hasil tanah tanpa pemahaman kontekstual.",
        "Mengajarkan perhitungan zakat tanpa memahami dasar hukumnya.",
        "Mengabaikan perbedaan pendapat ulama dalam penyajian materi."
      ],
      "a": 1
    },
    {
      "q": "Disajikan deskripsi aktivitas guru dalam pelaksanaan tujuan pembelajaran zakat profesi atau zakat produktif dengan pendekatan PjBL.\n\nGuru fiqih melaksanakan pembelajaran tentang zakat profesi menggunakan pendekatan Project-Based Learning (PjBL). Peserta didik dibagi dalam kelompok untuk melaksanakan proyek pengumpulan dan penyaluran zakat profesi di lingkungan sekolah. Struktur keilmuan materi meliputi konsep dasar, ketentuan fikih, perhitungan, dan manajemen zakat. Karakteristik peserta didik menunjukkan kebutuhan pembelajaran yang berbasis pengalaman nyata.\n\nBerdasarkan deskripsi aktivitas tersebut, analisis materi ajar zakat profesi atau zakat produktif berdasarkan struktur keilmuan pada pelaksanaan tujuan pembelajaran yang paling tepat sesuai dengan karakteristik peserta didik adalah …",
      "o": [
        "Menyajikan materi secara teoriis di dalam kelas tanpa aktivitas praktik.",
        "Mengintegrasikan konsep zakat profesi, ketentuan fikih, dan perhitungan dalam proyek nyata pengelolaan zakat yang melibatkan peserta didik secara aktif dan berkelanjutan.",
        "Memberikan tugas individu menghafal ketentuan zakat profesi.",
        "Mengabaikan aspek manajemen dalam penyaluran zakat.",
        "Fokus pada teori tanpa menghubungkan dengan praktik kehidupan."
      ],
      "a": 1
    },
    {
      "q": "Disajikan narasi kasus guru melakukan evaluasi pembelajaran materi penyaluran zakat untuk pembangunan masjid dengan pendekatan DBL.\n\nSeorang guru fiqih melakukan evaluasi pembelajaran tentang penyaluran zakat untuk pembangunan masjid menggunakan pendekatan Design-Based Learning (DBL). Peserta didik diminta merancang proposal penyaluran zakat yang sesuai dengan ketentuan fiqih. Evaluasi dilakukan terhadap proses perancangan, pemahaman konsep, dan kelayakan proposal. Karakteristik peserta didik menunjukkan variasi kemampuan dalam berpikir desain.\n\nBerdasarkan narasi kasus tersebut, penguraian materi ajar penyaluran zakat untuk pembangunan masjid dalam evaluasi tujuan pembelajaran yang paling tepat sesuai dengan karakteristik peserta didik adalah …",
      "o": [
        "Evaluasi hanya berfokus pada hasil akhir proposal tanpa memperhatikan proses.",
        "Mengevaluasi pemahaman delapan asnaf zakat, ketentuan fiqih tentang penyaluran zakat untuk amil masjid, serta keterampilan merancang proposal yang sistematis dan sesuai ketentuan syariah.",
        "Memberikan nilai berdasarkan keaktifan saja tanpa rubrik jelas.",
        "Mengabaikan aspek ketentuan fiqih dalam evaluasi proposal.",
        "Evaluasi hanya menggunakan tes tertulis tanpa asesmen proyek."
      ],
      "a": 1
    },
    {
      "q": "Disajikan pernyataan praktik pedagogi tentang perencanaan materi ajar monogami, poligami atau nikah mut'ah secara logis dengan pendekatan TPACK.\n\nGuru fiqih merencanakan pembelajaran tentang monogami, poligami, dan nikah mut'ah dengan mengintegrasikan Technology, Pedagogy, And Content Knowledge (TPACK). Konten materi meliputi ketentuan fiqih nikah, pedagogi menggunakan diskusi berbasis kasus, dan teknologi berupa platform kolaborasi online. Karakteristik peserta didik adalah generasi digital yang memerlukan pembelajaran interaktif.\n\nBerdasarkan pernyataan praktik pedagogi tersebut, alur materi ajar monogami, poligami, atau nikah mut'ah dalam perencanaan tujuan pembelajaran yang paling tepat sesuai dengan karakteristik peserta didik adalah …",
      "o": [
        "Menyajikan materi secara linear dari teori ke contoh tanpa teknologi.",
        "Mengintegrasikan pemahaman konsep nikah dalam fiqih, analisis kasus poligami dan nikah mut'ah melalui diskusi kolaboratif online, serta refleksi kritis menggunakan tools digital untuk membangun pemahaman komprehensif.",
        "Menggunakan teknologi tanpa kaitan dengan materi dan metode pembelajaran.",
        "Fokus pada hafalan ketentuan nikah tanpa analisis kasus.",
        "Mengabaikan aspek teknologi dalam perencanaan pembelajaran."
      ],
      "a": 1
    },
    {
      "q": "Disajikan pernyataan praktik pedagogi tentang pelaksanaan materi ajar bank, rente atau fee secara logis dengan pendekatan Deep Learning (DL).\n\nDalam pembelajaran tentang bank, rente, dan fee, guru fiqih menerapkan pendekatan Deep Learning (DL) untuk mengembangkan critical thinking peserta didik. Materi disusun secara hierarkis dari konsep dasar riba, analisis sistem perbankan modern, hingga evaluasi produk keuangan syariah. Karakteristik peserta didik menunjukkan kesiapan untuk pembelajaran yang menantang secara intelektual.\n\nBerdasarkan pernyataan praktik pedagogi tersebut, alur materi ajar tentang bank, rente, atau fee pada pelaksanaan tujuan pembelajaran yang paling tepat sesuai dengan karakteristik peserta didik adalah …",
      "o": [
        "Menyajikan materi secara dangkal tanpa kedalaman analisis.",
        "Membangun pemahaman mendalam melalui: eksplorasi konsep riba dan ilmu kalam, analisis kritis sistem perbankan konvensional vs syariah, evaluasi produk rente dan fee, serta sintesis pemikiran fiqih kontemporer untuk solusi keuangan Islami.",
        "Hanya menyebutkan definisi tanpa analisis komparatif.",
        "Mengabaikan aspek kontemporer dalam pembahasan.",
        "Fokus pada hafalan ketentuan tanpa pemahaman konseptual."
      ],
      "a": 1
    },
    {
      "q": "Disajikan pernyataan praktik pedagogi tentang pelaksanaan materi ajar pemerintahan dalam Islam secara logis dengan model pelayanan konseling.\n\nGuru fiqih mengimplementasikan pembelajaran tentang pemerintahan dalam Islam dengan model pelayanan konseling. Materi meliputi konsep khilafah, imamah, dan sistem pemerintahan modern. Pendekatan konseling digunakan untuk membantu peserta didik memahami kompleksitas penerapan sistem pemerintahan Islam dalam konteks kenegaraan modern. Karakteristik peserta didik memerlukan bimbingan personal dalam memahami isu kontroversial.\n\nBerdasarkan pernyataan praktik pedagogi tersebut, alur materi ajar pemerintahan dalam Islam dalam mengevaluasi tujuan pembelajaran yang paling tepat sesuai dengan karakteristik peserta didik adalah …",
      "o": [
        "Menyajikan materi secara dogmatis tanpa ruang diskusi.",
        "Mengevaluasi pemahaman konsep pemerintahan Islam melalui sesi konseling individual/kelompok, analisis kasus penerapan di berbagai negara, dan bimbingan refleksi untuk membangun pemahaman yang matang dan kontekstual.",
        "Mengabaikan perbedaan konteks historis dan modern.",
        "Fokus pada hafalan istilah tanpa pemahaman aplikatif.",
        "Tidak menyediakan layanan bimbingan bagi peserta didik yang memerlukan."
      ],
      "a": 1
    },
    {
      "q": "Disajikan pernyataan praktik pedagogi tentang pelaksanaan program penguatan profil pelajar pancasila (P5) secara logis.\n\nSebuah sekolah melaksanakan program Penguatan Profil Pelajar Pancasila (P5) dengan mengintegrasikan nilai-nilai P5 dalam pembelajaran fiqih. Materi ajar dikembangkan berdasarkan struktur keilmuan yang mencakup: (1) pengidentifikasian nilai-nilai Islam dalam P5, (2) analisis relevansi dengan dimensi profil pelajar, (3) desain aktivitas pengembangan karakter, dan (4) evaluasi pencapaian. Karakteristik peserta didik memerlukan pembelajaran yang mengintegrasikan nilai-nilai kebangsaan.\n\nBerdasarkan pernyataan praktik pedagogi tersebut, pengembangan materi ajar nilai-nilai P5 dalam merencanakan tujuan pembelajaran yang paling tepat sesuai dengan karakteristik peserta didik adalah …",
      "o": [
        "Mengabaikan keterkaitan antara fiqih dan nilai-nilai P5.",
        "Mengembangkan materi yang mengintegrasikan nilai-nilai fiqih seperti keadilan, toleransi, dan gotong royong dengan dimensi profil pelajar Pancasila melalui aktivitas projek yang terstruktur dan terukur.",
        "Menyajikan fiqih dan P5 sebagai materi yang terpisah.",
        "Fokus hanya pada aspek teori tanpa aktivitas praktis.",
        "Tidak melakukan evaluasi terhadap pencapaian nilai-nilai P5."
      ],
      "a": 1
    },
    {
      "q": "Disajikan pernyataan praktik pedagogi tentang pelaksanaan program Penguatan Profil Pelajar Rahmatan lil 'Alamin (PPRA) secara logis.\n\nGuru fiqih mengimplementasikan program PPRA dengan mengembangkan materi ajar yang menekankan nilai-nilai rahmatan lil 'alamin. Struktur keilmuan materi meliputi: konsep rahmat dalam Islam, implementasi dalam muamalat, dan kontribusi sosial. Karakteristik peserta didik perlu memahami Islam sebagai agama yang membawa rahmat bagi semesta.\n\nBerdasarkan pernyataan praktik pedagogi tersebut, pengembangan materi ajar nilai-nilai PPRA dalam melaksanakan tujuan pembelajaran yang paling tepat sesuai dengan karakteristik peserta didik adalah …",
      "o": [
        "Mengajarkan fiqih tanpa menekankan nilai-nilai kemaslahatan.",
        "Mengembangkan materi yang mengintegrasikan konsep rahmatan lil 'alamin dalam setiap pembahasan fiqih, menganalisis dampak positif hukum Islam bagi masyarakat luas, dan merancang aktivitas sosial yang mengimplementasikan nilai-nilai tersebut.",
        "Fokus pada aspek ritual tanpa dimensi sosial.",
        "Mengabaikan konteks kemaslahatan dalam pembahasan hukum.",
        "Tidak menghubungkan materi dengan nilai-nilai keislaman yang universal."
      ],
      "a": 1
    },
    {
      "q": "Disajikan pernyataan praktik pedagog atau praktek di masyarakat tentang implementasi nilai-nilai moderasi beragama secara logis.\n\nDalam konteks pluralisme masyarakat Indonesia, implementasi nilai-nilai moderasi beragama menjadi sangat relevan. Materi ajar dikembangkan berdasarkan struktur keilmuan yang mencakup: konsep wasathiyyah dalam al-Qur'an, sejarah praktik moderasi di Indonesia, dan strategi menghadapi ekstremisme. Karakteristik peserta didik memerlukan pemahaman Islam yang moderat dan inklusif.\n\nBerdasarkan pernyataan tersebut, pengembangan materi ajar nilai-nilai Islam sebagai agama moderat atau wasathiyah yang tepat sesuai dengan implementasi moderasi beragama dalam mengevaluasi tujuan pembelajaran sesuai dengan karakteristik peserta didik adalah …",
      "o": [
        "Mengajarkan fiqih dengan pendekatan literal tanpa konteks.",
        "Mengembangkan materi yang mengintegrasikan konsep wasathiyyah, menganalisis praktik moderasi beragama dalam sejarah dan konteks kontemporer, serta mengevaluasi strategi penanggulangan ekstremisme melalui pendekatan fiqih yang moderat.",
        "Mengabaikan realitas pluralisme dalam penyajian materi.",
        "Fokus pada aspek hukum tanpa nuansa moderasi.",
        "Tidak menghubungkan teori dengan praktik di masyarakat."
      ],
      "a": 1
    },
    {
      "q": "Disajikan pernyataan praktik pedagogi atau praktek di masyarakat tentang alasan implementasi nilai-nilai moderasi beragama.\n\nBerbagai konflik keagamaan yang terjadi di beberapa daerah menunjukkan urgensi implementasi nilai-nilai moderasi beragama. Materi ajar Islam sebagai agama moderat perlu dikembangkan dengan alasan yang kuat baik dari sisi teologis, historis, maupun sosiologis. Karakteristik peserta didik perlu memahami urgensi moderasi dalam konteks kehidupan bermasyarakat.\n\nBerdasarkan pernyataan tersebut, penilaian pengembangan materi ajar Islam sebagai agama moderat atau wasathiyah dengan alasan yang tepat sesuai dengan implementasi moderasi beragama adalah …",
      "o": [
        "Menganggap moderasi beragama tidak relevan dengan fiqih.",
        "Menilai bahwa materi moderasi beragama dikembangkan berdasarkan: dalil al-Qur'an dan Sunnah tentang wasathiyyah, sejarah praktik toleransi dalam tradisi Islam, urgensi penanggulangan konflik keagamaan, dan kontribusi Islam bagi peradaban global.",
        "Mengabaikan dasar keagamaan dalam pengembangan materi.",
        "Fokus hanya pada aspek sosial tanpa dasar teologis.",
        "Tidak menghubungkan materi dengan realitas konflik kontemporer."
      ],
      "a": 1
    },
    {
      "q": "Disajikan deskripsi penerapan pembelajaran dengan materi zakat hasil tanah yang disewakan sesuai dengan struktur keilmuan.\n\nSeorang guru fiqih merancang pembelajaran tentang zakat hasil tanah yang disewakan menggunakan pendekatan pembelajaran berbasis masalah (PBL). Materi disusun berdasarkan struktur keilmuan yang mencakup: konsep dasar, dalil hukum, ketentuan fikih, dan aplikasi kontekstual. Pengalaman pembelajaran dirancang agar peserta didik aktif menganalisis kasus nyata penyewaan tanah dan kewajiban zakatnya.\n\nBerdasarkan deskripsi tersebut, rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan materi pembelajaran yang paling tepat adalah …",
      "o": [
        "Guru menyajikan materi secara ceramah tanpa melibatkan peserta didik dalam analisis masalah.",
        "Guru merancang pembelajaran dimulai dari presentasi kasus penyewaan tanah, identifikasi problem zakat, eksplorasi dalil dan ketentuan fikih, diskusi kelompok untuk merumuskan solusi, dan presentasi hasil analisis.",
        "Guru memberikan tugas menghafal ketentuan zakat tanpa konteks kasus.",
        "Guru mengabaikan struktur keilmuan dalam penyajian materi.",
        "Guru fokus pada teori tanpa aplikasi pada kasus nyata."
      ],
      "a": 1
    },
    {
      "q": "Disajikan pernyataan penerapan pembelajaran dengan materi zakat hasil tanah yang disewakan sesuai dengan struktur keilmuan.\n\nDalam merancang pembelajaran zakat hasil tanah yang disewakan dengan pendekatan PBL, guru mempertimbangkan pengetahuan pedagogik yang meliputi: karakteristik peserta didik, strategi pembelajaran aktif, dan teknik facilitasi. Pengalaman pembelajaran dirancang untuk mengembangkan kemampuan analisis dan pemecahan masalah peserta didik.\n\nBerdasarkan pernyataan tersebut, rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan pengetahuan pedagogik yang paling tepat adalah …",
      "o": [
        "Guru menggunakan metode ceramah tanpa mempertimbangkan karakteristik peserta didik.",
        "Guru merancang pembelajaran PBL dengan mempertimbangkan: gaya belajar peserta didik, teknik scaffolding dalam facilitasi, strategi questioning untuk stimulasi berpikir kritis, dan assessment proses selama pemecahan masalah.",
        "Guru memberikan tugas individu tanpa kolaborasi.",
        "Guru mengabaikan teknik facilitasi dalam pembelajaran.",
        "Guru tidak melakukan assessment selama proses pembelajaran."
      ],
      "a": 1
    },
    {
      "q": "Disajikan deskripsi kasus penerapan pembelajaran dengan materi zakat profesi atau zakat produktif.\n\nGuru fiqih merancang pembelajaran tentang zakat profesi dengan pendekatan PBL yang mengintegrasikan pengetahuan teknologi. Tersedia aplikasi kalkulator zakat, platform diskusi online, dan media presentasi digital. Materi mencakup konsep zakat profesi, perhitungan nisab, dan penyaluran. Pengalaman pembelajaran dirancang untuk memanfaatkan teknologi dalam setiap tahapan.\n\nBerdasarkan deskripsi kasus tersebut, rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan pengetahuan teknologi yang paling tepat adalah …",
      "o": [
        "Guru mengabaikan teknologi dan menggunakan metode konvensional saja.",
        "Guru merancang pembelajaran yang memanfaatkan: aplikasi kalkulator untuk simulasi perhitungan zakat, platform online untuk diskusi dan kolaborasi, tools presentasi untuk hasil proyek, dan digital portfolio untuk dokumentasi pembelajaran.",
        "Guru menggunakan teknologi tanpa kaitan dengan tujuan pembelajaran.",
        "Guru hanya menggunakan teknologi untuk presentasi guru saja.",
        "Guru tidak mempertimbangkan akses peserta didik terhadap teknologi."
      ],
      "a": 1
    },
    {
      "q": "Disajikan deskripsi kasus penerapan pembelajaran dengan materi zakat profesi atau zakat produktif sesuai dengan struktur keilmuan.\n\nGuru fiqih merancang pembelajaran tentang zakat profesi atau zakat produktif dengan pendekatan pembelajaran berbasis perbedaan individu (Differentiated Instruction). Materi disusun berdasarkan struktur keilmuan yang mencakup konsep, dalil, ketentuan, dan aplikasi. Pengalaman pembelajaran dirancang untuk mengakomodasi perbedaan kesiapan, minat, dan profil belajar peserta didik.\n\nBerdasarkan deskripsi kasus tersebut, rancangan pembelajaran berpendekatan pembelajaran berbasis perbedaan individu sesuai dengan materi pembelajaran yang paling tepat adalah …",
      "o": [
        "Guru menyajikan materi yang sama untuk semua peserta didik tanpa diferensiasi.",
        "Guru merancang pembelajaran dengan: konten yang di diferensiasi (level kompleksitas materi), proses yang di diferensiasi (strategi sesuai gaya belajar), dan produk yang di diferensiasi (pilihan output sesuai minat) dalam pemahaman zakat profesi.",
        "Guru mengelompokkan peserta didik berdasarkan kemampuan secara permanen.",
        "Guru memberikan tugas yang sama tanpa pilihan.",
        "Guru mengabaikan perbedaan minat dan gaya belajar."
      ],
      "a": 1
    },
    {
      "q": "Disajikan pernyataan kasus penerapan pembelajaran dengan materi ajar penyaluran zakat untuk pembangunan masjid sesuai dengan struktur keilmuan.\n\nGuru fiqih merancang pembelajaran tentang penyaluran zakat untuk pembangunan masjid dengan pendekatan pembelajaran berbasis perbedaan individu yang mempertimbangkan pengetahuan pedagogik. Karakteristik peserta didik menunjukkan variasi dalam kemampuan analisis fiqih dan keterampilan sosial. Materi mencakup ketentuan asnaf zakat dan kelayanan penyaluran untuk pembangunan masjid.\n\nBerdasarkan pernyataan kasus tersebut, rancangan pembelajaran berpendekatan pembelajaran berbasis perbedaan individu sesuai dengan pengetahuan pedagogi yang paling tepat adalah …",
      "o": [
        "Guru menggunakan metode yang sama untuk semua peserta didik.",
        "Guru menerapkan diferensiasi berdasarkan: kesiapan peserta didik (tiered assignment analisis kasus), minat (pilihan topik penyaluran zakat), dan profil belajar (visual, auditori, kinestetik) dengan mempertimbangkan prinsip readiness, interest, dan learning profile.",
        "Guru mengelompokkan peserta didik berdasarkan nilai akademik semata.",
        "Guru tidak memberikan pilihan dalam aktivitas pembelajaran.",
        "Guru mengabaikan karakteristik individual peserta didik."
      ],
      "a": 1
    },
    {
      "q": "Disajikan pernyataan penerapan pembelajaran dengan materi monogami, poligami, atau nikah mut'ah sesuai dengan struktur keilmuan.\n\nGuru fiqih merancang pembelajaran tentang monogami, poligami, atau nikah mut'ah dengan pendekatan pembelajaran berbasis perbedaan individu yang mengintegrasikan pengetahuan teknologi. Tersedia berbagai tools digital seperti video interaktif, platform diskusi, dan aplikasi simulasi. Karakteristik peserta didik adalah generasi digital dengan preferensi teknologi yang beragam.\n\nBerdasarkan pernyataan tersebut, rancangan pembelajaran berpendekatan pembelajaran berbasis perbedaan individu sesuai dengan pengetahuan teknologi yang paling tepat adalah …",
      "o": [
        "Guru melarang penggunaan teknologi dalam pembelajaran.",
        "Guru merancang pembelajaran dengan: video interaktif untuk eksplorasi konsep, platform kolaboratif untuk diskusi beragam sudut pandang, aplikasi simulasi untuk memahami implikasi hukum, dan digital assessment untuk mengevaluasi pemahaman diferensiasi.",
        "Guru menggunakan teknologi tanpa mempertimbangkan kebutuhan individual.",
        "Guru hanya menggunakan satu jenis teknologi untuk semua peserta didik.",
        "Guru mengabaikan preferensi teknologi peserta didik."
      ],
      "a": 1
    },
    {
      "q": "Disajikan narasi kasus penerapan pembelajaran dengan materi bank, rente, atau fee sesuai dengan struktur keilmuan.\n\nGuru fiqih merancang pembelajaran tentang bank, rente, atau fee dengan pendekatan pembelajaran berbasis pembelajaran mendalam (Deep Learning) untuk mengembangkan kemampuan critical thinking. Materi mencakup analisis konsep riba, evaluasi produk perbankan, dan sintesis solusi syariah. Pengalaman pembelajaran dirancang untuk mendorong eksplorasi mendalam dan koneksi antar konsep.\n\nBerdasarkan narasi kasus tersebut, rancangan pembelajaran berpendekatan pembelajaran berbasis pembelajaran mendalam sesuai dengan materi pembelajaran yang paling tepat adalah …",
      "o": [
        "Guru menyajikan materi secara superficial tanpa kedalaman analisis.",
        "Guru merancang pembelajaran dengan: eksplorasi konsep riba secara mendalam, analisis kritis produk bank konvensional, evaluasi komparatif sistem syariah, dan sintesis solusi inovatif melalui proses inquiry yang berkelanjutan dan terintegrasi.",
        "Guru fokus pada hafalan definisi tanpa analisis aplikatif.",
        "Guru mengabaikan aspek critical thinking dalam rancangan.",
        "Guru tidak menghubungkan antar konsep dalam pembelajaran."
      ],
      "a": 1
    },
    {
      "q": "Disajikan narasi kasus penerapan pembelajaran dengan materi pemerintahan dalam islam sesuai dengan struktur keilmuan.\n\nGuru fiqih merancang pembelajaran tentang pemerintahan dalam Islam dengan pendekatan Deep Learning berdasarkan pengetahuan pedagogik untuk mengembangkan kemampuan creativity. Materi mencakup konsep khilafah, sistem pemerintahan modern, dan implementasi nilai-nilai Islam. Karakteristik peserta didik memerlukan stimulasi kreativitas dalam memahami isu kompleks.\n\nBerdasarkan narasi kasus tersebut, rancangan pembelajaran berpendekatan pembelajaran berbasis pembelajaran mendalam sesuai dengan pengetahuan pedagogi yang paling tepat adalah …",
      "o": [
        "Guru menggunakan metode ceramah tanpa stimulasi kreativitas.",
        "Guru merancang pembelajaran dengan: open-ended inquiry tentang konsep pemerintahan Islam, proyek desain sistem pemerintahan ideal, role-play kreatif sebagai pemimpin, dan kreasi media pembelajaran inovatif untuk mengekspresikan pemahaman.",
        "Guru memberikan tugas yang bersifat rutin tanpa tantangan kreatif.",
        "Guru mengabaikan aspek creativity dalam pembelajaran.",
        "Guru tidak memfasilitasi eksplorasi ide-ide baru peserta didik."
      ],
      "a": 1
    },
    {
      "q": "Disajikan kasus penerapan pembelajaran dengan materi implementasi pendidikan karakter atau pendidikan nilai sesuai dengan struktur keilmuan.\n\nGuru fiqih merancang pembelajaran tentang pendidikan karakter atau pendidikan nilai dengan pendekatan Deep Learning berdasarkan pengetahuan teknologi untuk mengembangkan kemampuan collaboration atau communication. Tersedia platform kolaboratif, tools komunikasi digital, dan media presentasi interaktif. Materi mencakup nilai-nilai akhlak dalam fiqih muamalat dan implementasinya.\n\nBerdasarkan kasus tersebut, rancangan pembelajaran berpendekatan pembelajaran berbasis pembelajaran mendalam sesuai dengan pengetahuan teknologi yang paling tepat adalah …",
      "o": [
        "Guru melarang penggunaan teknologi dalam aktivitas kolaboratif.",
        "Guru merancang pembelajaran dengan: platform kolaboratif untuk proyek tim, tools komunikasi untuk diskusi nilai-nilai, video conference dengan praktisi, dan media interaktif untuk presentasi hasil kolaborasi tentang implementasi nilai fiqih dalam kehidupan.",
        "Guru menggunakan teknologi hanya untuk presentasi individu.",
        "Guru tidak mengintegrasikan teknologi dalam aktivitas kolaboratif.",
        "Guru mengabaikan aspek communication dalam penggunaan teknologi."
      ],
      "a": 1
    },
    {
      "q": "Disajikan kasus penerapan pembelajaran dengan materi implementasi moderasi beragama di Indonesia sesuai dengan struktur keilmuan.\n\nGuru fiqih merancang pembelajaran tentang implementasi moderasi beragama dengan pendekatan TPACK (Technology, Pedagogy, And Content Knowledge) untuk mengembangkan kemampuan adaptif peserta didik. Materi mencakup konsep wasathiyyah, praktik moderasi, dan strategi penanggulangan ekstremisme. Integrasi teknologi, pedagogi, dan konten dirancang untuk menghadapi perubahan kontekstual.\n\nBerdasarkan kasus tersebut, rancangan pembelajaran berpendekatan pembelajaran berbasis TPACK sesuai dengan materi pembelajaran yang paling tepat adalah …",
      "o": [
        "Guru menyajikan materi tanpa integrasi teknologi dan pedagogi yang tepat.",
        "Guru merancang pembelajaran dengan: konten wasathiyyah yang terintegrasi, pedagogi inquiry-based learning, teknologi virtual reality untuk eksplorasi konteks, dan desain adaptif yang responsif terhadap dinamika sosial keagamaan.",
        "Guru menggunakan teknologi tanpa kaitan dengan materi moderasi.",
        "Guru mengabaikan aspek adaptabilitas dalam rancangan.",
        "Guru tidak mengintegrasikan ketiga elemen TPACK secara sinergis."
      ],
      "a": 1
    },
    {
      "q": "Diberikan kasus penyajian materi zakat hasil tanah yang disewakan yang materinya kurang sesuai dengan perkembangan zaman.\n\nSeorang guru menyajikan materi zakat hasil tanah yang disewakan dengan pendekatan tradisional yang tidak mengakomodasi sistem pertanian modern seperti vertical farming atau pertanian hidroponik. Peserta didik kesulitan memahami relevansi zakat dalam konteks ekonomi kontemporer. Guru perlu menerapkan strategi pembelajaran yang relevan untuk menciptakan suasana belajar yang aman.\n\nBerdasarkan kasus tersebut, penggunaan strategi pembelajaran berpendekatan PBL guna menciptakan suasana belajar yang aman untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing yang paling tepat adalah …",
      "o": [
        "Guru tetap menggunakan pendekatan tradisional tanpa modifikasi.",
        "Guru menerapkan PBL dengan: presentasi kasus pertanian modern, identifikasi problem relevansi zakat, eksplorasi solusi kreatif, dan diskusi terbuka yang menghargai setiap kontribusi untuk menciptakan suasana psikologis aman.",
        "Guru mengabaikan perkembangan zaman dalam penyajian materi.",
        "Guru menggunakan strategi drill tanpa kontekstualisasi.",
        "Guru tidak menciptakan suasana yang mendukung eksplorasi ide."
      ],
      "a": 1
    },
    {
      "q": "Diberikan kasus penyajian materi zakat hasil tanah yang disewakan yang materinya kurang sesuai dengan perkembangan zaman.\n\nDalam pembelajaran zakat hasil tanah yang disewakan, guru menyajikan contoh kasus yang sangat tradisional dan jauh dari realitas ekonomi digital saat ini. Peserta didik menunjukkan ketidakminatan dan kesulitan dalam menghubungkan materi dengan kehidupan modern. Guru perlu menciptakan suasana belajar yang nyaman melalui strategi yang sesuai.\n\nBerdasarkan kasus tersebut, penggunaan strategi pembelajaran berpendekatan PjBL guna menciptakan suasana belajar yang nyaman untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing yang paling tepat adalah …",
      "o": [
        "Guru memaksa peserta didik menerima materi tradisional apa adanya.",
        "Guru menerapkan PjBL dengan: proyek analisis platform digital pertanian, kolaborasi tim untuk merancang sistem zakat modern, presentasi solusi, dan feedback konstruktif untuk menciptakan kenyamanan belajar dan rasa diterima.",
        "Guru mengabaikan ketidakminatan peserta didik.",
        "Guru menggunakan metode ceramah tanpa adaptasi.",
        "Guru tidak memberikan ruang bagi peserta didik untuk eksplorasi."
      ],
      "a": 1
    },
    {
      "q": "Diberikan kasus penyajian materi zakat profesi atau zakat produktif yang materinya kurang sesuai dengan perkembangan zaman.\n\nGuru fiqih menyajikan materi zakat profesi dengan contoh profesi konvensional seperti petani dan pedagang, tanpa menyentuh profesi digital seperti content creator, freelancer online, atau remote worker. Peserta didik yang berasal dari generasi digital native merasa materi tidak relevan. Guru perlu menciptakan suasana belajar yang membahagiakan.\n\nBerdasarkan kasus tersebut, penggunaan strategi pembelajaran berpendekatan DBL guna menciptakan suasana belajar yang membahagiakan untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing yang paling tepat adalah …",
      "o": [
        "Guru tetap pada contoh profesi tradisional tanpa inovasi.",
        "Guru menerapkan DBL dengan: desain challenge zakat profesi digital, proses iteratif perancangan solusi, testing konsep dengan praktisi, dan showcase hasil desain untuk menciptakan kebahagiaan belajar melalui karya yang relevan.",
        "Guru mengabaikan profesi digital dalam pembahasan.",
        "Guru menggunakan metode yang monoton tanpa kreativitas.",
        "Guru tidak melibatkan peserta didik dalam proses desain."
      ],
      "a": 1
    },
    {
      "q": "Diberikan kasus penyajian materi zakat profesi atau zakat produktif yang materinya kurang sesuai dengan perkembangan zaman.\n\nMateri zakat profesi yang disajikan guru hanya fokus pada aspek perhitungan tanpa membahas etika profesi dan tanggung jawab sosial di era gig economy. Peserta didik memerlukan pemahaman holistik yang mengintegrasikan aspek spiritual, intelektual, dan sosial. Guru perlu menciptakan suasana belajar yang akomodatif.\n\nBerdasarkan kasus tersebut, penggunaan model pembelajaran berpendekatan DL guna menciptakan suasana belajar yang akomodatif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing yang paling tepat adalah …",
      "o": [
        "Guru fokus hanya pada aspek teknis perhitungan zakat.",
        "Guru menerapkan DL dengan: eksplorasi mendalam konsep zakat profesi, koneksi dengan etika kerja Islam, aplikasi pada gig economy, dan refleksi personal untuk mengakomodasi kebutuhan holistik peserta didik.",
        "Guru mengabaikan dimensi etika dan sosial dalam pembelajaran.",
        "Guru menggunakan pendekatan surface learning tanpa kedalaman.",
        "Guru tidak memberikan ruang refleksi bagi peserta didik."
      ],
      "a": 1
    },
    {
      "q": "Diberikan kasus penyajian materi penyaluran zakat untuk pembangunan masjid yang materinya kurang sesuai dengan perkembangan zaman.\n\nGuru menyajikan materi penyaluran zakat untuk pembangunan masjid dengan contoh kasus yang statis dan tidak mengakomodasi inovasi sosial seperti masjid sebagai pusat ekonomi umat atau community center. Peserta didik memerlukan pemahaman yang adaptif terhadap perubahan kebutuhan sosial. Guru perlu menciptakan suasana belajar yang adaptif.\n\nBerdasarkan kasus tersebut, penggunaan model pembelajaran berpendekatan TPACK guna menciptakan suasana belajar yang adaptif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing yang paling tepat adalah …",
      "o": [
        "Guru menggunakan contoh kasus yang kaku tanpa inovasi.",
        "Guru menerapkan TPACK dengan: konten adaptif tentang fungsi masjid modern, pedagogi project-based, teknologi simulasi community development, dan fleksibilitas respons terhadap dinamika sosial untuk menciptakan adaptabilitas.",
        "Guru mengabaikan perubahan fungsi masjid dalam kontemporer.",
        "Guru menggunakan metode yang rigid tanpa fleksibilitas.",
        "Guru tidak mengintegrasikan teknologi dalam pembelajaran."
      ],
      "a": 1
    },
    {
      "q": "Diberikan kasus penyajian materi monogami, poligami, atau nikah mut'ah yang materinya kurang sesuai dengan perkembangan zaman.\n\nGuru menyajikan materi monogami, poligami, dan nikah mut'ah dengan pendekatan yang judgmental dan tidak sensitif terhadap konteks sosial kontemporer. Peserta didik merasa tidak nyaman dan mengalami kognitif disonance. Beberapa peserta didik berasal dari keluarga yang kompleks. Guru perlu menciptakan suasana belajar yang progresif.\n\nBerdasarkan kasus tersebut, penggunaan model pembelajaran berbasis pelayanan bimbingan konseling guna menciptakan suasana belajar yang progresif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing yang paling tepat adalah …",
      "o": [
        "Guru menyajikan materi dengan pendekatan yang menghakimi.",
        "Guru menerapkan layanan bimbingan konseling dengan: pendekatan non-judgmental, individual counseling untuk yang memerlukan, group guidance untuk diskusi sensitif, dan supportive learning environment untuk pertumbuhan progresif.",
        "Guru mengabaikan kenyamanan psikologis peserta didik.",
        "Guru menggunakan pendekatan yang dogmatis tanpa empati.",
        "Guru tidak menyediakan layanan konseling bagi peserta didik."
      ],
      "a": 1
    },
    {
      "q": "Diberikan kasus penyajian materi bank, rente, atau fee yang materinya kurang sesuai dengan perkembangan zaman.\n\nMateri bank, rente, dan fee yang disajikan guru hanya membahas sistem perbankan konvensional tanpa mengakomodasi perkembangan fintech, cryptocurrency, dan decentralized finance. Peserta didik dengan berbagai latar belakang ekonomi memerlukan pemahaman yang inklusif. Guru perlu menciptakan lingkungan belajar yang akomodatif.\n\nBerdasarkan kasus tersebut, penggunaan pendekatan pembelajaran berbasis pelayanan ABK guna menciptakan lingkungan belajar yang akomodatif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing yang paling tepat adalah …",
      "o": [
        "Guru mengabaikan perkembangan fintech dalam pembahasan.",
        "Guru menerapkan layanan ABK dengan: identifikasi kebutuhan individual, modifikasi materi sesuai kemampuan, alternatif assessment, dan dukungan diferensial untuk menciptakan inklusi dan akomodasi beragam kebutuhan.",
        "Guru menggunakan materi yang sama untuk semua tanpa modifikasi.",
        "Guru tidak mempertimbangkan latar belakang ekonomi peserta didik.",
        "Guru mengabaikan prinsip individualisasi dalam pembelajaran."
      ],
      "a": 1
    },
    {
      "q": "Diberikan kasus penyajian materi pemerintahan dalam Islam yang materinya kurang sesuai dengan perkembangan zaman.\n\nGuru menyajikan materi pemerintahan dalam Islam dengan konteks kekhalifahan klasik tanpa mengaitkan dengan sistem demokrasi modern, good governance, dan civic engagement. Peserta didik memerlukan pemahaman yang relevan dengan konteks kenegaraan kontemporer. Guru perlu menciptakan lingkungan belajar yang adaptif.\n\nBerdasarkan kasus tersebut, penggunaan pendekatan pembelajaran yang relevan guna menciptakan lingkungan belajar yang adaptif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing yang paling tepat adalah …",
      "o": [
        "Guru fokus hanya pada sejarah kekhalifahan tanpa kontekstualisasi.",
        "Guru menerapkan pendekatan kontekstual dengan: analisis komparatif sistem pemerintahan, diskusi good governance dalam Islam, proyek civic engagement, dan koneksi dengan isu kenegaraan modern untuk menciptakan adaptabilitas.",
        "Guru mengabaikan konteks demokrasi dan governance modern.",
        "Guru menggunakan pendekatan yang anakronistik.",
        "Guru tidak menghubungkan materi dengan realitas kenegaraan."
      ],
      "a": 1
    },
    {
      "q": "Diberikan kasus penyajian materi pendidikan nilai dan pendidikan karakter yang materinya kurang sesuai dengan perkembangan zaman.\n\nMateri pendidikan karakter yang disajikan guru bersifat normatif dan tidak mengakomodasi perkembangan character education di era digital, cyber ethics, dan digital citizenship. Peserta didik memerlukan pembentukan karakter yang relevan dengan tantangan digital. Guru perlu menciptakan lingkungan belajar yang progresif.\n\nBerdasarkan kasus tersebut, penggunaan pendekatan pembelajaran yang relevan guna menciptakan lingkungan belajar yang progresif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing yang paling tepat adalah …",
      "o": [
        "Guru menggunakan materi karakter yang statis dan normatif saja.",
        "Guru menerapkan pendekatan inovatif dengan: integrasi cyber ethics, pembentukan digital citizenship, proyek character in action di ruang digital, dan refleksi nilai-nilai Islam dalam berinteraksi digital untuk pertumbuhan progresif.",
        "Guru mengabaikan dimensi digital dalam pendidikan karakter.",
        "Guru menggunakan pendekatan yang tidak mengikuti perkembangan zaman.",
        "Guru tidak mempersiapkan peserta didik untuk tantangan digital."
      ],
      "a": 1
    },
    {
      "q": "Diberikan kasus penyajian materi implementasi moderasi beragama di Indonesia yang materinya kurang sesuai dengan perkembangan zaman.\n\nGuru menyajikan materi moderasi beragama dengan pendekatan yang teoritis dan tidak mengakomodasi fenomena radikalisme online, hoaks keagamaan, dan polarisasi di media sosial. Peserta didik memerlukan keterampilan moderasi yang aplikatif dalam ruang digital. Guru perlu menciptakan lingkungan belajar yang membahagiakan.\n\nBerdasarkan kasus tersebut, penggunaan pendekatan pembelajaran yang relevan guna menciptakan lingkungan belajar yang membahagiakan untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing yang paling tepat adalah …",
      "o": [
        "Guru menyajikan materi secara teoritis tanpa aplikasi praktis.",
        "Guru menerapkan pendekatan yang joyful dengan: simulasi penanganan hoaks, game-based learning moderasi, proyek kampanye damai digital, dan celebrasi keberagaman untuk menciptakan kebahagiaan belajar yang bermakna.",
        "Guru mengabaikan fenomena radikalisme digital.",
        "Guru menggunakan metode yang membosankan dan tidak relevan.",
        "Guru tidak mempersiapkan peserta didik untuk medan sosial digital."
      ],
      "a": 1
    },
    {
      "q": "Disajikan deskripsi pembelajaran materi zakat hasil tanah yang disewakan dengan pendekatan PBL.\n\nGuru fiqih melaksanakan pembelajaran zakat hasil tanah yang disewakan dengan pendekatan PBL. Proses pembelajaran meliputi presentasi kasus, identifikasi masalah, eksplorasi data, dan presentasi solusi. Karakteristik peserta didik menunjukkan variasi dalam aspek sikap, pengetahuan, dan keterampilan yang perlu dinilai secara komprehensif.\n\nBerdasarkan deskripsi tersebut, teknik asesmen yang tepat sesuai karakter peserta didik pada aspek sikap, pengetahuan atau keterampilan yang paling tepat adalah …",
      "o": [
        "Menggunakan tes tulis objektif sebagai satu-satunya alat assessment.",
        "Menerapkan teknik asesmen komprehensif: observasi sikap selama diskusi, rubrik analisis kasus untuk pengetahuan, dan penilaian proyek untuk keterampilan pemecahan masalah dengan pendekatan authentic assessment.",
        "Hanya menilai hasil akhir tanpa memperhatikan proses.",
        "Menggunakan teknik asesmen yang sama untuk semua aspek.",
        "Tidak melibatkan peserta didik dalam proses assessment."
      ],
      "a": 1
    },
    {
      "q": "Disajikan deskripsi pembelajaran materi zakat hasil tanah yang disewakan dengan pendekatan PjBL.\n\nDalam pembelajaran zakat hasil tanah yang disewakan menggunakan PjBL, peserta didik mengerjakan proyek analisis kasus nyata penyewaan tanah di desa mereka. Proyek melibatkan tahapan perencanaan, pelaksanaan, dan presentasi. Karakteristik peserta didik memerlukan instrumen asesmen yang variatif dan komprehensif.\n\nBerdasarkan deskripsi tersebut, instrumen asesmen yang tepat sesuai karakter peserta didik pada aspek sikap, pengetahuan atau keterampilan yang paling tepat adalah …",
      "o": [
        "Menggunakan instrumen asesmen pilihan ganda standar.",
        "Mengembangkan instrumen: lembar observasi sikap kerja sama, rubrik penilaian proyek analisis fiqih, checklist keterampilan presentasi, dan portofolio dokumentasi proses dengan pendekatan multiple instruments.",
        "Hanya menggunakan satu instrumen untuk semua penilaian.",
        "Tidak menyusun rubrik yang jelas untuk penilaian.",
        "Mengabaikan aspek sikap dalam instrumen penilaian."
      ],
      "a": 1
    },
    {
      "q": "Disajikan deskripsi pembelajaran materi zakat profesi atau zakat produktif dengan pendekatan DL.\n\nGuru melaksanakan pembelajaran zakat profesi dengan pendekatan Deep Learning yang melibatkan eksplorasi mendalam konsep, analisis kritis, dan sintesis ide. Lingkungan belajar didesain untuk mendorong inquiry dan refleksi. Karakteristik lingkungan belajar yang kondusif memerlukan teknik asesmen yang sesuai.\n\nBerdasarkan deskripsi tersebut, teknik asesmen yang tepat sesuai lingkungan belajar pada aspek sikap, pengetahuan atau keterampilan yang paling tepat adalah …",
      "o": [
        "Menggunakan teknik drill and practice assessment.",
        "Menerapkan teknik: reflective journal untuk sikap, performance task untuk pengetahuan mendalam, dan creative project untuk keterampilan sintesis dengan pendekatan assessment for learning.",
        "Menggunakan teknik asesmen yang tidak sesuai dengan karakteristik DL.",
        "Hanya menilai surface knowledge tanpa kedalaman.",
        "Tidak mempertimbangkan karakteristik lingkungan belajar dalam pemilihan teknik."
      ],
      "a": 1
    },
    {
      "q": "Disajikan deskripsi pembelajaran materi zakat profesi atau zakat produktif.\n\nDalam pembelajaran zakat profesi, guru menggunakan berbagai aktivitas seperti diskusi, simulasi perhitungan, dan analisis kasus. Lingkungan belajar didesain interaktif dan kolaboratif. Berbagai instrumen diperlukan untuk menilai kompleksitas pembelajaran.\n\nBerdasarkan deskripsi tersebut, instrumen asesmen yang tepat sesuai lingkungan belajar pada aspek sikap, pengetahuan atau keterampilan yang paling tepat adalah …",
      "o": [
        "Menggunakan instrumen asesmen tertulis objektif semata.",
        "Mengembangkan instrumen: skala sikap partisipasi, rubrik analisis kasus kompleks, format penilaian simulasi, dan peer assessment untuk kerja sama dengan pendekatan varied instruments.",
        "Hanya menggunakan instrumen guru tanpa melibatkan asesmen alternatif.",
        "Tidak menyusun instrumen yang sesuai dengan aktivitas pembelajaran.",
        "Mengabaikan aspek kolaboratif dalam penilaian."
      ],
      "a": 1
    },
    {
      "q": "Disajikan deskripsi pembelajaran materi penyaluran zakat untuk pembangunan masjid.\n\nGuru melaksanakan pembelajaran tentang penyaluran zakat untuk pembangunan masjid dengan tujuan spesifik: peserta didik mampu menganalisis kelayakan penyaluran zakat sesuai ketentuan fiqih. Pembelajaran menggunakan pendekatan inquiry dan case study. Tujuan pembelajaran memerlukan teknik asesmen yang selaras.\n\nBerdasarkan deskripsi tersebut, teknik asesmen yang tepat sesuai tujuan pembelajaran pada aspek sikap, pengetahuan atau keterampilan yang paling tepat adalah …",
      "o": [
        "Menggunakan teknik asesmen yang tidak selaras dengan tujuan inquiry.",
        "Menerapkan teknik: self-assessment sikap inquiry, analytical rubric untuk case study, dan performance assessment untuk analisis kelayakan dengan pendekatan aligned assessment.",
        "Menggunakan teknik asesmen yang tidak mengukur pencapaian tujuan.",
        "Menilai aspek yang tidak tercantum dalam tujuan pembelajaran.",
        "Tidak mempertimbangkan keterkaitan antara teknik dan tujuan."
      ],
      "a": 1
    },
    {
      "q": "Disajikan deskripsi pembelajaran materi monogami, poligami, atau nikah mut'ah.\n\nPembelajaran tentang monogami, poligami, dan nikah mut'ah memiliki tujuan kompleks yang mencakup pemahaman konsep, analisis hukum, dan pembentukan sikap kritis. Instrumen asesmen perlu dirancang untuk mengukur pencapaian tujuan tersebut secara valid.\n\nBerdasarkan deskripsi tersebut, instrumen asesmen yang tepat sesuai tujuan pembelajaran pada aspek sikap, pengetahuan atau keterampilan yang paling tepat adalah …",
      "o": [
        "Menggunakan instrumen asesmen yang tidak valid untuk tujuan kompleks.",
        "Mengembangkan instrumen: attitude scale untuk sikap kritis, essay test kompleks untuk analisis hukum, dan socratic questioning untuk pemahaman konsep dengan pendekatan valid and reliable instruments.",
        "Menggunakan instrumen yang hanya mengukur aspek surface.",
        "Tidak mempertimbangkan kompleksitas tujuan dalam desain instrumen.",
        "Mengabaikan aspek sikap kritis dalam penilaian."
      ],
      "a": 1
    },
    {
      "q": "Disajikan deskripsi pembelajaran materi bank, rente, atau fee.\n\nGuru telah melaksanakan asesmen awal tentang pemahaman peserta didik terhadap konsep riba dan sistem perbankan. Hasil asesmen menunjukkan variasi pemahaman yang signifikan. Teknik asesmen selanjutnya perlu mempertimbangkan hasil asesmen sebelumnya untuk meningkatkan kualitas pembelajaran.\n\nBerdasarkan deskripsi tersebut, teknik asesmen yang tepat dengan mempertimbangkan hasil asesmen sebelumnya pada aspek sikap, pengetahuan atau keterampilan yang paling tepat adalah …",
      "o": [
        "Menggunakan teknik asesmen yang sama tanpa mempertimbangkan hasil sebelumnya.",
        "Menerapkan teknik: diagnostic follow-up untuk mengidentifikasi progress, adaptive testing sesuai level pemahaman, dan differentiated assessment berdasarkan hasil asesmen awal dengan pendekatan responsive assessment.",
        "Mengabaikan hasil asesmen awal dalam perencanaan asesmen lanjutan.",
        "Menggunakan teknik yang tidak responsif terhadap kebutuhan peserta didik.",
        "Tidak melakukan adjustment berdasarkan data asesmen."
      ],
      "a": 1
    },
    {
      "q": "Disajikan deskripsi pembelajaran materi pemerintahan dalam Islam.\n\nDalam pembelajaran pemerintahan dalam Islam, guru telah melaksanakan asesmen formatif yang menunjukkan kelemahan peserta didik dalam memahami konsep khilafah. Instrumen asesmen sumatif perlu dirancang dengan mempertimbangkan hasil asesmen sebelumnya untuk memberikan gambaran komprehensif.\n\nBerdasarkan deskripsi tersebut, instrumen asesmen yang tepat dengan mempertimbangkan hasil asesmen sebelumnya pada aspek sikap, pengetahuan atau keterampilan yang paling tepat adalah …",
      "o": [
        "Menggunakan instrumen asesmen sumatif standar tanpa modifikasi.",
        "Mengembangkan instrumen: comprehensive test yang mengakomodasi remidial learning, integrated assessment untuk konsep yang terkait, dan portfolio review untuk melihat progress dengan pendekatan cumulative assessment.",
        "Tidak mempertimbangkan hasil formatif dalam desain sumatif.",
        "Menggunakan instrumen yang tidak mengakomodasi learning gaps.",
        "Mengabaikan fungsi assessment for learning."
      ],
      "a": 1
    },
    {
      "q": "Disajikan deskripsi pembelajaran materi implementasi pendidikan nilai atau pendidikan karakter.\n\nGuru melaksanakan asesmen awal untuk mengidentifikasi profil karakter dan nilai-nilai yang sudah dimiliki peserta didik sebelum memulai pembelajaran. Hasil asesmen awal menunjukkan kebutuhan spesifik dalam pengembangan karakter. Teknik asesmen selanjutnya perlu mempertimbangkan data awal tersebut.\n\nBerdasarkan deskripsi tersebut, teknik asesmen yang tepat dengan mempertimbangkan hasil asesmen awal pada aspek sikap, pengetahuan atau keterampilan yang paling tepat adalah …",
      "o": [
        "Menggunakan teknik asesmen yang sama untuk semua peserta didik tanpa diferensiasi.",
        "Menerapkan teknik: baseline-based growth assessment, personalized rubric sesuai profil awal, dan developmental portfolio untuk melihat pertumbuhan karakter dengan pendekatan growth-based assessment.",
        "Mengabaikan data asesmen awal dalam pelaksanaan asesmen berikutnya.",
        "Menggunakan teknik yang tidak mengukur pertumbuhan dari baseline.",
        "Tidak mempersonalisasi asesmen berdasarkan profil individual."
      ],
      "a": 1
    },
    {
      "q": "Disajikan deskripsi pembelajaran materi implementasi moderasi beragama di Indonesia.\n\nGuru melaksanakan asesmen awal untuk mengidentifikasi pemahaman dan sikap peserta didik terhadap keberagaman sebelum pembelajaran moderasi beragama. Hasil asesmen menunjukkan variasi sikap yang perlu diakomodasi. Instrumen asesmen perlu dirancang dengan mempertimbangkan data awal.\n\nBerdasarkan deskripsi tersebut, instrumen asesmen yang tepat dengan mempertimbangkan hasil asesmen awal pada aspek sikap, pengetahuan atau keterampilan yang paling tepat adalah …",
      "o": [
        "Menggunakan instrumen asesmen yang sama tanpa mempertimbangkan diversity.",
        "Mengembangkan instrumen: culturally responsive assessment, differentiated attitude scale, dan inclusive rubric yang menghargai starting point berbeda dengan pendekatan equity-focused assessment.",
        "Mengabaikan variasi sikap awal dalam desain instrumen.",
        "Menggunakan instrumen yang tidak sensitif terhadap diversity.",
        "Tidak mempertimbangkan equity dalam assessment."
      ],
      "a": 1
    },
    {
      "q": "Disajikan narasi praktek pembelajaran seorang guru dengan materi zakat hasil tanah yang disewakan dengan menekankan pada aspek konten, pedagogi dan teknologi yang berpotensi menimbulkan masalah pembelajaran.\n\nSeorang guru menyajikan materi zakat hasil tanah yang disewakan dengan konten yang akurat namun menggunakan pedagogi ceramah monoton dan tanpa teknologi. Peserta didik menunjukkan ketidakminatan dan hasil belajar rendah. Guru tersebut kemudian merefleksi praktiknya untuk perbaikan berkelanjutan.\n\nBerdasarkan narasi tersebut, identifikasi praktik baik/best practice dalam merencanakan pembelajaran yang berkualitas secara berkelanjutan yang paling tepat adalah …",
      "o": [
        "Guru tetap menggunakan metode ceramah tanpa perubahan.",
        "Guru merefleksi: kecocokan konten dengan tujuan, efektivitas pedagogi aktif, integrasi teknologi yang sesuai, dan merencanakan perbaikan berkelanjutan melalui siklus plan-do-check-act untuk kualitas pembelajaran yang lebih baik.",
        "Guru mengabaikan masalah yang muncul dalam pembelajaran.",
        "Guru hanya memperbaiki satu aspek tanpa refleksi komprehensif.",
        "Guru tidak melakukan perencanaan ulang berdasarkan refleksi."
      ],
      "a": 1
    },
    {
      "q": "Disajikan narasi praktek pembelajaran seorang guru dengan materi monogami, poligami, atau nikah mut'ah dengan menekankan pada aspek konten, pedagogi dan teknologi yang berpotensi menimbulkan masalah pembelajaran.\n\nGuru menyajikan materi yang sensitif ini dengan konten yang tidak mempertimbangkan diversity peserta didik, pedagogi yang judgmental, dan tanpa teknologi yang mendukung privasi. Beberapa peserta didik merasa tidak nyaman dan mengalami emotional distress. Guru perlu merefleksi pelaksanaan pembelajaran.\n\nBerdasarkan narasi tersebut, identifikasi praktik baik/best practice dalam pelaksanaan pembelajaran yang berkualitas secara berkelanjutan yang paling tepat adalah …",
      "o": [
        "Guru melanjutkan praktik yang sama tanpa perubahan.",
        "Guru merefleksi: sensitivitas konten terhadap diversity, pendekatan pedagogi yang empatik dan non-judgmental, penggunaan teknologi untuk anonymous inquiry, dan komitmen untuk menciptakan safe learning environment dalam pelaksanaan berikutnya.",
        "Guru mengabaikan emotional response peserta didik.",
        "Guru tidak melakukan adjustment terhadap materi sensitif.",
        "Guru mengabaikan aspek teknologi untuk privasi."
      ],
      "a": 1
    },
    {
      "q": "Disajikan narasi contoh praktek pembelajaran seorang guru dengan materi bank, rente, atau fee dengan menekankan pada aspek konten, pedagogi dan teknologi yang berpotensi menimbulkan masalah pembelajaran.\n\nGuru melakukan evaluasi pembelajaran bank, rente, dan fee dengan konten yang outdated (hanya sistem konvensional), pedagogi yang tidak mengukur higher-order thinking, dan teknologi yang hanya untuk administrasi. Evaluasi tidak menggambarkan kompetensi sebenarnya. Guru perlu merefleksi evaluasi yang dilakukan.\n\nBerdasarkan narasi tersebut, identifikasi praktik baik/best practice dalam evaluasi pembelajaran yang berkualitas secara berkelanjutan yang paling tepat adalah …",
      "o": [
        "Guru mempertahankan sistem evaluasi yang ada.",
        "Guru merefleksi: relevansi konten evaluasi dengan perkembangan, efektivitas pedagogi dalam mengukur critical thinking, integrasi teknologi untuk authentic assessment, dan komitmen untuk continuous improvement dalam evaluasi.",
        "Guru mengabaikan kelemahan dalam sistem evaluasi.",
        "Guru tidak memperbarui konten evaluasi sesuai perkembangan.",
        "Guru mengabaikan fungsi evaluasi untuk mengukur kompetensi autentik."
      ],
      "a": 1
    },
    {
      "q": "Disajikan narasi kemampuan guru dalam penguasaan materi fiqih di era digital dan AI.\n\nSeorang guru fiqih menunjukkan penguasaan materi yang baik dalam bidang zakat dan muamalat. Guru tersebut secara aktif mengikuti perkembangan fiqih kontemporer melalui platform digital, mengikuti webinar internasional, dan menggunakan AI untuk mengakses referensi fiqih global. Praktik ini menunjukkan komitmen pengembangan diri.\n\nBerdasarkan narasi tersebut, penilaian kemampuan guru sebagai modal pengembangan diri guru secara berkelanjutan yang paling tepat adalah …",
      "o": [
        "Guru mengandalkan penguasaan materi traditional tanpa adaptasi digital.",
        "Guru menunjukkan kompetensi: mastery of content knowledge, digital literacy dalam mengakses sumber fiqih, AI literacy untuk research, dan growth mindset untuk continuous professional development di era digital.",
        "Guru mengabaikan perkembangan teknologi dalam pengembangan diri.",
        "Guru tidak memanfaatkan AI untuk pengembangan profesional.",
        "Guru mengandalkan sumber belajar yang terbatas."
      ],
      "a": 1
    },
    {
      "q": "Disajikan narasi kemampuan guru dalam penggunaan AI untuk pembelajaran fiqih yang bermakna.\n\nSeorang guru fiqih menggunakan AI untuk personalisasi pembelajaran zakat, generate kontekstual case studies, dan analisis data hasil belajar peserta didik Gen Z dan Alpha. Namun, guru menghadapi masalah ethical use AI dan digital divide di kalangan peserta didik. Guru perlu mengidentifikasi masalah dan solusinya secara ilmiah.\n\nBerdasarkan narasi tersebut, identifikasi masalah dan solusinya secara ilmiah untuk menunjukkan jati diri sebagai guru profesional sesuai dengan karakteristik dan Gaya Belajar Peserta Didik Gen Z dan Alpha yang paling tepat adalah …",
      "o": [
        "Guru mengabaikan masalah etika dan kesenjangan digital.",
        "Guru mengidentifikasi masalah: ethical AI use dan digital divide; merumuskan solusi: AI ethics guideline, blended learning approach, dan equitable access policy; serta menunjukkan teacher identity sebagai facilitator of meaningful AI-enhanced learning.",
        "Guru menggunakan AI tanpa mempertimbangkan dampaknya.",
        "Guru tidak mengidentifikasi masalah yang muncul dalam implementasi.",
        "Guru mengabaikan karakteristik generasi Z dan Alpha dalam solusi."
      ],
      "a": 1
    }
  ]
}
