[
  {
    "q": "1. Dalam RPP pembelajaran Fikih, seorang guru menyiapkan tujuan pembelajaran untuk materi \"Zakat atas hasil tanah yang disewakan.\" Guru tersebut ingin menanamkan nilai-nilai keimanan dan ketakwaan melalui pemahaman bahwa zakat bukan hanya kewajiban finansial, tetapi juga bentuk kepekaan sosial dan wujud rasa syukur kepada Allah. Rumusan tujuan pembelajaran ranah sikap yang paling sesuai adalah:",
    "o": [
      "Peserta didik mampu menghitung besaran zakat hasil tanah yang disewakan.",
      "Peserta didik mampu menjelaskan pengertian zakat hasil tanah yang disewakan.",
      "Peserta didik mampu menunjukkan sikap syukur dan peduli sosial sebagai wujud ketaatan dalam berzakat.",
      "Peserta didik mampu menyebutkan dalil zakat hasil tanah yang disewakan.",
      "Peserta didik mampu mempraktikkan tata cara perhitungan zakat."
    ],
    "a": 2
  },
  {
    "q": "2. Disajikan deskripsi materi tentang konsep jual beli dalam Islam, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan indikator supaya peserta didik mampu berpikir kritis. Dalam pembelajaran materi jual beli, guru ingin siswa tidak hanya hafal rukun jual beli, tetapi juga memahami dampak transaksi yang tidak sesuai syariah. Rumusan tujuan pembelajaran ranah pengetahuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menghafal rukun jual beli.",
      "Peserta didik mampu mendefinisikan jual beli menurut bahasa.",
      "Peserta didik mampu menganalisis implikasi jual beli yang mengandung unsur gharar dalam kehidupan sehari-hari.",
      "Peserta didik mampu menyebutkan jenis-jenis jual beli.",
      "Peserta didik mampu memperagakan akad jual beli."
    ],
    "a": 2
  },
  {
    "q": "3. Disajikan narasi kasus tentang pelaksanaan ibadah haji, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai dengan indikator supaya peserta didik memiliki semangat gotong royong. Pada materi haji, guru ingin siswa memahami makna persaudaraan (ukhuwah) saat wukuf di Arafah. Rumusan tujuan pembelajaran ranah keterampilan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menyebutkan tempat wukuf.",
      "Peserta didik mampu mempraktikkan manasik haji secara berkelompok dengan kompak dan saling membantu.",
      "Peserta didik mampu menjelaskan pengertian wukuf.",
      "Peserta didik mampu menghafal bacaan talbiyah.",
      "Peserta didik mampu menulis laporan perjalanan haji."
    ],
    "a": 1
  },
  {
    "q": "4. Disajikan deskripsi materi tentang jenis-jenis zakat, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah sikap yang paling sesuai supaya peserta didik memiliki sikap jujur. Dalam materi zakat fitrah, guru ingin menekankan pentingnya kejujuran dalam menakar jumlah makanan pokok yang dikeluarkan. Rumusan tujuan pembelajaran ranah sikap yang tepat adalah:",
    "o": [
      "Peserta didik mampu menghitung zakat fitrah.",
      "Peserta didik mampu menjelaskan waktu mengeluarkan zakat fitrah.",
      "Peserta didik mampu membiasakan diri bersikap jujur dalam menakar dan menyalurkan zakat fitrah.",
      "Peserta didik mampu menyebutkan mustahiq zakat fitrah.",
      "Peserta didik mampu mendemonstrasikan penyerahan zakat."
    ],
    "a": 2
  },
  {
    "q": "5. Disajikan kasus tentang utang piutang, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah pengetahuan yang sesuai agar siswa berpikir kritis. Guru ingin siswa memahami bahaya riba dalam utang piutang. Rumusan tujuan pembelajaran ranah pengetahuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menyebutkan pengertian utang piutang.",
      "Peserta didik mampu menghafal dalil utang piutang.",
      "Peserta didik mampu mengevaluasi bahaya praktik riba dalam transaksi utang piutang di masyarakat.",
      "Peserta didik mampu menjelaskan adab utang piutang.",
      "Peserta didik mampu menyusun surat perjanjian utang."
    ],
    "a": 2
  },
  {
    "q": "6. Disajikan materi tentang makanan halal dan haram, mahasiswa dapat menentukan tujuan keterampilan yang mendorong kepedulian lingkungan. Rumusan tujuan keterampilan yang tepat adalah:",
    "o": [
      "Peserta didik mampu membedakan makanan halal dan haram.",
      "Peserta didik mampu menyebutkan ciri-ciri makanan haram.",
      "Peserta didik mampu membuat poster kampanye konsumsi makanan sehat dan halal guna menjaga kesehatan lingkungan.",
      "Peserta didik mampu menjelaskan ayat tentang makanan.",
      "Peserta didik mampu menghafal dalil makanan halal."
    ],
    "a": 2
  },
  {
    "q": "7. Disajikan kasus tentang perkembangan bank syariah, mahasiswa dapat menentukan tujuan pengetahuan yang menuntut berpikir dinamis. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menyebutkan jenis bank syariah.",
      "Peserta didik mampu menjelaskan pengertian bank syariah.",
      "Peserta didik mampu menganalisis keunggulan produk bank syariah dibandingkan bank konvensional dalam meningkatkan ekonomi umat.",
      "Peserta didik mampu menghafal istilah ekonomi syariah.",
      "Peserta didik mampu menyebutkan tokoh ekonomi Islam."
    ],
    "a": 2
  },
  {
    "q": "8. Disajikan narasi kasus tentang pernikahan, mahasiswa dapat menentukan tujuan sikap yang meningkatkan sikap menghargai tradisi. Rumusan tujuan sikap yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan rukun nikah.",
      "Peserta didik mampu menyebutkan syarat wali nikah.",
      "Peserta didik mampu menunjukkan sikap menghormati tradisi pernikahan adat yang tidak bertentangan dengan syariat Islam.",
      "Peserta didik mampu memperagakan akad nikah.",
      "Peserta didik mampu menghafal ayat tentang pernikahan."
    ],
    "a": 2
  },
  {
    "q": "9. Disajikan kasus tentang pengelolaan zakat, mahasiswa dapat menentukan tujuan keterampilan yang membangun semangat gotong royong. Rumusan tujuan keterampilan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan fungsi amil zakat.",
      "Peserta didik mampu menghitung zakat mal.",
      "Peserta didik mampu mensimulasikan peran amil zakat dalam mendistribusikan zakat secara gotong royong.",
      "Peserta didik mampu menyebutkan golongan penerima zakat.",
      "Peserta didik mampu menulis proposal kegiatan zakat."
    ],
    "a": 2
  },
  {
    "q": "10. Disajikan materi tentang wakaf, mahasiswa dapat menentukan tujuan sikap yang mengembangkan sikap dermawan. Rumusan tujuan sikap yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan rukun wakaf.",
      "Peserta didik mampu menyebutkan jenis-jenis wakaf.",
      "Peserta didik mampu membiasakan diri untuk berbagi dan mewakafkan sebagian harta untuk kepentingan umum.",
      "Peserta didik mampu menghafal dalil wakaf.",
      "Peserta didik mampu menyusun ikrar wakaf."
    ],
    "a": 2
  },
  {
    "q": "11. Disajikan materi tentang shalat jamak dan qashar, mahasiswa dapat menentukan tujuan keterampilan yang memudahkan ibadah. Rumusan tujuan keterampilan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan pengertian shalat jamak.",
      "Peserta didik mampu menyebutkan sebab boleh qashar.",
      "Peserta didik mampu memperagakan tata cara shalat jamak dan qashar dengan benar saat bepergian.",
      "Peserta didik mampu menghafal niat shalat jamak.",
      "Peserta didik mampu menyebutkan macam-macam shalat qashar."
    ],
    "a": 2
  },
  {
    "q": "12. Disajikan materi tentang kurban, mahasiswa dapat menentukan tujuan sikap yang meningkatkan solidaritas. Rumusan tujuan sikap yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan waktu kurban.",
      "Peserta didik mampu menyebutkan syarat hewan kurban.",
      "Peserta didik mampu menunjukkan rasa kepedulian sosial dengan berbagi daging kurban kepada yang membutuhkan.",
      "Peserta didik mampu mempraktikkan penyembelihan kurban.",
      "Peserta didik mampu menghafal dalil kurban."
    ],
    "a": 2
  },
  {
    "q": "13. Disajikan materi tentang jual beli *online*, mahasiswa dapat menentukan tujuan pengetahuan yang menuntut berpikir kritis. Rumusan tujuan pengetahuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan pengertian *e-commerce*.",
      "Peserta didik mampu menyebutkan contoh jual beli *online*.",
      "Peserta didik mampu menganalisis keabsahan akad jual beli *online* ditinjau dari prinsip-prinsip syariah.",
      "Peserta didik mampu memperagakan transaksi jual beli *online*.",
      "Peserta didik mampu menghafal ayat tentang jual beli."
    ],
    "a": 2
  },
  {
    "q": "14. Disajikan materi tentang waris, mahasiswa dapat menentukan tujuan pengetahuan yang menuntut analisis. Rumusan tujuan pengetahuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan pengertian waris.",
      "Peserta didik mampu menyebutkan ahli waris.",
      "Peserta didik mampu menganalisis pembagian warisan berdasarkan ilmu faraidh untuk menghindari konflik keluarga.",
      "Peserta didik mampu menghafal dalil waris.",
      "Peserta didik mampu memperagakan pembagian waris."
    ],
    "a": 2
  },
  {
    "q": "15. Disajikan materi tentang makanan halal, mahasiswa dapat menentukan tujuan sikap yang meningkatkan disiplin. Rumusan tujuan sikap yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan jenis makanan halal.",
      "Peserta didik mampu menyebutkan manfaat makanan halal.",
      "Peserta didik mampu disiplin dalam memilih makanan yang halal dan *thayyib* untuk menjaga kesehatan.",
      "Peserta didik mampu memperagakan cara membersihkan makanan.",
      "Peserta didik mampu menghafal ayat makanan halal."
    ],
    "a": 2
  },
  {
    "q": "16. Disajikan materi tentang jual beli, mahasiswa dapat menentukan tujuan pengetahuan yang menuntut berpikir kritis. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menyebutkan syarat jual beli.",
      "Peserta didik mampu menjelaskan rukun jual beli.",
      "Peserta didik mampu menganalisis keabsahan jual beli yang mengandung unsur penipuan.",
      "Peserta didik mampu menghafal dalil jual beli.",
      "Peserta didik mampu memperagakan jual beli."
    ],
    "a": 2
  },
  {
    "q": "17. Disajikan materi tentang riba, mahasiswa dapat menentukan tujuan pengetahuan yang menuntut analisis. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menyebutkan pengertian riba.",
      "Peserta didik mampu menjelaskan jenis-jenis riba.",
      "Peserta didik mampu menganalisis dampak negatif praktik riba dalam perekonomian masyarakat.",
      "Peserta didik mampu menghafal ayat tentang riba.",
      "Peserta didik mampu menyebutkan dasar hukum riba."
    ],
    "a": 2
  },
  {
    "q": "18. Disajikan materi tentang shalat jamak dan qashar, mahasiswa dapat menentukan tujuan keterampilan yang memudahkan ibadah. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan pengertian shalat jamak.",
      "Peserta didik mampu menyebutkan sebab boleh qashar.",
      "Peserta didik mampu memperagakan tata cara shalat jamak dan qashar dengan benar.",
      "Peserta didik mampu menghafal niat shalat jamak.",
      "Peserta didik mampu menyebutkan macam-macam shalat qashar."
    ],
    "a": 2
  },
  {
    "q": "19. Disajikan materi tentang wakaf, mahasiswa dapat menentukan tujuan sikap yang mengembangkan sikap dermawan. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan rukun wakaf.",
      "Peserta didik mampu menyebutkan jenis-jenis wakaf.",
      "Peserta didik mampu membiasakan diri untuk berbagi dan mewakafkan sebagian harta.",
      "Peserta didik mampu menghafal dalil wakaf.",
      "Peserta didik mampu menyusun ikrar wakaf."
    ],
    "a": 2
  },
  {
    "q": "20. Disajikan materi tentang kurban, mahasiswa dapat menentukan tujuan sikap yang meningkatkan solidaritas. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan waktu kurban.",
      "Peserta didik mampu menyebutkan syarat hewan kurban.",
      "Peserta didik mampu menunjukkan rasa kepedulian sosial dengan berbagi daging kurban.",
      "Peserta didik mampu mempraktikkan penyembelihan kurban.",
      "Peserta didik mampu menghafal dalil kurban."
    ],
    "a": 2
  },
  {
    "q": "21. Disajikan materi tentang pengelolaan zakat, mahasiswa dapat menentukan tujuan keterampilan yang membangun semangat gotong royong. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan fungsi amil zakat.",
      "Peserta didik mampu menghitung zakat mal.",
      "Peserta didik mampu mensimulasikan peran amil zakat dalam mendistribusikan zakat secara gotong royong.",
      "Peserta didik mampu menyebutkan golongan penerima zakat.",
      "Peserta didik mampu menulis proposal kegiatan zakat."
    ],
    "a": 2
  },
  {
    "q": "22. Disajikan materi tentang pernikahan, mahasiswa dapat menentukan tujuan sikap yang meningkatkan sikap menghargai tradisi. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan rukun nikah.",
      "Peserta didik mampu menyebutkan syarat wali nikah.",
      "Peserta didik mampu menunjukkan sikap menghormati tradisi pernikahan adat yang tidak bertentangan dengan syariat.",
      "Peserta didik mampu memperagakan akad nikah.",
      "Peserta didik mampu menghafal ayat tentang pernikahan."
    ],
    "a": 2
  },
  {
    "q": "23. Disajikan materi tentang bank syariah, mahasiswa dapat menentukan tujuan pengetahuan yang menuntut berpikir dinamis. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menyebutkan jenis bank syariah.",
      "Peserta didik mampu menjelaskan pengertian bank syariah.",
      "Peserta didik mampu menganalisis keunggulan produk bank syariah dibandingkan bank konvensional.",
      "Peserta didik mampu menghafal istilah ekonomi syariah.",
      "Peserta didik mampu menyebutkan tokoh ekonomi Islam."
    ],
    "a": 2
  },
  {
    "q": "24. Disajikan materi tentang makanan halal dan haram, mahasiswa dapat menentukan tujuan keterampilan yang mendorong kepedulian lingkungan. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu membedakan makanan halal dan haram.",
      "Peserta didik mampu menyebutkan ciri-ciri makanan haram.",
      "Peserta didik mampu membuat poster kampanye konsumsi makanan sehat dan halal guna menjaga kesehatan.",
      "Peserta didik mampu menjelaskan ayat tentang makanan.",
      "Peserta didik mampu menghafal dalil makanan halal."
    ],
    "a": 2
  },
  {
    "q": "25. Disajikan materi tentang utang piutang, mahasiswa dapat menentukan tujuan pengetahuan yang sesuai agar siswa berpikir kritis. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menyebutkan pengertian utang piutang.",
      "Peserta didik mampu menghafal dalil utang piutang.",
      "Peserta didik mampu mengevaluasi bahaya praktik riba dalam transaksi utang piutang.",
      "Peserta didik mampu menjelaskan adab utang piutang.",
      "Peserta didik mampu menyusun surat perjanjian utang."
    ],
    "a": 2
  },
  {
    "q": "26. Disajikan materi tentang zakat fitrah, mahasiswa dapat menentukan tujuan sikap yang tepat supaya peserta didik memiliki sikap jujur. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menghitung zakat fitrah.",
      "Peserta didik mampu menjelaskan waktu mengeluarkan zakat fitrah.",
      "Peserta didik mampu membiasakan diri bersikap jujur dalam menakar zakat fitrah.",
      "Peserta didik mampu menyebutkan mustahiq zakat fitrah.",
      "Peserta didik mampu mendemonstrasikan penyerahan zakat."
    ],
    "a": 2
  },
  {
    "q": "27. Disajikan materi tentang waris, mahasiswa dapat menentukan tujuan keterampilan yang membangun kemampuan berpikir terstruktur. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan pengertian waris.",
      "Peserta didik mampu menyebutkan ahli waris.",
      "Peserta didik mampu mensimulasikan pembagian warisan berdasarkan ilmu faraidh.",
      "Peserta didik mampu menghafal dalil waris.",
      "Peserta didik mampu menulis laporan pembagian waris."
    ],
    "a": 2
  },
  {
    "q": "28. Disajikan materi tentang haji dan umrah, mahasiswa dapat menentukan tujuan sikap yang meningkatkan kekhusyukan ibadah. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan perbedaan haji dan umrah.",
      "Peserta didik mampu menyebutkan rukun haji.",
      "Peserta didik mampu menunjukkan sikap khusyuk dan sabar dalam melaksanakan ibadah haji.",
      "Peserta didik mampu menghafal bacaan haji.",
      "Peserta didik mampu memperagakan manasik haji."
    ],
    "a": 2
  },
  {
    "q": "29. Disajikan materi tentang ihdad (masa berkabung), mahasiswa dapat menentukan tujuan pengetahuan yang menuntut analisis. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan pengertian ihdad.",
      "Peserta didik mampu menyebutkan masa ihdad.",
      "Peserta didik mampu menganalisis hikmah diberlakukannya ihdad bagi wanita yang ditinggal mati suaminya.",
      "Peserta didik mampu menghafal dalil ihdad.",
      "Peserta didik mampu menyebutkan kewajiban wanita saat ihdad."
    ],
    "a": 2
  },
  {
    "q": "30. Disajikan materi tentang makanan halal, mahasiswa dapat menentukan tujuan sikap yang meningkatkan disiplin. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan jenis makanan halal.",
      "Peserta didik mampu menyebutkan manfaat makanan halal.",
      "Peserta didik mampu disiplin dalam memilih makanan yang halal dan thayyib.",
      "Peserta didik mampu memperagakan cara membersihkan makanan.",
      "Peserta didik mampu menghafal ayat makanan halal."
    ],
    "a": 2
  },
  {
    "q": "31. Disajikan materi tentang jual beli, mahasiswa dapat menentukan tujuan pengetahuan yang menuntut berpikir kritis. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menyebutkan syarat jual beli.",
      "Peserta didik mampu menjelaskan rukun jual beli.",
      "Peserta didik mampu menganalisis keabsahan jual beli yang mengandung unsur penipuan.",
      "Peserta didik mampu menghafal dalil jual beli.",
      "Peserta didik mampu memperagakan jual beli."
    ],
    "a": 2
  },
  {
    "q": "32. Disajikan materi tentang riba, mahasiswa dapat menentukan tujuan pengetahuan yang menuntut analisis. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menyebutkan pengertian riba.",
      "Peserta didik mampu menjelaskan jenis-jenis riba.",
      "Peserta didik mampu menganalisis dampak negatif praktik riba dalam perekonomian masyarakat.",
      "Peserta didik mampu menghafal ayat tentang riba.",
      "Peserta didik mampu menyebutkan dasar hukum riba."
    ],
    "a": 2
  },
  {
    "q": "33. Disajikan materi tentang shalat jamak dan qashar, mahasiswa dapat menentukan tujuan keterampilan yang memudahkan ibadah. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan pengertian shalat jamak.",
      "Peserta didik mampu menyebutkan sebab boleh qashar.",
      "Peserta didik mampu memperagakan tata cara shalat jamak dan qashar dengan benar.",
      "Peserta didik mampu menghafal niat shalat jamak.",
      "Peserta didik mampu menyebutkan macam-macam shalat qashar."
    ],
    "a": 2
  },
  {
    "q": "34. Disajikan materi tentang wakaf, mahasiswa dapat menentukan tujuan sikap yang mengembangkan sikap dermawan. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan rukun wakaf.",
      "Peserta didik mampu menyebutkan jenis-jenis wakaf.",
      "Peserta didik mampu membiasakan diri untuk berbagi dan mewakafkan sebagian harta.",
      "Peserta didik mampu menghafal dalil wakaf.",
      "Peserta didik mampu menyusun ikrar wakaf."
    ],
    "a": 2
  },
  {
    "q": "35. Disajikan materi tentang kurban, mahasiswa dapat menentukan tujuan sikap yang meningkatkan solidaritas. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan waktu kurban.",
      "Peserta didik mampu menyebutkan syarat hewan kurban.",
      "Peserta didik mampu menunjukkan rasa kepedulian sosial dengan berbagi daging kurban.",
      "Peserta didik mampu mempraktikkan penyembelihan kurban.",
      "Peserta didik mampu menghafal dalil kurban."
    ],
    "a": 2
  },
  {
    "q": "36. Disajikan materi tentang pengelolaan zakat, mahasiswa dapat menentukan tujuan keterampilan yang membangun semangat gotong royong. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan fungsi amil zakat.",
      "Peserta didik mampu menghitung zakat mal.",
      "Peserta didik mampu mensimulasikan peran amil zakat dalam mendistribusikan zakat secara gotong royong.",
      "Peserta didik mampu menyebutkan golongan penerima zakat.",
      "Peserta didik mampu menulis proposal kegiatan zakat."
    ],
    "a": 2
  },
  {
    "q": "37. Disajikan materi tentang pernikahan, mahasiswa dapat menentukan tujuan sikap yang meningkatkan sikap menghargai tradisi. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan rukun nikah.",
      "Peserta didik mampu menyebutkan syarat wali nikah.",
      "Peserta didik mampu menunjukkan sikap menghormati tradisi pernikahan adat yang tidak bertentangan dengan syariat.",
      "Peserta didik mampu memperagakan akad nikah.",
      "Peserta didik mampu menghafal ayat tentang pernikahan."
    ],
    "a": 2
  },
  {
    "q": "38. Disajikan materi tentang bank syariah, mahasiswa dapat menentukan tujuan pengetahuan yang menuntut berpikir dinamis. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menyebutkan jenis bank syariah.",
      "Peserta didik mampu menjelaskan pengertian bank syariah.",
      "Peserta didik mampu menganalisis keunggulan produk bank syariah dibandingkan bank konvensional.",
      "Peserta didik mampu menghafal istilah ekonomi syariah.",
      "Peserta didik mampu menyebutkan tokoh ekonomi Islam."
    ],
    "a": 2
  },
  {
    "q": "39. Disajikan materi tentang makanan halal dan haram, mahasiswa dapat menentukan tujuan keterampilan yang mendorong kepedulian lingkungan. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu membedakan makanan halal dan haram.",
      "Peserta didik mampu menyebutkan ciri-ciri makanan haram.",
      "Peserta didik mampu membuat poster kampanye konsumsi makanan sehat dan halal guna menjaga kesehatan.",
      "Peserta didik mampu menjelaskan ayat tentang makanan.",
      "Peserta didik mampu menghafal dalil makanan halal."
    ],
    "a": 2
  },
  {
    "q": "40. Disajikan materi tentang utang piutang, mahasiswa dapat menentukan tujuan pengetahuan yang sesuai agar siswa berpikir kritis. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menyebutkan pengertian utang piutang.",
      "Peserta didik mampu menghafal dalil utang piutang.",
      "Peserta didik mampu mengevaluasi bahaya praktik riba dalam transaksi utang piutang.",
      "Peserta didik mampu menjelaskan adab utang piutang.",
      "Peserta didik mampu menyusun surat perjanjian utang."
    ],
    "a": 2
  },
  {
    "q": "41. Disajikan materi tentang zakat fitrah, mahasiswa dapat menentukan tujuan sikap yang tepat supaya peserta didik memiliki sikap jujur. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menghitung zakat fitrah.",
      "Peserta didik mampu menjelaskan waktu mengeluarkan zakat fitrah.",
      "Peserta didik mampu membiasakan diri bersikap jujur dalam menakar zakat fitrah.",
      "Peserta didik mampu menyebutkan mustahiq zakat fitrah.",
      "Peserta didik mampu mendemonstrasikan penyerahan zakat."
    ],
    "a": 2
  },
  {
    "q": "42. Disajikan materi tentang waris, mahasiswa dapat menentukan tujuan keterampilan yang membangun kemampuan berpikir terstruktur. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan pengertian waris.",
      "Peserta didik mampu menyebutkan ahli waris.",
      "Peserta didik mampu mensimulasikan pembagian warisan berdasarkan ilmu faraidh.",
      "Peserta didik mampu menghafal dalil waris.",
      "Peserta didik mampu menulis laporan pembagian waris."
    ],
    "a": 2
  },
  {
    "q": "43. Disajikan materi tentang haji dan umrah, mahasiswa dapat menentukan tujuan sikap yang meningkatkan kekhusyukan ibadah. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan perbedaan haji dan umrah.",
      "Peserta didik mampu menyebutkan rukun haji.",
      "Peserta didik mampu menunjukkan sikap khusyuk dan sabar dalam melaksanakan ibadah haji.",
      "Peserta didik mampu menghafal bacaan haji.",
      "Peserta didik mampu memperagakan manasik haji."
    ],
    "a": 2
  },
  {
    "q": "44. Disajikan materi tentang ihdad (masa berkabung), mahasiswa dapat menentukan tujuan pengetahuan yang menuntut analisis. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan pengertian ihdad.",
      "Peserta didik mampu menyebutkan masa ihdad.",
      "Peserta didik mampu menganalisis hikmah diberlakukannya ihdad bagi wanita yang ditinggal mati suaminya.",
      "Peserta didik mampu menghafal dalil ihdad.",
      "Peserta didik mampu menyebutkan kewajiban wanita saat ihdad."
    ],
    "a": 2
  },
  {
    "q": "45. Disajikan materi tentang makanan halal, mahasiswa dapat menentukan tujuan sikap yang meningkatkan disiplin. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan jenis makanan halal.",
      "Peserta didik mampu menyebutkan manfaat makanan halal.",
      "Peserta didik mampu disiplin dalam memilih makanan yang halal dan thayyib.",
      "Peserta didik mampu memperagakan cara membersihkan makanan.",
      "Peserta didik mampu menghafal ayat makanan halal."
    ],
    "a": 2
  },
  {
    "q": "46. Disajikan materi tentang sewa menyewa (Ijarah), mahasiswa dapat menentukan tujuan pengetahuan yang menuntut analisis. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan pengertian ijarah.",
      "Peserta didik mampu menyebutkan rukun ijarah.",
      "Peserta didik mampu menganalisis keabsahan akad ijarah pada kasus sewa barang yang rusak.",
      "Peserta didik mampu menghafal dalil ijarah.",
      "Peserta didik mampu memperagakan akad ijarah."
    ],
    "a": 2
  },
  {
    "q": "47. Disajikan materi tentang wakaf tunai, mahasiswa dapat menentukan tujuan keterampilan yang mendorong inovasi ekonomi. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan konsep wakaf tunai.",
      "Peserta didik mampu menyebutkan dasar hukum wakaf tunai.",
      "Peserta didik mampu merancang proposal inovatif pengelolaan wakaf tunai untuk pemberdayaan ekonomi.",
      "Peserta didik mampu menghafal syarat wakaf tunai.",
      "Peserta didik mampu menyebutkan nazhir wakaf."
    ],
    "a": 2
  },
  {
    "q": "48. Disajikan materi tentang jinayat (tindak pidana), mahasiswa dapat menentukan tujuan pengetahuan yang menuntut berpikir kritis. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan pengertian jinayat.",
      "Peserta didik mampu menyebutkan jenis-jenis hukum jinayat.",
      "Peserta didik mampu mengevaluasi tujuan penerapan hukum jinayat dalam Islam untuk kemaslahatan manusia.",
      "Peserta didik mampu menghafal dalil jinayat.",
      "Peserta didik mampu menyebutkan syarat pelaku jinayat."
    ],
    "a": 2
  },
  {
    "q": "49. Disajikan materi tentang thaharah (bersuci), mahasiswa dapat menentukan tujuan keterampilan yang meningkatkan kebersihan. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan jenis najis.",
      "Peserta didik mampu menyebutkan rukun wudhu.",
      "Peserta didik mampu memperagakan tata cara bersuci dari najis mukhaffafah, mutawassithah, dan mughalladhah.",
      "Peserta didik mampu menghafal doa wudhu.",
      "Peserta didik mampu menyebutkan macam-macam air."
    ],
    "a": 2
  },
  {
    "q": "50. Disajikan materi tentang pernikahan dalam Islam, mahasiswa dapat menentukan tujuan sikap yang meningkatkan sikap menghargai kedudukan wanita. Rumusan tujuan yang tepat adalah:",
    "o": [
      "Peserta didik mampu menjelaskan hak dan kewajiban suami istri.",
      "Peserta didik mampu menyebutkan rukun nikah.",
      "Peserta didik mampu menunjukkan sikap menghormati kedudukan wanita dalam keluarga dan masyarakat sesuai prinsip Islam.",
      "Peserta didik mampu memperagakan akad nikah.",
      "Peserta didik mampu menghafal ayat tentang pernikahan."
    ],
    "a": 2
  }
]
