[
  {
    "q": "Disajikan deskripsi materi tentang zakat hasil tanah yang disewakan, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah sikap yang paling sesuai dengan indikator tujuan supaya peserta didik dapat meningkatkan keimanan, ketakwaan dan akhlak mulia. Dalam kegiatan refleksi pembelajaran, peserta didik diminta menuliskan sikap yang seharusnya dimiliki oleh seorang muslim yang memperoleh penghasilan dari sewa tanah. Refleksi diarahkan pada pemahaman bahwa zakat tidak hanya berkaitan dengan ketentuan hukum, tetapi juga berfungsi membentuk kepribadian yang jujur, bertanggung jawab, dan peduli terhadap sesama. Tujuan pembelajaran ranah sikap yang paling tepat berdasarkan konteks tersebut adalah",
    "o": [
      "Peserta didik menunjukkan kesungguhan dalam memahami ketentuan zakat hasil tanah yang disewakan",
      "Peserta didik menampilkan akhlak mulia berupa kejujuran, tanggung jawab, dan kepedulian sosial dalam pelaksanaan zakat",
      "Peserta didik mengembangkan kesadaran belajar untuk mengkaji dalil dan hikmah zakat secara mendalam",
      "Peserta didik membiasakan diri bersikap disiplin dalam menyelesaikan tugas pembelajaran zakat",
      "Peserta didik menunjukkan keterlibatan aktif dalam kegiatan refleksi dan diskusi tentang zakat"
    ],
    "a": 1
  },
  {
    "q": "Disajikan pernyataan materi tentang zakat profesi dan zakat produktif, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan indikator supaya peserta didik mampu berpikir kritis. Alya bekerja sebagai pegawai swasta dengan penghasilan tetap sebesar Rp8.000.000 per bulan. Selain itu, ia memiliki usaha katering kecil yang dijalankan bersama keluarganya dan memperoleh keuntungan bersih Rp36.000.000 dalam satu tahun. Alya ingin menunaikan zakat sesuai ketentuan syariat. Berdasarkan kasus tersebut, penerapan zakat yang paling tepat adalah",
    "o": [
      "Alya mengeluarkan zakat sebesar Rp2.400.000 dari penghasilan bulanan dan keuntungan usaha secara digabung",
      "Alya mengeluarkan zakat profesi Rp2.400.000 dan zakat produktif Rp900.000 sesuai ketentuan masing-masing",
      "Alya mengeluarkan zakat profesi Rp1.920.000 dan zakat produktif Rp900.000 sesuai ketentuan masing-masing",
      "Alya mengeluarkan zakat profesi Rp1.920.000 saja karena usaha katering belum wajib dizakati",
      "Alya mengeluarkan zakat secara sukarela tanpa perhitungan tertentu agar lebih ringan"
    ],
    "a": 2
  },
  {
    "q": "Disajikan pernyataan materi tentang penyaluran zakat untuk pembangunan masjid, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai dengan indikator supaya peserta didik memiliki semangat gotong royong. Dalam sebuah kegiatan pembelajaran, peserta didik diajak mengamati proses penyaluran zakat yang digunakan untuk pembangunan masjid di lingkungan sekitar. Mereka kemudian diminta merancang kegiatan sosial yang melibatkan kerja kelompok, pembagian peran, serta pelaksanaan kerja bakti secara terencana dan bertanggung jawab. Rumusan tujuan pembelajaran ranah keterampilan yang paling tepat untuk menumbuhkan semangat gotong royong adalah",
    "o": [
      "Peserta didik mampu menilai keutamaan pembangunan masjid melalui dana zakat",
      "Peserta didik mampu merancang dan melaksanakan kegiatan gotong royong berbasis pemanfaatan zakat secara kolaboratif",
      "Peserta didik mampu memahami ketentuan fiqih zakat yang boleh digunakan untuk pembangunan",
      "Peserta didik mampu membandingkan pendapat ulama tentang penyaluran zakat untuk fasilitas umum",
      "Peserta didik mampu menyusun laporan tertulis tentang manfaat zakat bagi masyarakat"
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi kasus pengembangan materi tentang monogami, poligami, atau nikah mut'ah, mahasiswa dapat menentukan rumusan indikat tujuan pembelajaran ranah sikap yang paling sesuai dengan materi supaya peserta didik memiliki sikap penerimaan terhadap tradisi. Saat pembelajaran berlangsung, peserta didik membahas berbagai bentuk perkawinan dalam Islam, seperti monogami, poligami, dan nikah mut'ah. Beberapa peserta didik menyampaikan pendapat berdasarkan pengalaman keluarga dan budaya masing-masing, sementara yang lain mengutip pandangan keagamaan yang mereka ketahui. Perbedaan pandangan tersebut menuntut sikap saling menghargai agar diskusi tetap berjalan sehat dan objektif. Rumusan indikator tujuan pembelajaran ranah sikap yang paling tepat untuk dikembangkan dari situasi tersebut adalah ...",
    "o": [
      "Peserta didik mampu menjelaskan pengertian monogami, poligami, dan nikah mut'ah secara runtut",
      "Peserta didik mampu membedakan dasar hukum berbagai bentuk perkawinan dalam Islam",
      "Peserta didik menunjukkan sikap terbuka dan menghargai perbedaan tradisi perkawinan yang berkembang di masyarakat",
      "Peserta didik mampu merangkum hasil diskusi tentang hukum perkawinan Islam",
      "Peserta didik mampu menyebutkan pendapat ulama tentang praktik perkawinan"
    ],
    "a": 2
  },
  {
    "q": "Disajikan deskripsi materi tentang bank, rente, dan fee, mahasiswa dapat menentukan rumusan indikator tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan materi supaya peserta didik memiliki kemampuan berpikir dinamis dan inovatif. Setelah merancang pembelajaran tentang bank, rente, dan fee berbasis kasus layanan keuangan modern, Pak Hadi meninjau kembali indikator tujuan pembelajaran yang akan digunakan. Pembelajaran tersebut diarahkan untuk mendorong kemampuan berpikir dinamis dan inovatif agar peserta didik tidak memahami konsep ekonomi secara kaku. Indikator berikut yang paling minimal kontribusinya dalam mendukung tujuan pembelajaran tersebut adalah …",
    "o": [
      "Menganalisis perbedaan karakter transaksi bank, rente, dan fee dalam praktik layanan keuangan kontemporer",
      "Menjelaskan hubungan perubahan sistem keuangan dengan munculnya variasi biaya dan jasa layanan",
      "Menyimpulkan implikasi konsep bank, rente, dan fee terhadap perilaku ekonomi masyarakat modern",
      "Menyebutkan definisi bank, rente, dan fee sesuai dengan terminologi yang tercantum dalam buku teks",
      "Mengaitkan konsep bank, rente, dan fee dengan contoh transaksi aktual yang berkembang di masyarakat"
    ],
    "a": 3
  },
  {
    "q": "Disajikan deskripsi aktivitas pembelajaran guru dalam perencanaan tujuan pembelajaran dengan pendekatan PBL, mahasiswa dapat menganalisis materi ajar zakat hasil tanah yang disewakan berdasarkan struktur keilmuan pada perencanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik. Saat berdiskusi dengan kelompok tani desa, Pak Arif menemukan praktik sewa lahan sawah di mana hasil panen sepenuhnya dikelola penyewa, sementara pemilik menerima uang sewa tetap. Data ini akan digunakan sebagai pemicu masalah dalam pembelajaran berbasis masalah. Analisis materi ajar yang paling tepat untuk merumuskan tujuan pembelajaran PBL sesuai struktur keilmuan adalah …",
    "o": [
      "Mengarahkan tujuan pembelajaran agar peserta didik menganalisis hubungan kepemilikan lahan, pengelolaan hasil panen, dan dasar hukum zakat dengan merujuk pada pendapat fikih yang relevan",
      "Merancang tujuan pembelajaran yang menuntun peserta didik menyelesaikan persoalan zakat melalui studi kasus sewa lahan dengan menekankan langkah-langkah pemecahan masalah",
      "Menetapkan tujuan pembelajaran yang menekankan pemahaman jenis zakat pertanian dan contoh penerapannya dalam kehidupan masyarakat desa",
      "Menyusun tujuan pembelajaran yang berorientasi pada kemampuan menghitung zakat hasil panen dari lahan yang disewakan",
      "Merumuskan tujuan pembelajaran yang menumbuhkan kepedulian sosial peserta didik terhadap kesejahteraan petani dan pemilik lahan"
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi aktivitas guru dalam pelaksanaan tujuan pembelajaran zakat profesi atau zakat produktif dengan pendekatan PjBL, mahasiswa dapat menganalisis materi ajar zakat profesi atau zakat produktif berdasarkan struktur keilmuan pada pelaksanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik. Proyek zakat profesi yang dipandu Bu Nabila meminta peserta didik menyusun simulasi kewajiban zakat berdasarkan profesi di lingkungan keluarga. Ia memberi arahan berbeda pada tiap kelompok. Analisis materi ajar yang paling tepat sesuai struktur keilmuan dan karakteristik peserta didik adalah …",
    "o": [
      "Materi ajar disusun bertahap dari konsep zakat dan tujuan sosialnya, dilanjutkan objek dan syarat wajib, serta pengenalan perbedaan pandangan ulama sesuai kesiapan belajar peserta didik",
      "Materi ajar dikembangkan melalui kebebasan eksplorasi agar peserta didik menentukan sendiri kedalaman kajian zakat profesi yang akan diproyeksikan",
      "Materi ajar difokuskan pada isu kontemporer zakat profesi untuk menumbuhkan sikap kritis terhadap perbedaan pendapat yang berkembang",
      "Materi ajar diarahkan pada penguasaan teknik perhitungan zakat profesi agar hasil proyek memiliki akurasi numerik",
      "Materi ajar disajikan seragam untuk seluruh peserta didik demi menjaga kesamaan pemahaman konsep zakat profesi"
    ],
    "a": 1
  },
  {
    "q": "Disajikan narasi kasus guru melakukan evaluasi pembelajaran materi penyaluran Zakat untuk pembangunan masjid dengan pendekatan DBL, mahasiswa dapat menguraikan materi ajar penyaluran zakat untuk pembangunan masjid dalam evaluasi tujuan pembelajaran sesuai dengan karakteristik peserta didik. Pak Arif ingin menentukan instrumen evaluasi yang paling tepat untuk menilai sikap, pengetahuan, dan keterampilan peserta didik di lapangan secara menyeluruh dalam kegiatan pantauan penyaluran zakat. Instrumen evaluasi yang paling tepat adalah …",
    "o": [
      "Tes tertulis di kelas untuk menilai pemahaman konsep penyaluran zakat",
      "Laporan tertulis peserta didik dari lapangan tanpa rubrik penilaian",
      "Observasi umum selama kegiatan lapangan tanpa panduan terstruktur",
      "Lembar penilaian kinerja berbasis DBL yang menilai pengamatan, analisis, refleksi, dan sikap sosial peserta didik",
      "Kuesioner singkat tentang pengalaman peserta didik selama kegiatan"
    ],
    "a": 4
  },
  {
    "q": "Disajikan pernyataan praktik pedagogi tentang perencanaan materi ajar monogami, poligami atau nikah mut'ah secara logis dengan pendekatan TPACK, mahasiswa dapat menentukan alur materi ajar monogami, poligami, atau nikah mut’ah dalam perencanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik. Perencanaan materi ajar monogami, poligami, atau nikah mut’ah memerlukan pertimbangan konten, pedagogi, dan teknologi (TPACK) secara terpadu. Berdasarkan prinsip TPACK, alur materi ajar yang paling tepat adalah …",
    "o": [
      "Mengutamakan penguasaan konsep hukum dan tradisi secara teoretis",
      "Menyusun materi berdasarkan urutan kronologis sejarah praktik monogami, poligami, dan nikah mut’ah",
      "Mengintegrasikan konsep, analisis, dan sikap toleransi peserta didik secara seimbang",
      "Menyajikan materi sesuai minat peserta didik tanpa mengacu pada konten inti",
      "Fokus pada penyampaian teknologi tanpa mempertimbangkan nilai sosial dan hukum"
    ],
    "a": 3
  },
  {
    "q": "Disajikan pernyataan praktik pedagogi tentang pelaksanaan materi ajar bank, rente atau fee secara logis dengan pendekatan DL, mahasiswa dapat menentukan alur materi ajar tetang bank, rente, atau fee pada pelaksanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik. Alur materi ajar yang paling tepat untuk mendukung pendekatan Discovery Learning dan karakteristik peserta didik pada materi fee (biaya layanan digital) adalah …",
    "o": [
      "Menjelaskan pengertian fee → menyebutkan jenis-jenis fee → memberikan contoh biaya layanan → mengerjakan latihan soal",
      "Menyajikan konsep fee secara utuh → mendiskusikan contoh layanan jasa → melakukan evaluasi pemahaman",
      "Memberikan rangkuman tentang fee → menugaskan pencarian contoh fee → melakukan tes akhir",
      "Menampilkan definisi fee → membandingkan fee dengan rente → meminta peserta didik mencatat kesimpulan",
      "Mengamati variasi biaya layanan jasa → mengidentifikasi karakteristik fee → mendiskusikan fungsi fee dalam transaksi → menyimpulkan hasil temuan"
    ],
    "a": 5
  },
  {
    "q": "Disajikan pernyataan praktik pedagogi tentang pelaksanaan materi ajar secara logis dengan model pelayanan konseling, mahasiswa dapat menentukan alur materi ajar pemerintahan dalam Islam dalam mengevaluasi tujuan pembelajaran sesuai dengan karakteristik peserta didik. Materi pemerintahan dalam Islam mengandung nilai kepemimpinan, keadilan, dan tanggung jawab yang dapat dipersepsi berbeda oleh setiap peserta didik. Alur materi ajar yang paling tepat diterapkan dalam kondisi tersebut adalah …",
    "o": [
      "Penyampaian konsep pemerintahan Islam secara runtut untuk memastikan ketuntasan materi",
      "Pemetaan kebutuhan dan pemahaman peserta didik, penguatan nilai melalui dialog reflektif, lalu penilaian perkembangan belajar",
      "Penjelasan materi inti disertai latihan soal untuk mengukur penguasaan konsep",
      "Diskusi kelas secara umum untuk menyamakan pandangan peserta didik",
      "Pengulangan materi pokok sebagai penguatan pemahaman"
    ],
    "a": 2
  },
  {
    "q": "Disajikan pernyataan praktik pedagogi tentang pelaksanaan program penguatan profile pelajar pancasila (P5) secara logis, mahasiswa dapat menentukan pengembangan materi ajar nilai-nilai P5 dalam merencanakan tujuan pembelajaran sesuai dengan karakteristik peserta didik. Pak Arif ingin mengembangkan materi ajar yang memfasilitasi peserta didik memahami, menerapkan, dan merefleksikan nilai-nilai Pancasila secara menyeluruh sesuai karakter mereka melalui proyek sosial. Pendekatan pengembangan materi ajar yang paling tepat adalah …",
    "o": [
      "Memberikan ceramah intensif tentang nilai Pancasila di kelas untuk memastikan teori dipahami",
      "Menyajikan contoh tokoh inspiratif melalui video tanpa aktivitas lanjutan",
      "Menugaskan peserta didik membuat rangkuman tertulis dari buku teks",
      "Mengembangkan materi ajar berbasis proyek sosial yang mengintegrasikan pengalaman lapangan, kolaborasi, refleksi, dan penerapan nilai-nilai Pancasila",
      "Memberikan tes tertulis untuk menilai penguasaan konsep nilai Pancasila"
    ],
    "a": 4
  },
  {
    "q": "Disajikan pernyataan praktik pedagogi tentang pelaksanaan program Penguatan profile pelajar rahmatan lil alami (PPRA) secara logis, mahasiswa dapat menentukan pengembangan materi ajar nilai-nilai PPRA dalam melaksanakan tujuan pembelajaran sesuai dengan karakteristik peserta didik. Seorang guru ingin mengajarkan nilai toleransi sebagai bagian dari nilai PPRA dengan latar belakang siswa yang beragam. Langkah pertama yang paling tepat bagi guru adalah:",
    "o": [
      "Menyampaikan teori toleransi tanpa mengaitkannya dengan pengalaman siswa",
      "Mengidentifikasi perbedaan latar belakang sosial dan budaya siswa untuk menciptakan materi yang lebih relevan",
      "Memberikan ujian tertulis tentang definisi toleransi",
      "Menghindari diskusi karena siswa memiliki pandangan yang berbeda",
      "Mengajarkan toleransi hanya dengan cara ceramah"
    ],
    "a": 2
  },
  {
    "q": "Disajikan pernyataan praktik pedagog atau praktek di masyarakat tentang imlementasi nilai-nilai moderasi beragama secara logis, mahasiswa dapat menentukan pengembangan materi ajar niali-nilai Islam sebagai agama moderat atau wasathiyah yang tepat sesuai dengan implementasi moderasi beragama dalam mengevaluasi tujuan pembelajaran sesuai dengan karakteristik peserta didik. Pengembangan materi ajar Islam sebagai agama wasathiyah (moderasi beragama) berdasarkan diskusi kasus nyata perbedaan mazhab sebaiknya diarahkan untuk...",
    "o": [
      "Menyuruh siswa menghafal definisi moderasi",
      "Menekankan nilai-nilai toleransi dalam menyikapi perbedaan keagamaan",
      "Menghindari pembahasan mazhab karena berpotensi konflik",
      "Menentukan mazhab yang paling benar",
      "Memberikan sanksi pada pendapat yang berbeda"
    ],
    "a": 2
  },
  {
    "q": "Disajikan pernyataan praktik pedagogi atau praktek di masyarakat tentang alasan imlementasi nilai-nilai moderasi beragama, mahasiswa dapat menilai pegembangan materi ajar Islam sebagai agama moderat atau wasathiyah dengan alasan yang tepat sesuai dengan implementasi moderasi beragama. Dalam merancang evaluasi pembelajaran tentang moderasi beragama yang inklusif dan produktif, yang paling relevan bagi guru adalah...",
    "o": [
      "Menggunakan evaluasi hanya berdasarkan hasil ujian tertulis mengenai konsep konsep moderasi beragama",
      "Menilai pemahaman siswa tentang wasathiyah dengan memanfaatkan berbagai metode asesmen yang memperhatikan sikap, pengetahuan, dan keterampilan siswa dalam kehidupan sehari-hari",
      "Hanya mengevaluasi siswa berdasarkan hasil diskusi tanpa melihat keterampilan lain yang mereka miliki",
      "Mengabaikan penggunaan teknologi dalam pembelajaran untuk memperkenalkan nilai-nilai moderasi beragama",
      "Menggunakan ujian praktikum untuk mengukur pemahaman nilai wasathiyah dalam konteks sosial budaya yang luas"
    ],
    "a": 2
  },
  {
    "q": "Disajikan deskripsi penerapan pembelajaran dengan materi zakat hasil tanah yang disewakan sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan materi pembelajaran. Rancangan pembelajaran berbasis masalah (PBL) yang paling tepat untuk memahami perbedaan pendapat kewajiban zakat antara pemilik tanah dan penyewa lahan adalah …",
    "o": [
      "Peserta didik mempelajari dalil zakat hasil tanah melalui presentasi guru",
      "Peserta didik mengerjakan kuis daring tentang jenis-jenis zakat pertanian",
      "Peserta didik mengkaji kasus nyata sewa lahan, membandingkan pendapat ulama, lalu menyimpulkan kewajiban zakat berdasarkan analisis masalah",
      "Peserta didik mencatat poin penting materi zakat hasil tanah dari modul",
      "Peserta didik menghafal ketentuan nisab dan kadar zakat hasil pertanian"
    ],
    "a": 3
  },
  {
    "q": "Disajikan pernyataan penerapan pembelajaran dengan materi zakat hasil tanah yang disewakan sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan pengetahuan pedagogik. Pak Rendra ingin merancang pembelajaran zakat profesi yang mendorong pemecahan masalah nyata secara kolaboratif. Pilihan alat teknologi yang paling tepat digunakan adalah …",
    "o": [
      "Video penjelasan zakat profesi yang diputar di awal pembelajaran",
      "Modul digital berisi rangkuman konsep zakat profesi dan ketentuannya",
      "Platform pembelajaran daring yang memfasilitasi pemecahan masalah berbasis kasus, diskusi kelompok, dan pengumpulan solusi digital",
      "Aplikasi presentasi digital untuk menyampaikan tahapan perhitungan zakat profesi",
      "Rekaman ceramah interaktif yang dapat diakses peserta didik secara mandiri"
    ],
    "a": 3
  },
  {
    "q": "Disajikan deskripsi kasus penerapan pembelajaran dengan materi zakat profesi atau zakat produktif, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan pengetahuan teknologi. Rancangan pembelajaran berbasis masalah yang paling tepat untuk mengaitkan zakat profesi dengan persoalan ekonomi kontemporer (pekerja lepas digital, UMKM daring) adalah …",
    "o": [
      "Peserta didik menganalisis kasus pekerja digital melalui data simulasi pendapatan, lalu merancang solusi zakat produktif menggunakan aplikasi pengolah data sederhana",
      "Peserta didik mempelajari ketentuan zakat profesi melalui modul digital dan merangkum isi materi secara individu",
      "Peserta didik menonton video edukasi tentang zakat produktif dan mendiskusikan isi video secara umum",
      "Peserta didik mengerjakan soal pilihan ganda berbasis komputer tentang perhitungan zakat profesi",
      "Peserta didik mengumpulkan informasi zakat dari berbagai situs lalu menyajikannya dalam bentuk ringkasan tertulis"
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi kasus penerapan pembelajaran dengan materi zakat profesi atau zakat produktif sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis perbedaan individu sesuai dengan materi pembelajaran. Rancangan pembelajaran yang paling sesuai dengan pendekatan pembelajaran berbasis perbedaan individu (diferensiasi) pada materi zakat produktif adalah …",
    "o": [
      "Penyampaian materi zakat profesi dan zakat produktif secara terpadu melalui satu strategi pembelajaran untuk seluruh peserta didik",
      "Penugasan seragam berupa rangkuman materi zakat profesi dan zakat produktif untuk memastikan kesamaan pemahaman",
      "Penyusunan kegiatan belajar bertingkat yang memfasilitasi pemahaman konsep dasar, analisis kasus, dan pengembangan zakat produktif sesuai kemampuan peserta didik",
      "Penguatan materi zakat profesi dan zakat produktif melalui latihan soal objektif yang dikerjakan secara individual",
      "Pemanfaatan buku ajar sebagai sumber utama pembelajaran zakat profesi dan zakat produktif"
    ],
    "a": 3
  },
  {
    "q": "Disajikan pernyataan kasus penerapan pembelajaran dengan materi ajar penyaluran zakat untuk pembangunan masjid sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis perbedaan individu sesuai dengan pengetahuan pedagogi. Rancangan pembelajaran yang paling tepat berdasarkan pendekatan pembelajaran berbasis perbedaan individu dan pengetahuan pedagogi pada materi penyaluran zakat adalah …",
    "o": [
      "Menyusun satu rangkaian aktivitas belajar yang sama untuk seluruh peserta didik agar pembelajaran berjalan seragam",
      "Menekankan penguasaan konsep zakat melalui ceramah terstruktur dan penugasan tertulis yang terstandar",
      "Mengembangkan pembelajaran terdiferensiasi melalui variasi sumber belajar, aktivitas analisis, dan produk belajar sesuai kesiapan peserta didik",
      "Mengarahkan seluruh peserta didik pada diskusi kelas terpimpin untuk menyamakan pemahaman materi",
      "Memusatkan pembelajaran pada hafalan ketentuan zakat sebagai dasar pemahaman konseptual"
    ],
    "a": 3
  },
  {
    "q": "Disajikan pernyataan penerapan pembelajaran dengan materi monogami, poligami, atau nikah mut’ah sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis perbedaan individu sesuai dengan pengetahuan teknologi. Ibu Lestari ingin merancang pembelajaran monogami yang adil bagi peserta didik dengan gaya belajar teks/diagram maupun visual naratif. Pilihan alat teknologi yang paling tepat adalah …",
    "o": [
      "Satu video pembelajaran interaktif yang ditonton bersama seluruh peserta didik",
      "Modul digital tunggal berbentuk PDF yang dapat diakses melalui gawai peserta didik",
      "Platform pembelajaran daring yang menyediakan pilihan konten (teks, video, studi kasus) sesuai preferensi belajar peserta didik",
      "Aplikasi presentasi digital untuk menyampaikan materi monogami secara sistematis",
      "Rekaman ceramah guru yang dapat diputar ulang oleh peserta didik"
    ],
    "a": 2
  },
  {
    "q": "Disajikan narasi kasus penerapan pembelajaran dengan materi bank, rente, atau fee sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis pembelajaran mendalam sesuai dengan materi pembelajaran. Rancangan pembelajaran yang paling sesuai dengan pendekatan pembelajaran mendalam agar peserta didik mampu mengaitkan konsep bank syariah dengan praktik layanan digital sehari-hari adalah …",
    "o": [
      "Mengajak peserta didik menganalisis layanan perbankan yang mereka gunakan, mengaitkannya dengan prinsip syariah, lalu merefleksikan temuan dalam bentuk laporan digital",
      "Menyusun materi perbankan secara runtut melalui presentasi digital agar mudah dipahami",
      "Memberikan latihan soal konsep bank syariah untuk memperkuat penguasaan istilah",
      "Menggunakan video pembelajaran perbankan sebagai pengantar diskusi kelas",
      "Menyampaikan rangkuman materi bank syariah sebagai bahan belajar mandiri"
    ],
    "a": 0
  },
  {
    "q": "Disajikan narasi kasus penerapan pembelajaran dengan materi pemerintahan dalam islam sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis pembelajaran mendalam sesuai dengan pengetahuan pedagogi. Materi pemerintahan dalam Islam memuat prinsip kepemimpinan, keadilan, dan musyawarah. Rancangan pembelajaran yang paling sesuai dengan pendekatan pembelajaran mendalam adalah …",
    "o": [
      "Penyampaian materi secara sistematis melalui penjelasan guru untuk menjaga alur pembelajaran",
      "Penugasan merangkum konsep pemerintahan Islam dari berbagai sumber bacaan",
      "Kegiatan pembelajaran yang mengajak peserta didik menghubungkan prinsip pemerintahan Islam dengan situasi nyata melalui diskusi terarah",
      "Pemberian latihan soal pilihan ganda untuk mengukur pemahaman konsep dasar",
      "Penguatan materi melalui pengulangan konsep utama secara klasikal"
    ],
    "a": 2
  },
  {
    "q": "Disajikan kasus penerapan pembelajaran dengan materi implementasi pendidikan karakter atau pendidikan nilai sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis pembelajaran mendalam sesuai dengan pengetahuan teknologi. Rancangan pembelajaran berpendekatan pembelajaran mendalam yang paling tepat untuk mengimplementasikan pendidikan karakter (kejujuran dan tanggung jawab) menggunakan teknologi adalah …",
    "o": [
      "Menyampaikan materi nilai karakter secara sistematis melalui presentasi digital agar mudah dipahami",
      "Menyusun pembelajaran berbasis ceramah dengan dukungan media digital sebagai alat bantu visual",
      "Mengajak peserta didik menganalisis kasus nyata pendidikan karakter melalui sumber digital, merefleksikan nilai yang terkandung, dan menyajikan hasil pemaknaan menggunakan media teknologi",
      "Memberikan rangkuman materi pendidikan karakter lalu menugaskan peserta didik menjawab pertanyaan pemahaman",
      "Menggunakan aplikasi pembelajaran untuk menyajikan kuis nilai karakter sebagai penguatan konsep"
    ],
    "a": 2
  },
  {
    "q": "Disajikan kasus penerapan pembelajaran dengan materi implementasi moderasi beragama di Indonesia sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis TPACK sesuai dengan materi pembelajaran. Mengapa penggunaan pendekatan TPACK (Zoom, Kahoot!, Padlet) dianggap efektif dalam pembelajaran Islam sebagai agama yang moderat?",
    "o": [
      "Karena teknologi hanya digunakan untuk presentasi tanpa diskusi interaktif",
      "Karena teknologi memungkinkan interaksi aktif dan kolaborasi antar siswa dalam mengeksplorasi konsep moderasi beragama dan memberikan evaluasi yang cepat dan efektif",
      "Karena penggunaan Kahoot! tidak relevan dengan materi moderasi beragama",
      "Karena pembelajaran ini lebih banyak berbicara tentang teori tanpa mengaitkannya dengan aplikasi teknologi",
      "Karena teknologi hanya digunakan untuk menghafal definisi moderasi beragama"
    ],
    "a": 1
  },
  {
    "q": "Diberikan kasus penyajian materi zakat hasil tanah yang disewakan yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa dapat menentukan penggunaan strategi pembelajaran berpendekatan PBL guna menciptkan suasana belajar yang aman untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing. Strategi pembelajaran berpendekatan Problem Based Learning (PBL) yang paling tepat untuk menciptakan suasana belajar yang aman dan bermakna pada materi zakat sewa lahan adalah …",
    "o": [
      "Mengelola pembelajaran melalui presentasi guru agar alur diskusi tetap terkendali",
      "Menugaskan peserta didik mempelajari materi zakat hasil tanah secara mandiri melalui sumber bacaan",
      "Menyajikan permasalahan autentik sewa tanah pertanian modern, memfasilitasi diskusi kelompok terarah, dan membimbing peserta didik merumuskan solusi secara bertahap",
      "Menyampaikan klarifikasi hukum zakat hasil tanah secara sistematis agar perbedaan pandangan dapat diminimalkan",
      "Mengarahkan peserta didik mencatat poin-poin penting materi zakat hasil tanah untuk memperkuat pemahaman konsep"
    ],
    "a": 2
  },
  {
    "q": "Diberikan kasus penyajian materi zakat hasil tanah yang disewakan yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa dapat menentukan penggunaan strategi pembelajaran berpendekatan PjBL guna menciptkan suasana belajar yang nyaman untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing. Strategi pembelajaran berpendekatan PjBL (Project Based Learning) yang paling tepat untuk materi zakat hasil tanah sewaan pada pertanian modern adalah …",
    "o": [
      "Mengarahkan peserta didik mengembangkan proyek analisis zakat hasil tanah sewaan berbasis kasus pertanian modern di sekitar mereka, mulai dari identifikasi masalah hingga produk edukatif",
      "Menugaskan peserta didik menyusun proyek laporan tertulis berdasarkan sumber bacaan yang telah dipilih guru",
      "Memfasilitasi diskusi kelompok mengenai perbedaan sistem sewa tanah tradisional dan modern",
      "Menyajikan contoh-contoh mutakhir zakat hasil tanah sewaan melalui media digital agar peserta didik memahami konteks kekinian",
      "Memberikan latihan proyek perhitungan zakat hasil tanah sewaan menggunakan data simulasi yang disiapkan guru"
    ],
    "a": 0
  },
  {
    "q": "Diberikan kasus penyajian materi zakat profesi atau zakat produktif yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa dapat menentukan penggunaan strategi pembelajaran berpendekatan DBL guna menciptkan suasana belajar yang membahagiakan untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing. Apa ciri utama dari strategi Discovery-Based Learning (DBL) yang membantu siswa memahami hubungan takdir dan iman kepada hari akhir secara bermakna?",
    "o": [
      "Guru menjelaskan konsep takdir secara satu arah dan menyuruh siswa mencatat",
      "Siswa dibiarkan mencari pemahaman sendiri tanpa arahan",
      "Siswa dibimbing untuk menemukan sendiri makna takdir melalui studi kasus, refleksi, dan pengalaman nyata",
      "Guru hanya memberi ujian untuk mengukur kemampuan hafalan siswa",
      "Guru melarang diskusi untuk menghindari kesalahan pemahaman"
    ],
    "a": 2
  },
  {
    "q": "Diberikan kasus penyajian materi zakat profesi atau zakat produktif yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa dapat menentukan penggunaan model pembelajaran berpendekatan DL guna menciptkan suasana belajar yang akomodatif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing. Penggunaan model Discovery Learning yang paling tepat untuk mengatasi kurangnya relevansi materi zakat profesi dengan realitas pekerjaan modern (konten kreator, freelancer) adalah …",
    "o": [
      "Mengarahkan peserta didik menelusuri contoh zakat profesi dari berbagai sumber digital, kemudian menyimpulkan prinsip penetapannya secara mandiri",
      "Menyampaikan pembaruan materi zakat melalui penjelasan langsung agar seluruh peserta didik memperoleh pemahaman yang sama",
      "Memberikan rangkuman konsep zakat modern lalu meminta peserta didik menghafalkan jenis dan ketentuannya",
      "Menugaskan peserta didik membaca artikel zakat tanpa proses pengolahan informasi dan refleksi",
      "Menyajikan materi zakat dalam bentuk presentasi agar pembelajaran lebih menarik secara visual"
    ],
    "a": 0
  },
  {
    "q": "Diberikan kasus penyajian materi penyaluran zakat untuk pembangunan masjid yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa dapat menentukan penggunaan model pembelajaran berpendekatan TPACK guna menciptkan suasana belajar yang adaptif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing. Model pembelajaran berpendekatan TPACK yang paling tepat diterapkan Pak Fahmi untuk materi penyaluran zakat pembangunan masjid agar relevan dengan pengelolaan modern adalah …",
    "o": [
      "Menggabungkan kajian konsep zakat dengan analisis praktik penyaluran zakat berbasis digital melalui media interaktif yang terarah",
      "Menyampaikan materi zakat menggunakan presentasi multimedia agar peserta didik lebih mudah memahami isi materi",
      "Mengarahkan peserta didik membaca sumber daring tentang zakat tanpa pendampingan pedagogis yang terencana",
      "Memfokuskan pembelajaran pada diskusi nilai zakat tanpa melibatkan pemanfaatan teknologi pembelajaran",
      "Mengutamakan penggunaan aplikasi digital tanpa mengaitkan materi dengan tujuan pembelajaran"
    ],
    "a": 0
  },
  {
    "q": "Diberikan kasus penyajian materi pemerintahan dalam Islam yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa dapat menentukan penggunaan model pembelajaran berpendekatan PBL guna menciptkan suasana belajar yang partisipatif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing. Model pembelajaran berpendekatan Problem Based Learning (PBL) yang paling tepat untuk materi pemerintahan dalam Islam agar relevan dengan nilai-nilai demokrasi modern adalah …",
    "o": [
      "Peserta didik menganalisis kasus pemilihan pemimpin di era modern, membandingkannya dengan prinsip musyawarah dalam Islam, lalu merumuskan solusi atas permasalahan kepemimpinan melalui diskusi kelompok",
      "Peserta didik mempelajari sejarah sistem pemerintahan Islam melalui presentasi guru dan merangkum poin-poin penting secara individu",
      "Peserta didik mengerjakan soal pilihan ganda mengenai konsep khilafah dan keadilan dalam Islam",
      "Peserta didik menonton dokumenter tentang sejarah dinasti Islam dan mendiskusikan isinya secara klasikal",
      "Peserta didik membaca teks tentang tugas pemimpin dalam Islam lalu mencatatnya di buku tugas"
    ],
    "a": 0
  },
  {
    "q": "Diberikan deskripsi materi fiqih munakahat (nikah mut’ah) yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa dapat menentukan penggunaan strategi pembelajaran berpendekatan PjBL guna menciptkan suasana belajar yang aman untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing. Strategi pembelajaran berpendekatan Project Based Learning (PjBL) yang paling tepat untuk materi nikah mut'ah agar relevan dengan nilai-nilai sosial yang aman adalah …",
    "o": [
      "Peserta didik mengembangkan proyek analisis dampak sosial dan hukum nikah mut'ah melalui wawancara tokoh agama dan sosiolog, lalu menyajikan temuan dalam bentuk laporan hasil proyek",
      "Peserta didik mengerjakan kuis daring mengenai sejarah dan hukum nikah mut'ah di Indonesia",
      "Peserta didik membaca artikel hukum Islam tentang nikah mut'ah dan membuat rangkuman secara individu",
      "Peserta didik menonton video pendek tentang perbedaan nikah sah dan nikah mut'ah lalu mendiskusikannya di kelas",
      "Peserta didik mempelajari dalil-dalil pengharaman nikah mut'ah melalui presentasi guru"
    ],
    "a": 0
  },
  {
    "q": "Diberikan kasus materi konsep bank syariah yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa dapat memilih strategi evaluasi pembelajaran berpendekatan DBL guna menciptkan suasana belajar yang nyaman untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing. Strategi evaluasi yang paling tepat untuk mengukur pencapaian pembelajaran melalui Discovery-Based Learning (DBL) pada materi perbankan syariah adalah …",
    "o": [
      "Penilaian jurnal refleksi siswa mengenai temuan mereka terhadap prinsip perbankan syariah di lapangan, rubrik penilaian produk temuan, dan penilaian kolaborasi",
      "Tes tertulis objektif mengenai produk-produk perbankan syariah",
      "Laporan tertulis individu tentang hasil ringkasan sejarah bank syariah",
      "Kuis cepat menggunakan media digital mengenai istilah bagi hasil",
      "Observasi guru terhadap keaktifan siswa saat ceramah materi"
    ],
    "a": 0
  },
  {
    "q": "Diberikan kasus materi sejarah dakwah Nabi Muhammad di Madinah yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa dapat memilih strategi evaluasi pembelajaran berpendekatan DL guna menciptkan suasana belajar yang membahagiakan untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing. Strategi evaluasi yang paling tepat untuk mengukur pencapaian pembelajaran melalui Discovery Learning (DL) pada materi strategi dakwah Nabi di Madinah adalah …",
    "o": [
      "Penilaian produk kreatif (contoh: komik digital atau video sejarah) hasil analisis strategi dakwah, rubrik penilaian produk temuan, dan penilaian sikap toleransi",
      "Tes tertulis esai untuk mengukur hafalan tanggal-tanggal penting hijrah",
      "Penilaian hasil rangkuman teks sejarah dakwah dari buku paket",
      "Kuis interaktif untuk mengukur pemahaman tokoh-tokoh dakwah",
      "Presentasi kelompok tanpa rubrik penilaian yang jelas"
    ],
    "a": 0
  },
  {
    "q": "Diberikan kasus materi implementasi moderasi beragama di Indonesia yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa dapat memilih strategi evaluasi pembelajaran berpendekatan TPACK guna menciptkan suasana belajar yang akomodatif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing. Strategi evaluasi yang paling tepat untuk mengukur pencapaian tujuan pembelajaran menggunakan pendekatan TPACK pada materi implementasi moderasi beragama adalah …",
    "o": [
      "Penilaian proyek berbasis teknologi (contoh: membuat konten kampanye moderasi di media sosial), rubrik penilaian interaksi di platform daring, dan tes esai berbasis kasus",
      "Tes tertulis konvensional mengenai definisi-definisi moderasi beragama",
      "Laporan tertulis individu tentang hasil ringkasan materi wasathiyah",
      "Observasi guru terhadap keaktifan siswa saat ceramah",
      "Kuis Kahoot! mengenai rukun-rukun Islam"
    ],
    "a": 0
  },
  {
    "q": "Disajikan narasi kasus evaluasi pembelajaran fiqih berbasis TPACK, mahasiswa dapat merancang rubrik penilaian evaluasi pembelajaran fiqih yang berorientasi pada pengembangan keterampilan berpikir kritis dan inovatif. Rubrik penilaian yang paling tepat untuk mengukur kemampuan berpikir kritis dan inovatif siswa dalam proyek analisis kasus keuangan digital syariah adalah …",
    "o": [
      "Rubrik yang menitikberatkan pada ketepatan hafalan istilah syariah",
      "Rubrik yang menilai orisinalitas ide, kemampuan analisis hubungan konsep, dan kreativitas penyajian solusi kasus",
      "Rubrik yang hanya menilai kerapihan laporan tertulis tanpa memandang konten",
      "Rubrik yang menilai kecepatan siswa dalam mengumpulkan tugas",
      "Rubrik yang menitikberatkan pada kepatuhan siswa terhadap pendapat satu ulama saja"
    ],
    "a": 1
  },
  {
    "q": "Disajikan narasi kasus evaluasi pembelajaran fiqih berbasis AI, mahasiswa dapat menerapkan prinsip etika penggunaan AI dalam pembelajaran fiqih untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing. Prinsip etika penggunaan AI yang paling tepat diterapkan dalam evaluasi pembelajaran fiqih untuk menjamin integritas akademik siswa adalah …",
    "o": [
      "Membolehkan siswa menggunakan AI untuk mengerjakan semua ujian tanpa pengawasan",
      "Menggunakan AI untuk memindai plagiasi dan mendorong siswa menggunakan AI sebagai alat bantu analisis, bukan untuk mengambil alih pemikiran kritis",
      "Melarang penggunaan teknologi sama sekali dalam proses evaluasi",
      "Meminta siswa menyalin jawaban AI langsung tanpa dipelajari",
      "Menggunakan AI untuk menentukan nilai akhir siswa tanpa perlu diperiksa guru"
    ],
    "a": 1
  },
  {
    "q": "Disajikan narasi kasus perilaku belajar siswa, mahasiswa dapat memilih model pembelajaran yang paling sesuai untuk meningkatkan motivasi belajar. Siswa Gen Z seringkali bosan dengan metode ceramah konvensional. Model pembelajaran yang paling sesuai untuk meningkatkan partisipasi dan motivasi mereka dalam materi fiqih adalah …",
    "o": [
      "Model pembelajaran direct instruction (ceramah langsung)",
      "Model pembelajaran berbasis game interaktif dan simulasi kasus (gamifikasi)",
      "Model pembelajaran hafalan materi",
      "Model pembelajaran bacaan mandiri",
      "Model pembelajaran dikte"
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi kebutuhan pasar kerja, mahasiswa dapat merancang asesmen pembelajaran yang relevan dengan kebutuhan dunia kerja. Asesmen pembelajaran fiqih yang paling relevan untuk mempersiapkan siswa di bidang ekonomi syariah dan teknologi adalah …",
    "o": [
      "Asesmen berbentuk hafalan ayat",
      "Asesmen berbentuk proyek simulasi transaksi perbankan syariah berbasis digital",
      "Asesmen berbentuk tes pilihan ganda konvensional",
      "Asesmen berbentuk resume buku fiqih",
      "Asesmen berbentuk ceramah di depan kelas"
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi masalah di masyarakat, mahasiswa dapat menggunakan konsep fiqih untuk merumuskan solusi. Dalam masyarakat majemuk, sering terjadi konflik terkait perbedaan penentuan awal Ramadan. Konsep fiqih yang paling tepat digunakan untuk merumuskan solusi adalah …",
    "o": [
      "Konsep taqlid buta",
      "Konsep hisab dan rukyat serta prinsip toleransi (tasamuh) dalam perbedaan ijtihad",
      "Konsep memaksakan pendapat mayoritas",
      "Konsep mengabaikan seluruh perbedaan",
      "Konsep menutup diri dari perbedaan"
    ],
    "a": 1
  },
  {
    "q": "Disajikan kasus penggunaan AI dalam pembelajaran, mahasiswa dapat mengidentifikasi masalah dan solusinya secara ilmiah. Pak Ahmad ingin menerapkan AI (Artificial Intelligence) untuk membantu siswa Gen Z dan Alpha yang belum beradaptasi optimal. Tindakan ilmiah yang paling tepat adalah …",
    "o": [
      "Menggunakan AI untuk menganalisis perilaku belajar peserta didik dan merekomendasikan strategi pembelajaran personal agar pengalaman belajar menjadi lebih bermakna",
      "Menerapkan pembelajaran yang telah dirancang sebelumnya secara konsisten untuk menjaga kestabilan proses",
      "Memanfaatkan AI pada aspek pengelolaan pembelajaran agar pelaksanaan kegiatan berjalan lebih tertib",
      "Menguatkan penyampaian materi melalui penjelasan langsung agar seluruh peserta didik memperoleh pemahaman yang sama",
      "Mengombinasikan penggunaan AI dengan pendekatan umum pembelajaran guna mendukung kelancaran penyampaian materi"
    ],
    "a": 0
  }
  {
    "q": "Diberikan kasus penyajian materi konsep bank syariah yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa dapat menentukan penggunaan strategi pembelajaran berpendekatan PjBL guna menciptkan suasana belajar yang apresiatif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing. Strategi pembelajaran berpendekatan PjBL (Project Based Learning) yang paling tepat untuk materi konsep bank syariah pada era perbankan digital adalah …",
    "o": [
      "Peserta didik mengembangkan proyek riset mengenai implementasi prinsip syariah pada aplikasi perbankan digital, kemudian menyajikan temuan dalam bentuk infografis atau video",
      "Peserta didik membuat laporan tertulis tentang sejarah berdirinya bank syariah berdasarkan buku teks",
      "Peserta didik mengerjakan kuis daring mengenai istilah-istilah dalam perbankan syariah",
      "Peserta didik melakukan simulasi transaksi di bank syariah secara konvensional di dalam kelas",
      "Peserta didik merangkum perbedaan antara bunga bank konvensional dan bagi hasil bank syariah"
    ],
    "a": 0
  },
  {
    "q": "Diberikan kasus penyajian materi pendidikan karakter yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa dapat menentukan penggunaan strategi pembelajaran berpendekatan DBL guna menciptkan suasana belajar yang partisipatif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing. Strategi pembelajaran berpendekatan Discovery-Based Learning (DBL) yang paling tepat untuk menanamkan pendidikan karakter (kejujuran) pada siswa Gen Z yang terbiasa dengan budaya instan adalah …",
    "o": [
      "Peserta didik menemukan sendiri dampak ketidakjujuran melalui simulasi permainan digital atau studi kasus nyata di sekolah, kemudian merumuskan nilai kejujuran yang harus diterapkan",
      "Guru menjelaskan teori karakter jujur secara satu arah dan meminta siswa menghafalnya",
      "Peserta didik merangkum artikel tentang pentingnya jujur dari sumber daring tanpa diskusi lebih lanjut",
      "Guru memberikan kuis tertulis tentang contoh perilaku jujur untuk mengukur pemahaman siswa",
      "Peserta didik meniru perilaku tokoh inspiratif dari video tanpa proses refleksi diri"
    ],
    "a": 0
  },
  {
    "q": "Diberikan kasus penyajian materi konsep hukum Islam dan moderasi beragama yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa dapat menentukan penggunaan strategi pembelajaran berpendekatan DL guna menciptkan suasana belajar yang inklusif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing. Strategi pembelajaran berpendekatan Discovery Learning (DL) yang paling tepat untuk materi konsep hukum Islam dan moderasi beragama di Indonesia yang majemuk adalah …",
    "o": [
      "Peserta didik menemukan konsep moderasi beragama dengan menganalisis perbedaan pendapat ulama melalui studi literatur berbasis teknologi, lalu mendiskusikannya secara kolaboratif",
      "Guru menyampaikan materi hukum Islam secara ceramah agar tidak terjadi salah tafsir oleh siswa",
      "Peserta didik mencatat definisi hukum Islam dan contoh-contoh moderasi yang diberikan oleh guru",
      "Peserta didik menjawab soal pilihan ganda tentang rukun-rukun dalam hukum Islam",
      "Peserta didik membuat poster tentang toleransi tanpa melalui proses penemuan konsep"
    ],
    "a": 0
  },
  {
    "q": "Diberikan kasus penyajian materi sejarah dakwah Nabi Muhammad di Madinah yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa dapat menentukan penggunaan strategi pembelajaran berpendekatan TPACK guna menciptkan suasana belajar yang kolaboratif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing. Strategi pembelajaran berpendekatan TPACK (Technological Pedagogical Content Knowledge) yang paling tepat untuk materi strategi dakwah Nabi Muhammad di Madinah agar relevan dengan konteks dakwah digital saat ini adalah …",
    "o": [
      "Peserta didik menganalisis strategi Nabi membangun masyarakat Madinah menggunakan media interaktif (timeline digital), lalu merancang ide dakwah di media sosial berbasis prinsip dakwah tersebut",
      "Peserta didik menonton video sejarah dakwah Nabi dan menjawab soal pemahaman melalui formulir daring",
      "Peserta didik membaca e-book sejarah dakwah dan membuat rangkuman di perangkat elektronik",
      "Guru menggunakan presentasi PowerPoint untuk menjelaskan materi sejarah dakwah secara konvensional",
      "Peserta didik mengerjakan kuis Kahoot! mengenai tokoh-tokoh yang terlibat dalam peristiwa hijrah"
    ],
    "a": 0
  },
  {
    "q": "Diberikan kasus kasus materi zakat hasil tanah yang disewakan yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa dapat memilih strategi evaluasi pembelajaran berpendekatan PBL guna menciptkan suasana belajar yang aman untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing. Strategi evaluasi yang paling tepat untuk mengukur pencapaian tujuan pembelajaran berbasis masalah (PBL) pada materi zakat hasil tanah adalah …",
    "o": [
      "Penilaian kinerja kelompok dalam memecahkan masalah sewa tanah, rubrik penilaian produk solusi, dan penilaian diri terhadap sikap tanggung jawab",
      "Tes tertulis objektif mengenai nisab dan kadar zakat hasil pertanian",
      "Laporan tertulis individu tentang hasil ringkasan materi zakat",
      "Kuis cepat menggunakan media digital mengenai istilah-istilah fiqih zakat",
      "Observasi kehadiran siswa selama proses diskusi di kelas"
    ],
    "a": 0
  },
  {
    "q": "Diberikan kasus materi zakat profesi atau zakat produktif yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa dapat memilih strategi evaluasi pembelajaran berpendekatan PjBL guna menciptkan suasana belajar yang nyaman untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing. Strategi evaluasi yang paling tepat untuk menilai produk proyek (PjBL) materi zakat produktif adalah …",
    "o": [
      "Rubrik penilaian produk (contoh: proposal UMKM zakat) yang mencakup orisinalitas, relevansi kasus, dan ketepatan perhitungan, serta penilaian presentasi proyek",
      "Tes tertulis esai mengenai pengertian zakat produktif dan hukumnya",
      "Penilaian kesesuaian laporan tertulis dengan contoh di buku ajar",
      "Penilaian kecepatan siswa dalam menyelesaikan perhitungan zakat secara daring",
      "Kuesioner tentang tingkat kepuasan siswa terhadap pelaksanaan proyek"
    ],
    "a": 0
  },
  {
    "q": "Diberikan kasus materi penyaluran zakat untuk pembangunan masjid yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa dapat memilih strategi evaluasi pembelajaran berpendekatan DBL guna menciptkan suasana belajar yang membahagiakan untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing. Strategi evaluasi yang paling tepat untuk mengukur pemahaman konsep penyaluran zakat melalui Discovery-Based Learning (DBL) adalah …",
    "o": [
      "Penilaian jurnal refleksi siswa mengenai temuan mereka terhadap penyaluran zakat di lapangan, rubrik penilaian analisis kasus, dan penilaian kolaborasi",
      "Tes tertulis esai untuk mengukur hafalan ayat tentang penyaluran zakat",
      "Penilaian hasil rangkuman materi dari berbagai sumber daring",
      "Kuis interaktif untuk mengukur pemahaman dasar tentang penerima zakat",
      "Observasi partisipatif tanpa rubrik terstruktur"
    ],
    "a": 0
  },
  {
    "q": "Diberikan kasus materi Bank, Rente, atau Fee yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa dapat memilih strategi evaluasi pembelajaran berpendekatan DL guna menciptkan suasana belajar yang akomodatif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing. Strategi evaluasi yang paling tepat untuk mengukur pencapaian pembelajaran melalui Discovery Learning (DL) pada materi transaksi keuangan digital (Fee) adalah …",
    "o": [
      "Penilaian portofolio analisis kasus biaya layanan digital, rubrik penilaian produk temuan (analisis fee vs rente), dan penilaian sikap terhadap etika bertransaksi",
      "Tes pilihan ganda mengenai definisi bank dan bunga",
      "Penilaian hasil catatan harian materi transaksi keuangan",
      "Presentasi individu tanpa rubrik penilaian yang jelas",
      "Tes tertulis untuk menghafal jenis-jenis jasa perbankan"
    ],
    "a": 0
  },
  {
    "q": "Diberikan kasus materi Pemerintahan dalam Islam yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa dapat memilih strategi evaluasi pembelajaran berpendekatan TPACK guna menciptkan suasana belajar yang adaptif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing. Strategi evaluasi yang paling tepat untuk mengukur pencapaian tujuan pembelajaran menggunakan pendekatan TPACK pada materi pemerintahan dalam Islam adalah …",
    "o": [
      "Penilaian produk digital (misal: infografis atau video) hasil analisis prinsip kepemimpinan, rubrik penilaian interaksi di platform daring, dan tes esai berbasis kasus",
      "Tes tertulis konvensional mengenai sejarah pemerintahan Islam",
      "Laporan tertulis individu tentang hasil ringkasan teks kepemimpinan",
      "Observasi guru terhadap keaktifan siswa saat ceramah",
      "Kuis Kahoot! mengenai istilah kepemimpinan dalam bahasa Arab"
    ],
    "a": 0
  },
  }
]
