[
  {
    "q": "Dalam proses pembelajaran Fikih di kelas XII, seorang guru mengangkat topik \"Zakat atas hasil tanah yang disewakan.\" Ia menyampaikan bahwa zakat ini tergolong zakat mal dan mengajak siswa untuk memahami bukan hanya dari aspek hukum, tapi juga dari aspek spiritual: bahwa zakat adalah bentuk ketundukan kepada Allah sekaligus instrumen keadilan sosial. Guru ingin tujuan pembelajaran mencerminkan transformasi sikap spiritual dan sosial siswa.\n\nBerikut beberapa rumusan tujuan pembelajaran ranah sikap yang disusun oleh guru:\n1. Peserta didik dapat menjelaskan dalil kewajiban zakat hasil tanah yang disewakan.\n2. Peserta didik dapat menunaikan zakat secara ikhlas sebagai bentuk kepatuhan kepada Allah.\n3. Peserta didik dapat menghitung zakat mal atas penyewaan tanah secara akurat.\n4. Peserta didik dapat menyampaikan pendapat tentang peran zakat dalam mengurangi kemiskinan.\n5. Peserta didik dapat membedakan zakat pertanian dan zakat harta.\n\nDari lima rumusan di atas, manakah yang paling mencerminkan ranah sikap yang mendukung peningkatan keimanan, ketakwaan, dan akhlak mulia?",
    "o": [
      "Tujuan nomor 1, karena pengetahuan dalil akan membentuk dasar sikap yang kuat",
      "Tujuan nomor 2, karena mencerminkan praktik nyata dalam bentuk ketundukan dan keikhlasan kepada Allah",
      "Tujuan nomor 3, karena keterampilan berhitung akan melatih kejujuran",
      "Tujuan nomor 4, karena menyampaikan pendapat menunjukkan kepedulian sosial",
      "Tujuan nomor 5, karena klasifikasi zakat menumbuhkan sikap teliti"
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran Fikih, guru menyajikan kasus tentang pengelolaan zakat profesi dan zakat produktif yang dilakukan oleh lembaga amil zakat di daerah perkotaan dan pedesaan. Guru memperlihatkan data perbandingan efektivitas zakat konsumtif dan produktif dalam mengentaskan kemiskinan.\n\nPeserta didik diajak berdiskusi dan diminta menentukan rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai agar peserta didik mampu berpikir kritis.\n\nRumusan tujuan pembelajaran yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian zakat profesi dan zakat produktif",
      "Peserta didik mampu menjelaskan perbedaan zakat konsumtif dan zakat produktif",
      "Peserta didik mampu menganalisis efektivitas zakat profesi dan zakat produktif dalam mengentaskan kemiskinan",
      "Peserta didik mampu menghafal dalil zakat profesi",
      "Peserta didik mampu menyebutkan jenis-jenis zakat"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran Fikih, guru menjelaskan bahwa penggunaan zakat untuk pembangunan masjid masih menjadi perdebatan ulama, namun dapat dibenarkan dalam konteks maslahat umum. Guru kemudian mengajak peserta didik mencermati kondisi masjid di sekitar mereka dan mengembangkan ide kreatif berbasis semangat gotong royong dalam menggalang dana dan tenaga masyarakat melalui pendekatan syariah.\n\nRumusan tujuan pembelajaran ranah keterampilan yang paling tepat untuk mendorong peserta didik memiliki semangat gotong royong dan kemampuan mencipta adalah …",
    "o": [
      "Peserta didik dapat menyebutkan bentuk-bentuk penyaluran zakat untuk kepentingan umat Islam",
      "Peserta didik dapat menyusun makalah tentang pendapat ulama mengenai zakat untuk pembangunan masjid",
      "Peserta didik dapat mengembangkan program kolaboratif berbasis zakat yang mendukung pembangunan masjid dengan melibatkan peran aktif masyarakat",
      "Peserta didik dapat membuat ringkasan infografis tentang zakat pembangunan masjid",
      "Peserta didik dapat menyusun laporan hasil observasi masjid di lingkungan sekitar"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran Fikih tentang zakat pertanian, guru menyajikan data hasil panen padi dari beberapa petani dengan sistem irigasi dan tadah hujan.\n\nPeserta didik diminta menentukan kadar zakat yang tepat berdasarkan kondisi tersebut.\n\nRumusan tujuan pembelajaran ranah keterampilan yang paling sesuai adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian zakat pertanian",
      "Peserta didik mampu menghafal dalil tentang zakat pertanian",
      "Peserta didik mampu menghitung kadar zakat pertanian berdasarkan jenis pengairannya",
      "Peserta didik mampu menjelaskan perbedaan zakat pertanian dan zakat mal",
      "Peserta didik mampu menyebutkan syarat wajib zakat pertanian"
    ],
    "a": 2
  },
  {
    "q": "Guru menjelaskan perbedaan pendapat ulama mengenai zakat atas penghasilan dari penyewaan aset seperti ruko dan lahan.\n\nPeserta didik diminta memahami dasar perbedaan tersebut agar bersikap bijak dalam menyikapi khilafiyah.\n\nTujuan pembelajaran ranah sikap yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menghafal pendapat para ulama",
      "Peserta didik mampu menjelaskan pengertian khilafiyah",
      "Peserta didik menunjukkan sikap toleran dan saling menghormati terhadap perbedaan pendapat ulama",
      "Peserta didik mampu menyebutkan dalil zakat sewa aset",
      "Peserta didik mampu menuliskan ringkasan materi zakat"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran Fikih, guru mengangkat isu rendahnya kesadaran masyarakat dalam menunaikan zakat meskipun telah mencapai nisab.\n\nPeserta didik diminta mengaitkan materi zakat dengan kondisi sosial di lingkungan sekitar.\n\nRumusan tujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian nisab",
      "Peserta didik mampu menghafal dalil kewajiban zakat",
      "Peserta didik mampu menganalisis faktor penyebab rendahnya kesadaran masyarakat dalam menunaikan zakat",
      "Peserta didik mampu menuliskan contoh zakat mal",
      "Peserta didik mampu menyebutkan jenis-jenis zakat"
    ],
    "a": 2
  },
  {
    "q": "Guru memberikan tugas proyek kepada peserta didik untuk merancang program penyaluran zakat yang tepat sasaran di lingkungan sekolah atau masyarakat.\n\nTujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan golongan penerima zakat",
      "Peserta didik mampu menjelaskan pengertian zakat",
      "Peserta didik mampu merancang program penyaluran zakat yang efektif dan tepat sasaran",
      "Peserta didik mampu menghafal dalil tentang zakat",
      "Peserta didik mampu menuliskan jenis-jenis zakat"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran tentang hikmah zakat, guru menekankan bahwa zakat tidak hanya berdampak pada penerima, tetapi juga pada pembentuk karakter muzakki.\n\nRumusan tujuan pembelajaran ranah sikap yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan hikmah zakat",
      "Peserta didik mampu menghafal dalil tentang zakat",
      "Peserta didik menunjukkan sikap empati, peduli, dan tanggung jawab sosial melalui kesadaran berzakat",
      "Peserta didik mampu menuliskan pengertian zakat",
      "Peserta didik mampu menyebutkan macam-macam zakat"
    ],
    "a": 2
  },
  {
    "q": "Guru menjelaskan mekanisme pengelolaan zakat oleh lembaga amil zakat secara profesional dan transparan.\n\nPeserta didik diminta memahami pentingnya akuntabilitas dalam pengelolaan zakat.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menghafal struktur lembaga zakat",
      "Peserta didik mampu menyebutkan tugas amil zakat",
      "Peserta didik mampu menganalisis prinsip transparansi dan akuntabilitas dalam pengelolaan zakat",
      "Peserta didik mampu menuliskan dalil tentang amil zakat",
      "Peserta didik mampu menyebutkan jenis lembaga zakat"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran Fikih, guru mengajak peserta didik merefleksikan pengalaman pribadi atau lingkungan terkait zakat dan kepedulian sosial.\n\nTujuan pembelajaran ranah sikap yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian zakat",
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik menunjukkan kesadaran dan kepedulian sosial sebagai wujud pengamalan nilai zakat",
      "Peserta didik mampu menuliskan jenis-jenis zakat",
      "Peserta didik mampu menjelaskan syarat wajib zakat"
    ],
    "a": 2
  },
  {
    "q": "Guru menjelaskan bahwa zakat merupakan salah satu rukun Islam yang memiliki dimensi ibadah dan sosial.\n\nPeserta didik diminta mengaitkan kewajiban zakat dengan upaya mewujudkan keadilan sosial.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menghafal rukun Islam",
      "Peserta didik mampu menyebutkan pengertian zakat",
      "Peserta didik mampu menganalisis hubungan zakat dengan keadilan sosial dalam masyarakat",
      "Peserta didik mampu menuliskan dalil kewajiban zakat",
      "Peserta didik mampu menyebutkan jenis-jenis zakat"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran tentang mustahik zakat, guru menyajikan kasus penyaluran zakat yang kurang tepat sasaran.\n\nPeserta didik diminta memahami golongan yang berhak menerima zakat sesuai ketentuan syariat.\n\nRumusan tujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menghafal dalil tentang mustahik",
      "Peserta didik mampu menyebutkan delapan golongan penerima zakat",
      "Peserta didik mampu menganalisis kriteria mustahik sesuai ketentuan syariat Islam",
      "Peserta didik mampu menuliskan contoh penyaluran zakat",
      "Peserta didik mampu menjelaskan pengertian zakat"
    ],
    "a": 2
  },
  {
    "q": "Guru memberikan tugas kepada peserta didik untuk melakukan simulasi penyaluran zakat kepada mustahik di lingkungan sekitar.\n\nTujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan golongan mustahik",
      "Peserta didik mampu menjelaskan hikmah zakat",
      "Peserta didik mampu mempraktikkan penyaluran zakat secara tepat sesuai ketentuan syariat",
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik mampu menuliskan laporan teori zakat"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran fikih muamalah, guru membahas zakat sebagai instrumen pemberdayaan ekonomi umat.\n\nPeserta didik diminta memahami peran zakat produktif dalam meningkatkan kesejahteraan masyarakat.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian zakat produktif",
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik mampu menganalisis peran zakat produktif dalam pemberdayaan ekonomi umat",
      "Peserta didik mampu menuliskan contoh zakat mal",
      "Peserta didik mampu menyebutkan syarat wajib zakat"
    ],
    "a": 2
  },
  {
    "q": "Guru menekankan pentingnya niat yang ikhlas dalam menunaikan zakat.\n\nPeserta didik diminta merefleksikan niat dalam setiap ibadah yang dilakukan.\n\nTujuan pembelajaran ranah sikap yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian niat",
      "Peserta didik mampu menghafal dalil tentang niat",
      "Peserta didik menunjukkan sikap ikhlas dalam menunaikan zakat dan ibadah lainnya",
      "Peserta didik mampu menuliskan contoh niat zakat",
      "Peserta didik mampu menjelaskan rukun zakat"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran fikih, guru membahas ketentuan nisab dan haul dalam zakat mal.\n\nPeserta didik diminta memahami syarat wajib zakat agar tidak terjadi kesalahan dalam penerapannya.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menghafal dalil zakat mal",
      "Peserta didik mampu menyebutkan jenis-jenis zakat",
      "Peserta didik mampu menganalisis ketentuan nisab dan haul dalam zakat mal",
      "Peserta didik mampu menuliskan contoh zakat fitrah",
      "Peserta didik mampu menjelaskan hikmah zakat"
    ],
    "a": 2
  },
  {
    "q": "Guru memberikan studi kasus tentang seseorang yang menunda pembayaran zakat tanpa alasan yang dibenarkan.\n\nPeserta didik diminta menilai kasus tersebut berdasarkan hukum Islam.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian zakat",
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik mampu menganalisis hukum menunda pembayaran zakat tanpa alasan syar’i",
      "Peserta didik mampu menuliskan contoh zakat mal",
      "Peserta didik mampu menyebutkan syarat wajib zakat"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran fikih, guru menanamkan nilai kejujuran dalam menghitung dan melaporkan harta yang wajib dizakati.\n\nTujuan pembelajaran ranah sikap yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan jenis-jenis zakat",
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik menunjukkan sikap jujur dan amanah dalam menghitung serta menunaikan zakat",
      "Peserta didik mampu menuliskan contoh zakat",
      "Peserta didik mampu menjelaskan pengertian zakat"
    ],
    "a": 2
  },
  {
    "q": "Guru mengajak peserta didik mengevaluasi peran lembaga zakat di daerah masing-masing.\n\nPeserta didik diminta memberikan solusi perbaikan pengelolaan zakat.\n\nTujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan lembaga zakat",
      "Peserta didik mampu menjelaskan tugas amil zakat",
      "Peserta didik mampu merumuskan solusi perbaikan pengelolaan zakat di lingkungan sekitar",
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik mampu menuliskan jenis zakat"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran penutup materi zakat, guru mengajak peserta didik menyimpulkan manfaat zakat bagi individu dan masyarakat.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menghafal hikmah zakat",
      "Peserta didik mampu menyebutkan pengertian zakat",
      "Peserta didik mampu menganalisis manfaat zakat bagi individu dan masyarakat",
      "Peserta didik mampu menuliskan dalil zakat",
      "Peserta didik mampu menyebutkan jenis-jenis zakat"
    ],
    "a": 2
  },
  {
    "q": "Guru menjelaskan perbedaan zakat fitrah dan zakat mal beserta waktu pelaksanaannya.\n\nPeserta didik diminta memahami perbedaan tersebut agar tidak keliru dalam menunaikannya.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik mampu menyebutkan jenis-jenis zakat",
      "Peserta didik mampu menganalisis perbedaan zakat fitrah dan zakat mal berdasarkan ketentuan syariat",
      "Peserta didik mampu menuliskan contoh zakat",
      "Peserta didik mampu menjelaskan hikmah zakat"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran tentang zakat fitrah, guru menekankan pentingnya menunaikan zakat tepat waktu sebelum salat Id.\n\nTujuan pembelajaran ranah sikap yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian zakat fitrah",
      "Peserta didik mampu menghafal dalil zakat fitrah",
      "Peserta didik menunjukkan kesadaran dan tanggung jawab untuk menunaikan zakat fitrah tepat waktu",
      "Peserta didik mampu menuliskan waktu zakat fitrah",
      "Peserta didik mampu menjelaskan syarat wajib zakat fitrah"
    ],
    "a": 2
  },
  {
    "q": "Guru memberikan contoh kasus pembayaran zakat fitrah dengan uang dan bahan makanan.\n\nPeserta didik diminta memahami perbedaan pendapat ulama terkait hal tersebut.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian zakat fitrah",
      "Peserta didik mampu menghafal dalil zakat fitrah",
      "Peserta didik mampu menganalisis perbedaan pendapat ulama tentang pembayaran zakat fitrah",
      "Peserta didik mampu menuliskan contoh zakat fitrah",
      "Peserta didik mampu menyebutkan waktu zakat fitrah"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran fikih, guru mengajak peserta didik melakukan simulasi penghitungan zakat fitrah di lingkungan sekolah.\n\nTujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan syarat wajib zakat fitrah",
      "Peserta didik mampu menghafal dalil zakat fitrah",
      "Peserta didik mampu menghitung dan mempraktikkan pembayaran zakat fitrah sesuai ketentuan",
      "Peserta didik mampu menuliskan contoh zakat fitrah",
      "Peserta didik mampu menjelaskan hikmah zakat fitrah"
    ],
    "a": 2
  },
  {
    "q": "Guru menjelaskan hikmah zakat fitrah dalam menyucikan jiwa dan menyempurnakan ibadah puasa.\n\nTujuan pembelajaran ranah sikap yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan hikmah zakat fitrah",
      "Peserta didik mampu menghafal dalil zakat fitrah",
      "Peserta didik menunjukkan kesadaran untuk membersihkan diri dan peduli kepada sesama melalui zakat fitrah",
      "Peserta didik mampu menuliskan pengertian zakat fitrah",
      "Peserta didik mampu menyebutkan waktu zakat fitrah"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran fikih, guru membahas peran amil zakat dalam pengumpulan dan pendistribusian zakat fitrah.\n\nPeserta didik diminta memahami tugas dan tanggung jawab amil zakat.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian amil zakat",
      "Peserta didik mampu menghafal dalil amil zakat",
      "Peserta didik mampu menganalisis peran dan tanggung jawab amil zakat dalam pengelolaan zakat fitrah",
      "Peserta didik mampu menuliskan contoh amil zakat",
      "Peserta didik mampu menyebutkan jenis zakat"
    ],
    "a": 2
  },
  {
    "q": "Guru menekankan pentingnya kejujuran dan amanah bagi amil zakat dalam menjalankan tugasnya.\n\nTujuan pembelajaran ranah sikap yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan tugas amil zakat",
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik menunjukkan sikap jujur dan amanah dalam menjalankan tugas sebagai amil zakat",
      "Peserta didik mampu menuliskan contoh zakat",
      "Peserta didik mampu menjelaskan pengertian zakat"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran fikih, guru mengajak peserta didik mengevaluasi pelaksanaan zakat fitrah di lingkungan masyarakat.\n\nTujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan waktu zakat fitrah",
      "Peserta didik mampu menghafal dalil zakat fitrah",
      "Peserta didik mampu mengevaluasi dan memberikan rekomendasi perbaikan pelaksanaan zakat fitrah di masyarakat",
      "Peserta didik mampu menuliskan contoh zakat fitrah",
      "Peserta didik mampu menjelaskan hikmah zakat fitrah"
    ],
    "a": 2
  },
  {
    "q": "Guru memberikan tugas refleksi tentang pengalaman peserta didik atau lingkungan dalam menunaikan zakat fitrah.\n\nTujuan pembelajaran ranah sikap yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian zakat fitrah",
      "Peserta didik mampu menghafal dalil zakat fitrah",
      "Peserta didik menunjukkan sikap peduli dan empati terhadap kaum duafa melalui zakat fitrah",
      "Peserta didik mampu menuliskan waktu zakat fitrah",
      "Peserta didik mampu menjelaskan syarat wajib zakat fitrah"
    ],
    "a": 2
  },
  {
    "q": "Pada akhir pembelajaran zakat fitrah, guru mengajak peserta didik menyimpulkan peran zakat fitrah dalam membangun solidaritas sosial.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menghafal hikmah zakat fitrah",
      "Peserta didik mampu menyebutkan pengertian zakat fitrah",
      "Peserta didik mampu menganalisis peran zakat fitrah dalam memperkuat solidaritas sosial masyarakat",
      "Peserta didik mampu menuliskan dalil zakat fitrah",
      "Peserta didik mampu menyebutkan waktu zakat fitrah"
    ],
    "a": 2
  },
  {
    "q": "Guru menjelaskan bahwa zakat mal tidak hanya terbatas pada emas dan perak, tetapi juga mencakup harta perdagangan.\n\nPeserta didik diminta memahami ketentuan zakat perdagangan agar dapat menerapkannya dengan benar.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian zakat mal",
      "Peserta didik mampu menghafal dalil zakat perdagangan",
      "Peserta didik mampu menganalisis ketentuan zakat perdagangan berdasarkan syariat Islam",
      "Peserta didik mampu menuliskan contoh zakat fitrah",
      "Peserta didik mampu menyebutkan jenis-jenis zakat"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran fikih, guru memberikan contoh perhitungan zakat perdagangan dari sebuah usaha kecil.\n\nPeserta didik diminta melakukan perhitungan berdasarkan contoh tersebut.\n\nTujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan syarat wajib zakat",
      "Peserta didik mampu menghafal dalil zakat perdagangan",
      "Peserta didik mampu menghitung zakat perdagangan sesuai ketentuan yang berlaku",
      "Peserta didik mampu menuliskan pengertian zakat perdagangan",
      "Peserta didik mampu menjelaskan hikmah zakat"
    ],
    "a": 2
  },
  {
    "q": "Guru menjelaskan perbedaan pendapat ulama tentang zakat atas saham dan investasi modern.\n\nPeserta didik diminta memahami perbedaan tersebut agar bersikap bijak dalam menyikapinya.\n\nTujuan pembelajaran ranah sikap yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menghafal pendapat ulama",
      "Peserta didik mampu menyebutkan jenis investasi",
      "Peserta didik menunjukkan sikap toleran dan terbuka terhadap perbedaan pendapat ulama terkait zakat investasi",
      "Peserta didik mampu menuliskan dalil zakat saham",
      "Peserta didik mampu menjelaskan pengertian zakat"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran fikih kontemporer, guru mengajak peserta didik membahas zakat pada penghasilan digital dan ekonomi kreatif.\n\nPeserta didik diminta mengaitkan konsep zakat dengan perkembangan ekonomi modern.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan jenis-jenis pekerjaan",
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik mampu menganalisis penerapan zakat pada penghasilan digital dan ekonomi kreatif",
      "Peserta didik mampu menuliskan contoh zakat fitrah",
      "Peserta didik mampu menjelaskan pengertian zakat"
    ],
    "a": 2
  },
  {
    "q": "Guru memberikan tugas proyek kepada peserta didik untuk merancang simulasi pembayaran zakat dari berbagai jenis harta.\n\nTujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan jenis-jenis zakat",
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik mampu merancang dan mempraktikkan simulasi pembayaran zakat dari berbagai jenis harta",
      "Peserta didik mampu menuliskan pengertian zakat",
      "Peserta didik mampu menjelaskan hikmah zakat"
    ],
    "a": 2
  },
  {
    "q": "Guru menekankan pentingnya peran zakat dalam mengurangi kesenjangan sosial.\n\nPeserta didik diminta mengaitkan materi tersebut dengan kondisi sosial di Indonesia.\n\nTujuan pembelajaran ranah sikap yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian zakat",
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik menunjukkan kepedulian sosial dan semangat berbagi sebagai wujud pengamalan zakat",
      "Peserta didik mampu menuliskan jenis-jenis zakat",
      "Peserta didik mampu menjelaskan syarat wajib zakat"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran fikih, guru mengajak peserta didik menganalisis kasus penyalahgunaan dana zakat.\n\nPeserta didik diminta menilai kasus tersebut dari sudut pandang hukum Islam.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan tugas amil zakat",
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik mampu menganalisis hukum penyalahgunaan dana zakat menurut syariat Islam",
      "Peserta didik mampu menuliskan contoh zakat",
      "Peserta didik mampu menjelaskan pengertian zakat"
    ],
    "a": 2
  },
  {
    "q": "Guru memberikan tugas refleksi kepada peserta didik terkait pentingnya transparansi dalam pengelolaan zakat.\n\nTujuan pembelajaran ranah sikap yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian transparansi",
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik menunjukkan sikap jujur, amanah, dan mendukung transparansi dalam pengelolaan zakat",
      "Peserta didik mampu menuliskan contoh zakat",
      "Peserta didik mampu menjelaskan tugas amil zakat"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran fikih, guru mengajak peserta didik menilai efektivitas pengelolaan zakat di lingkungan sekitar.\n\nTujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan lembaga zakat",
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik mampu mengevaluasi efektivitas pengelolaan zakat dan memberikan rekomendasi perbaikan",
      "Peserta didik mampu menuliskan jenis-jenis zakat",
      "Peserta didik mampu menjelaskan pengertian zakat"
    ],
    "a": 2
  },
  {
    "q": "Pada penutup materi zakat mal, guru mengajak peserta didik menyimpulkan peran zakat dalam pembangunan ekonomi umat.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menghafal hikmah zakat",
      "Peserta didik mampu menyebutkan pengertian zakat",
      "Peserta didik mampu menganalisis peran zakat mal dalam pembangunan ekonomi umat",
      "Peserta didik mampu menuliskan dalil zakat",
      "Peserta didik mampu menyebutkan jenis-jenis zakat"
    ],
    "a": 2
  },
  {
    "q": "Guru menjelaskan bahwa zakat mal memiliki dampak jangka panjang bagi kesejahteraan umat jika dikelola secara produktif.\n\nPeserta didik diminta memahami konsep zakat produktif dalam perspektif fikih.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian zakat mal",
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik mampu menganalisis konsep zakat produktif dan manfaatnya bagi kesejahteraan umat",
      "Peserta didik mampu menuliskan contoh zakat fitrah",
      "Peserta didik mampu menyebutkan jenis-jenis zakat"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran fikih, guru menugaskan peserta didik untuk mengkaji praktik zakat produktif yang dilakukan oleh lembaga zakat.\n\nTujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan lembaga zakat",
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik mampu mengkaji dan menyajikan hasil analisis praktik zakat produktif di lembaga zakat",
      "Peserta didik mampu menuliskan pengertian zakat",
      "Peserta didik mampu menjelaskan hikmah zakat"
    ],
    "a": 2
  },
  {
    "q": "Guru menekankan bahwa zakat merupakan sarana penyucian harta dan jiwa.\n\nPeserta didik diminta mengaitkan pemahaman tersebut dengan sikap dalam kehidupan sehari-hari.\n\nTujuan pembelajaran ranah sikap yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian zakat",
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik menunjukkan sikap ikhlas, bersih hati, dan bertanggung jawab dalam menunaikan zakat",
      "Peserta didik mampu menuliskan jenis-jenis zakat",
      "Peserta didik mampu menjelaskan syarat wajib zakat"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran fikih, guru mengangkat kasus seseorang yang enggan membayar zakat meskipun telah memenuhi syarat.\n\nPeserta didik diminta menilai kasus tersebut berdasarkan hukum Islam.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian zakat",
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik mampu menganalisis hukum orang yang enggan membayar zakat meskipun telah memenuhi syarat",
      "Peserta didik mampu menuliskan contoh zakat",
      "Peserta didik mampu menyebutkan syarat wajib zakat"
    ],
    "a": 2
  },
  {
    "q": "Guru mengajak peserta didik berdiskusi tentang peran negara dalam pengelolaan zakat.\n\nPeserta didik diminta memahami hubungan antara kebijakan negara dan hukum fikih zakat.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan lembaga negara",
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik mampu menganalisis peran negara dalam pengelolaan zakat menurut perspektif fikih",
      "Peserta didik mampu menuliskan jenis-jenis zakat",
      "Peserta didik mampu menjelaskan pengertian zakat"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran fikih kontemporer, guru menekankan pentingnya literasi zakat di kalangan generasi muda.\n\nTujuan pembelajaran ranah sikap yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian literasi zakat",
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik menunjukkan kesadaran dan kepedulian untuk memahami serta menyebarkan pengetahuan tentang zakat",
      "Peserta didik mampu menuliskan jenis-jenis zakat",
      "Peserta didik mampu menjelaskan hikmah zakat"
    ],
    "a": 2
  },
  {
    "q": "Guru memberikan tugas kepada peserta didik untuk membuat kampanye sederhana tentang pentingnya zakat.\n\nTujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian zakat",
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik mampu merancang dan menyajikan kampanye edukatif tentang pentingnya zakat",
      "Peserta didik mampu menuliskan jenis-jenis zakat",
      "Peserta didik mampu menjelaskan syarat wajib zakat"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran fikih, guru menanamkan nilai tanggung jawab sosial melalui pemahaman zakat.\n\nTujuan pembelajaran ranah sikap yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan pengertian tanggung jawab",
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik menunjukkan sikap tanggung jawab sosial dan kepedulian terhadap kesejahteraan umat",
      "Peserta didik mampu menuliskan contoh zakat",
      "Peserta didik mampu menjelaskan pengertian zakat"
    ],
    "a": 2
  },
  {
    "q": "Guru mengajak peserta didik melakukan evaluasi menyeluruh terhadap pembelajaran zakat yang telah dipelajari.\n\nTujuan pembelajaran ranah keterampilan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menyebutkan materi zakat",
      "Peserta didik mampu menghafal dalil zakat",
      "Peserta didik mampu mengevaluasi pemahaman dan penerapan materi zakat dalam kehidupan sehari-hari",
      "Peserta didik mampu menuliskan jenis-jenis zakat",
      "Peserta didik mampu menjelaskan hikmah zakat"
    ],
    "a": 2
  },
  {
    "q": "Pada akhir rangkaian pembelajaran fikih tentang zakat, guru mengajak peserta didik menyimpulkan makna zakat bagi kehidupan pribadi dan sosial.\n\nTujuan pembelajaran ranah pengetahuan yang paling tepat adalah …",
    "o": [
      "Peserta didik mampu menghafal hikmah zakat",
      "Peserta didik mampu menyebutkan pengertian zakat",
      "Peserta didik mampu menganalisis makna zakat bagi kehidupan pribadi dan sosial",
      "Peserta didik mampu menuliskan dalil zakat",
      "Peserta didik mampu menyebutkan jenis-jenis zakat"
    ],
    "a": 2
  }
]
