[
  {
    "q": "Dalam pembelajaran zakat hasil tanah yang disewakan, guru ingin mendorong siswa untuk menyadari pentingnya zakat sebagai bentuk tanggung jawab sosial dan meningkatkan rasa kepedulian terhadap sesama. Tujuan pembelajaran yang dirumuskan harus mampu mendorong siswa untuk lebih taat beragama dan berakhlak mulia dalam kehidupan sehari-hari. Manakah dari rumusan tujuan pembelajaran berikut yang paling tepat untuk mencapai tujuan tersebut?",
    "o": [
      "Siswa dapat menjelaskan tentang jenis-jenis zakat yang wajib dikeluarkan",
      "Siswa dapat memahami dan menerapkan kewajiban zakat pada hasil tanah yang disewakan",
      "Siswa dapat menghitung zakat yang harus dikeluarkan dari hasil pertanian yang disewakan",
      "Siswa dapat berempati terhadap masyarakat yang membutuhkan zakat",
      "Siswa dapat menunjukkan sikap taat dalam menjalankan kewajiban zakat sesuai syariat"
    ],
    "a": 4
  },
  {
    "q": "Guru ingin agar siswa mampu mengembangkan pemikiran kritis terkait zakat profesi dan zakat produktif, khususnya mengenai apakah zakat profesi berbeda dengan zakat harta biasa dan bagaimana zakat produktif bisa meningkatkan kesejahteraan masyarakat. Manakah dari tujuan pembelajaran berikut yang paling tepat untuk mencapai tujuan berpikir kritis?",
    "o": [
      "Siswa dapat menjelaskan perbedaan antara zakat profesi dan zakat harta biasa",
      "Siswa dapat menghitung zakat yang harus dikeluarkan dari hasil profesi",
      "Siswa dapat menganalisis dampak zakat profesi dan zakat produktif terhadap masyarakat",
      "Siswa dapat memberikan contoh penerapan zakat produktif di masyarakat",
      "Siswa dapat menyebutkan jenis-jenis profesi yang dikenakan zakat"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran penyaluran zakat untuk pembangunan masjid, guru ingin menumbuhkan semangat gotong royong di antara siswa dengan cara memberikan pemahaman tentang pentingnya peran zakat dalam pembangunan fasilitas umum seperti masjid. Manakah dari rumusan tujuan pembelajaran berikut yang paling tepat untuk mencapai tujuan tersebut?",
    "o": [
      "Siswa dapat menjelaskan tujuan penyaluran zakat untuk pembangunan masjid",
      "Siswa dapat mengidentifikasi sumber zakat yang dapat digunakan untuk pembangunan masjid",
      "Siswa dapat menunjukkan sikap bersemangat dalam membantu pembangunan masjid",
      "Siswa dapat mendiskusikan manfaat pembangunan masjid dengan zakat",
      "Siswa dapat menyebutkan jenis-jenis zakat yang disalurkan untuk masjid"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran tentang monogami, poligami, atau nikah mut’ah, guru ingin agar siswa dapat menerima perbedaan tradisi dan budaya dalam konteks kehidupan berkeluarga, tanpa menghakimi atau menganggap salah pandangan yang berbeda. Manakah dari rumusan tujuan pembelajaran berikut yang paling tepat untuk mencapai tujuan tersebut?",
    "o": [
      "Siswa dapat memahami hukum-hukum yang mengatur monogami dan poligami dalam Islam",
      "Siswa dapat mengidentifikasi dampak positif dan negatif dari monogami dan poligami",
      "Siswa dapat menunjukkan sikap penerimaan terhadap perbedaan tradisi dalam pernikahan",
      "Siswa dapat menceritakan pengalaman pribadi tentang monogami atau poligami",
      "Siswa dapat menjelaskan alasan dibolehkannya poligami dalam Islam"
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran materi tentang bank, rente, dan fee, guru ingin mengembangkan kemampuan siswa untuk berpikir kritis dan kreatif dalam memahami konsep-konsep ekonomi, serta mampu menerapkan prinsip-prinsip tersebut dalam kehidupan sehari-hari. Manakah dari rumusan tujuan pembelajaran berikut yang paling tepat untuk mencapai tujuan tersebut?",
    "o": [
      "Siswa dapat menjelaskan perbedaan antara bank syariah dan bank konvensional",
      "Siswa dapat menghitung bunga dan fee yang dikenakan oleh bank",
      "Siswa dapat menganalisis konsep rente dan fee dalam konteks ekonomi modern",
      "Siswa dapat mendiskusikan dampak ekonomi dari sistem bunga dalam bank",
      "Siswa dapat menyebutkan jenis-jenis bank yang ada di Indonesia"
    ],
    "a": 2
  },
  {
    "q": "Dalam perencanaan pembelajaran zakat hasil tanah yang disewakan menggunakan pendekatan Project Based Learning (PBL), guru ingin agar siswa dapat memahami konsep zakat dengan cara yang terstruktur dan relevan dengan kehidupan mereka. Manakah dari rumusan tujuan pembelajaran berikut yang paling tepat untuk mencapai tujuan tersebut?",
    "o": [
      "Siswa dapat menjelaskan konsep zakat hasil tanah yang disewakan",
      "Siswa dapat mengidentifikasi jenis-jenis zakat yang relevan dengan profesi mereka",
      "Siswa dapat menghubungkan penerapan zakat hasil tanah yang disewakan dengan kehidupan nyata",
      "Siswa dapat membuat proyek berbasis zakat hasil tanah yang disewakan",
      "Siswa dapat mendiskusikan keuntungan dan kerugian dalam pengelolaan zakat hasil tanah yang disewakan"
    ],
    "a": 2
  },
  {
    "q": "Dalam pelaksanaan tujuan pembelajaran zakat profesi atau zakat produktif dengan pendekatan Project Based Learning (PjBL), guru mengharapkan siswa dapat menerapkan pemahaman mereka terhadap zakat profesi dalam proyek nyata, seperti membuat proposal zakat produktif yang dapat diterapkan di masyarakat. Manakah dari tujuan pembelajaran berikut yang paling tepat untuk mencapai tujuan tersebut?",
    "o": [
      "Siswa dapat menjelaskan dasar hukum zakat profesi",
      "Siswa dapat merancang proyek zakat produktif untuk meningkatkan kesejahteraan masyarakat",
      "Siswa dapat mendiskusikan manfaat zakat profesi dalam konteks ekonomi",
      "Siswa dapat mengidentifikasi profesi yang wajib dikenakan zakat",
      "Siswa dapat membandingkan zakat profesi dan zakat mal"
    ],
    "a": 1
  },
  {
    "q": "Guru melakukan evaluasi terhadap pembelajaran materi penyaluran zakat untuk pembangunan masjid dengan pendekatan Discovery-Based Learning (DBL). Guru ingin agar siswa dapat mengidentifikasi peran zakat dalam pembangunan fasilitas umum seperti masjid, serta bagaimana peran mereka sebagai generasi penerus dalam menyalurkan zakat tersebut. Manakah dari tujuan pembelajaran berikut yang paling tepat untuk evaluasi tersebut?",
    "o": [
      "Siswa dapat mengidentifikasi peran zakat dalam pembangunan masjid",
      "Siswa dapat menghitung jumlah zakat yang disalurkan untuk pembangunan masjid",
      "Siswa dapat mendiskusikan pentingnya masjid sebagai fasilitas umum dalam masyarakat",
      "Siswa dapat merencanakan penyaluran zakat untuk pembangunan masjid di daerah mereka",
      "Siswa dapat mengidentifikasi faktor-faktor yang memengaruhi penyaluran zakat untuk masjid"
    ],
    "a": 0
  },
  {
    "q": "Guru merencanakan materi ajar tentang monogami, poligami, dan nikah mut’ah dengan pendekatan TPACK (Technological, Pedagogical, and Content Knowledge). Guru ingin memadukan penggunaan teknologi, pendekatan pedagogis yang tepat, dan konten materi untuk menciptakan pemahaman yang mendalam pada siswa tentang pernikahan dalam perspektif Islam. Manakah dari alur materi ajar berikut yang paling tepat untuk mencapai tujuan tersebut?",
    "o": [
      "Siswa memulai dengan mempelajari sejarah hukum pernikahan, lalu menyimak video dokumenter tentang poligami",
      "Siswa mendiskusikan pro-kontra monogami dan poligami dengan menggunakan sumber digital, kemudian menyusun laporan",
      "Siswa menonton video pembelajaran tentang nikah mut'ah dan menyusun ringkasan materi yang telah dipelajari",
      "Siswa menjelaskan hukum pernikahan dalam Islam menggunakan presentasi multimedia, kemudian berdiskusi secara langsung",
      "Siswa mengidentifikasi perbedaan antara monogami dan poligami dengan menggunakan aplikasi kuis interaktif"
    ],
    "a": 1
  },
  {
    "q": "Dalam pelaksanaan materi ajar tentang bank, rente, atau fee dengan pendekatan Direct Learning (DL), guru ingin memastikan bahwa siswa memahami konsep-konsep ekonomi dengan cara yang sederhana dan mudah dipahami, serta dapat mengaplikasikan pengetahuan tersebut dalam kehidupan sehari-hari. Manakah dari alur materi ajar berikut yang paling tepat untuk pelaksanaan tujuan pembelajaran tersebut?",
    "o": [
      "Siswa memulai dengan menjelaskan konsep dasar bank, lalu melakukan studi kasus tentang sistem bunga di bank",
      "Siswa mendengarkan ceramah tentang rente, kemudian berdiskusi tentang penerapannya dalam masyarakat",
      "Siswa mempelajari teori tentang bank syariah dan konvensional, lalu mengerjakan soal-soal praktis",
      "Siswa melakukan eksperimen tentang sistem bunga bank, kemudian menganalisis hasilnya",
      "Siswa menonton video tentang bank dan rente, lalu mengidentifikasi perbedaan antara keduanya dalam kelompok"
    ],
    "a": 0
  },
  {
    "q": "Dalam pelaksanaan materi ajar tentang pemerintahan dalam Islam, guru menggunakan model pelayanan konseling untuk membantu siswa memahami konsep-konsep pemerintahan Islam, termasuk prinsip-prinsip dasar sistem pemerintahan dalam Islam, serta mengaitkannya dengan kehidupan sosial mereka. Manakah dari alur materi ajar berikut yang paling tepat untuk mengevaluasi tujuan pembelajaran tersebut?",
    "o": [
      "Siswa memulai dengan diskusi tentang sejarah pemerintahan Islam, lalu mengerjakan soal terkait sistem pemerintahan",
      "Siswa berdiskusi tentang prinsip-prinsip pemerintahan dalam Islam, kemudian melakukan wawancara dengan pemimpin masyarakat",
      "Siswa mempelajari teori pemerintahan Islam, lalu menganalisis implementasinya dalam konteks pemerintahan modern",
      "Siswa menonton video tentang sistem pemerintahan Islam, lalu merancang model pemerintahan ideal berdasarkan ajaran Islam",
      "Siswa berdiskusi tentang contoh pemerintahan dalam Islam, lalu menilai relevansi sistem tersebut dengan kehidupan sosial saat ini"
    ],
    "a": 4
  },
  {
    "q": "Dalam perencanaan tujuan pembelajaran program penguatan profil pelajar Pancasila (P5), guru ingin mengembangkan materi ajar yang dapat mendorong siswa untuk menerapkan nilai-nilai Pancasila dalam kehidupan sehari-hari, baik di sekolah maupun di masyarakat. Manakah dari rumusan tujuan pembelajaran berikut yang paling tepat untuk mencapai tujuan tersebut?",
    "o": [
      "Siswa dapat memahami sejarah Pancasila sebagai dasar negara Indonesia",
      "Siswa dapat menjelaskan lima sila dalam Pancasila dan bagaimana sila-sila tersebut diterapkan dalam kehidupan sehari-hari",
      "Siswa dapat mendiskusikan pentingnya Pancasila dalam menjaga keharmonisan sosial",
      "Siswa dapat menunjukkan sikap toleransi terhadap perbedaan berdasarkan nilai Pancasila",
      "Siswa dapat membuat proyek berbasis nilai-nilai Pancasila dalam masyarakat"
    ],
    "a": 1
  },
  {
    "q": "Dalam pelaksanaan program Penguatan Profil Pelajar Rahmatan Lil Alamin (PPRA), guru ingin memastikan siswa menginternalisasi nilai-nilai Islam yang membawa rahmat bagi seluruh alam, serta dapat mengaplikasikan nilai-nilai tersebut dalam kehidupan sehari-hari dengan berorientasi pada kedamaian dan kesejahteraan umat manusia. Manakah dari rumusan tujuan pembelajaran berikut yang paling tepat untuk mencapai tujuan tersebut?",
    "o": [
      "Siswa dapat memahami makna rahmatan lil alamin dalam perspektif Islam",
      "Siswa dapat menjelaskan cara-cara membawa rahmat bagi umat manusia berdasarkan ajaran Islam",
      "Siswa dapat mengidentifikasi peran mereka dalam menciptakan kedamaian dan kesejahteraan di masyarakat",
      "Siswa dapat menunjukkan sikap kasih sayang terhadap sesama dalam kehidupan sehari-hari",
      "Siswa dapat mendiskusikan implementasi nilai rahmatan lil alamin dalam kehidupan sosial"
    ],
    "a": 2
  },
  {
    "q": "Dalam pelaksanaan pembelajaran tentang moderasi beragama, guru ingin menumbuhkan pemahaman pada siswa mengenai nilai-nilai Islam yang moderat (wasathiyah) serta bagaimana mengimplementasikan prinsip-prinsip tersebut dalam kehidupan sehari-hari untuk mencegah radikalisasi dan intoleransi. Manakah dari rumusan tujuan pembelajaran berikut yang paling tepat untuk mencapai tujuan tersebut?",
    "o": [
      "Siswa dapat menjelaskan konsep moderasi beragama dalam Islam dan penerapannya dalam kehidupan sosial",
      "Siswa dapat menunjukkan sikap toleransi terhadap perbedaan agama berdasarkan ajaran Islam",
      "Siswa dapat membandingkan ajaran Islam moderat dengan paham ekstremisme agama",
      "Siswa dapat membuat proyek untuk mempromosikan moderasi beragama di lingkungan sekolah",
      "Siswa dapat mengidentifikasi dampak negatif dari intoleransi agama dalam masyarakat"
    ],
    "a": 0
  },
  {
    "q": "Guru mengajarkan tentang pentingnya moderasi beragama dalam konteks ajaran Islam yang wasathiyah. Dalam proses pembelajaran, guru ingin siswa dapat memahami dan menginternalisasi pentingnya nilai-nilai moderasi sebagai bagian dari ajaran Islam yang sesuai dengan tuntutan zaman. Manakah dari penilaian berikut yang paling tepat untuk mengembangkan materi ajar tentang moderasi beragama dalam Islam?",
    "o": [
      "Siswa dapat menjelaskan alasan moderasi beragama diterima dalam ajaran Islam sebagai solusi bagi tantangan zaman",
      "Siswa dapat mengidentifikasi peran moderasi beragama dalam menjaga kerukunan antar umat beragama",
      "Siswa dapat menyebutkan contoh nyata moderasi beragama dalam sejarah Islam",
      "Siswa dapat membuat analisis tentang kontribusi moderasi beragama terhadap perdamaian dunia",
      "Siswa dapat menyebutkan dalil-dalil yang mendasari ajaran Islam sebagai agama moderat"
    ],
    "a": 0
  },
  {
    "q": "Dalam penerapan pembelajaran zakat hasil tanah yang disewakan, guru menggunakan pendekatan Pembelajaran Berbasis Masalah (PBM) untuk mengajak siswa memecahkan masalah nyata terkait dengan perhitungan zakat atas tanah yang disewakan. Materi ini disusun berdasarkan prinsip-prinsip keilmuan yang ada dalam ekonomi Islam. Manakah rancangan pembelajaran berikut yang paling sesuai untuk penerapan PBM dalam materi zakat hasil tanah yang disewakan?",
    "o": [
      "Siswa diberikan tugas untuk menghitung zakat atas hasil tanah yang disewakan dengan menggunakan data nyata",
      "Siswa mendiskusikan dampak sosial dari zakat hasil tanah yang disewakan dalam konteks ekonomi Islam",
      "Siswa membuat proyek tentang distribusi zakat untuk pembangunan sosial berbasis tanah yang disewakan",
      "Siswa mempelajari teori dasar zakat dalam Islam, lalu mengerjakan soal-soal terkait",
      "Siswa melakukan wawancara dengan ahli zakat untuk memahami penerapan zakat dalam masyarakat"
    ],
    "a": 0
  },
  {
    "q": "Guru ingin menerapkan pendekatan Pembelajaran Berbasis Masalah (PBM) untuk materi zakat hasil tanah yang disewakan, dengan memperhatikan aspek pedagogik yang relevan, seperti kemampuan siswa dalam memahami konsep dan memecahkan masalah. Pembelajaran ini harus disesuaikan dengan pengetahuan pedagogik yang dimiliki siswa. Manakah dari rancangan pembelajaran berikut yang paling sesuai dengan pengetahuan pedagogik untuk penerapan PBM dalam materi zakat hasil tanah yang disewakan?",
    "o": [
      "Siswa diminta untuk bekerja dalam kelompok untuk menyelesaikan studi kasus tentang zakat atas tanah sewaan",
      "Siswa diberi penjelasan teori dasar zakat dalam Islam, lalu diberikan soal-soal untuk dikerjakan sendiri",
      "Siswa melakukan presentasi tentang zakat hasil tanah sewaan di hadapan kelas",
      "Siswa membuat proyek perhitungan zakat dengan menggunakan teknologi dalam kelompok",
      "Siswa diberi ceramah tentang zakat dan kemudian diminta untuk menulis esai"
    ],
    "a": 0
  },
  {
    "q": "Guru merancang pembelajaran zakat profesi atau zakat produktif dengan pendekatan Pembelajaran Berbasis Masalah (PBM) yang mengintegrasikan penggunaan teknologi untuk membantu siswa memahami konsep-konsep terkait zakat profesi dan produktif. Manakah rancangan pembelajaran yang paling sesuai dengan penggunaan teknologi dalam pembelajaran zakat profesi atau zakat produktif?",
    "o": [
      "Siswa menggunakan aplikasi untuk menghitung zakat profesi dan zakat produktif berdasarkan data yang diberikan",
      "Siswa mempresentasikan hasil perhitungan zakat dengan menggunakan alat bantu visual seperti proyektor",
      "Siswa mempelajari teori zakat produktif melalui artikel yang dipublikasikan di website resmi",
      "Siswa membuat blog atau website yang mengedukasi tentang zakat profesi dan produktif",
      "Siswa menggunakan perangkat lunak untuk membuat grafik distribusi zakat berdasarkan profesi mereka"
    ],
    "a": 0
  },
  {
    "q": "Guru menerapkan pendekatan Pembelajaran Berbasis Masalah (PBM) untuk materi zakat profesi atau zakat produktif, dengan mempertimbangkan perbedaan individu siswa. Setiap siswa diberikan tugas yang disesuaikan dengan minat dan kemampuan mereka dalam memahami zakat dalam konteks profesi. Manakah dari rancangan pembelajaran berikut yang paling sesuai untuk mengakomodasi perbedaan individu siswa dalam pembelajaran zakat profesi atau zakat produktif?",
    "o": [
      "Siswa diberikan tugas untuk menyusun laporan tentang zakat profesi berdasarkan pekerjaan yang mereka pilih",
      "Siswa diberikan soal-soal yang sama dan diminta untuk menyelesaikannya dalam waktu yang sama",
      "Siswa diberi ceramah tentang zakat profesi, kemudian diminta untuk menulis esai tentang pengaruh zakat terhadap ekonomi",
      "Siswa mempresentasikan hasil penelitian mereka tentang zakat profesi berdasarkan tema yang sudah ditentukan",
      "Siswa melakukan diskusi kelompok untuk menyelesaikan perhitungan zakat atas pendapatan mereka"
    ],
    "a": 0
  },
  {
    "q": "Dalam penerapan pembelajaran tentang penyaluran zakat untuk pembangunan masjid, guru ingin mengadaptasi pembelajaran berbasis masalah yang sesuai dengan pengetahuan pedagogik siswa, dengan mempertimbangkan perbedaan individu dalam hal pemahaman dan minat terhadap topik tersebut. Manakah rancangan pembelajaran yang paling sesuai untuk mengakomodasi perbedaan individu siswa dalam penyaluran zakat untuk pembangunan masjid?",
    "o": [
      "Siswa diminta untuk membuat presentasi tentang cara menyalurkan zakat untuk pembangunan masjid berdasarkan penelitian mereka",
      "Siswa diberi soal-soal yang berkaitan dengan zakat, kemudian mendiskusikannya dalam kelompok",
      "Siswa melakukan wawancara dengan ahli zakat mengenai penyaluran zakat untuk masjid",
      "Siswa diberikan tugas untuk merancang proyek sosial tentang pembangunan masjid dengan zakat",
      "Siswa mempelajari teori dasar zakat, lalu menulis esai tentang penyaluran zakat untuk masjid"
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran tentang monogami, poligami, dan nikah mut'ah, guru mengadaptasi pendekatan berbasis perbedaan individu dengan memanfaatkan teknologi untuk memfasilitasi pemahaman siswa yang beragam. Setiap siswa diberi materi yang disesuaikan dengan kebutuhan dan tingkat pemahaman mereka mengenai topik ini. Manakah rancangan pembelajaran berikut yang paling sesuai untuk mengakomodasi perbedaan individu dalam pembelajaran materi monogami, poligami, dan nikah mut’ah dengan memanfaatkan teknologi?",
    "o": [
      "Siswa menggunakan aplikasi pembelajaran untuk membaca artikel tentang monogami, poligami, dan nikah mut'ah dan membuat ringkasan",
      "Siswa diberi tugas untuk membuat video penjelasan tentang monogami dan poligami berdasarkan perspektif mereka sendiri",
      "Siswa mengikuti forum diskusi daring untuk membahas topik monogami dan poligami dengan menggunakan platform pembelajaran",
      "Siswa memanfaatkan perangkat teknologi untuk membuat infografis yang menggambarkan perbedaan antara monogami, poligami, dan nikah mut'ah",
      "Siswa menonton video pembelajaran interaktif tentang nikah mut'ah dan membuat catatan tentang poin-poin utama"
    ],
    "a": 3
  },
  {
    "q": "Dalam pembelajaran tentang bank, rente, dan fee, guru ingin mengajak siswa untuk mengeksplorasi topik ini secara mendalam dengan menganalisis praktik bank dan penerapan prinsip ekonomi Islam dalam hal rente dan fee. Pembelajaran ini menggunakan pendekatan yang memotivasi siswa untuk menyelami topik secara kritis. Manakah rancangan pembelajaran berikut yang paling sesuai dengan pendekatan pembelajaran mendalam dalam materi bank, rente, dan fee?",
    "o": [
      "Siswa membaca artikel tentang bank dan rente, kemudian membuat analisis tentang penerapan sistem rente dalam Islam",
      "Siswa diberi tugas untuk membuat laporan mengenai perbandingan bank konvensional dan bank syariah",
      "Siswa mendiskusikan perbedaan antara rente dan fee dalam kelompok, lalu menyusun presentasi",
      "Siswa membuat studi kasus tentang dampak rente dalam ekonomi masyarakat dan menyimpulkan kesimpulannya",
      "Siswa mempelajari teori dasar tentang bank dan rente, kemudian menulis esai tentang aplikasinya dalam kehidupan sehari-hari"
    ],
    "a": 0
  },
  {
    "q": "Guru ingin memfasilitasi pembelajaran mendalam tentang pemerintahan dalam Islam dengan pendekatan yang memerlukan pemahaman teoritis dan aplikatif. Siswa diharapkan bisa menganalisis berbagai konsep pemerintahan Islam serta bagaimana penerapannya dalam konteks sosial saat ini. Manakah rancangan pembelajaran berikut yang paling sesuai dengan pendekatan pembelajaran mendalam berdasarkan pengetahuan pedagogi dalam materi pemerintahan dalam Islam?",
    "o": [
      "Siswa membaca teks klasik tentang pemerintahan Islam, lalu mengkritisi penerapannya dalam sejarah Islam",
      "Siswa membuat proyek kelompok tentang sistem pemerintahan dalam Islam dan mempresentasikannya",
      "Siswa mempelajari teori pemerintahan Islam dan melakukan wawancara dengan pakar dalam bidang pemerintahan Islam",
      "Siswa berdiskusi tentang berbagai model pemerintahan dalam Islam dan mengaitkannya dengan kondisi sosial politik saat ini",
      "Siswa menonton video pembelajaran tentang sejarah pemerintahan Islam dan menulis refleksi tentang topik tersebut"
    ],
    "a": 3
  },
  {
    "q": "Dalam pembelajaran pendidikan karakter atau nilai, guru ingin menggunakan teknologi untuk membantu siswa lebih mendalami topik ini. Teknologi digunakan untuk memperkaya sumber daya yang dapat digunakan siswa dalam mempelajari dan menginternalisasi nilai-nilai karakter. Manakah rancangan pembelajaran berikut yang paling sesuai dengan pendekatan pembelajaran mendalam menggunakan teknologi dalam materi pendidikan karakter atau nilai?",
    "o": [
      "Siswa membuat blog yang berisi tentang nilai-nilai karakter dan pendidikan moral dalam masyarakat",
      "Siswa menggunakan aplikasi pendidikan untuk mengeksplorasi berbagai nilai karakter dan berbagi pengalaman mereka melalui forum online",
      "Siswa menonton video dokumenter tentang tokoh yang menunjukkan nilai karakter, kemudian mendiskusikan kontennya secara daring",
      "Siswa membaca artikel tentang pendidikan karakter, lalu menulis refleksi pribadi tentang nilai yang mereka pelajari",
      "Siswa membuat infografis yang menggambarkan pentingnya pendidikan karakter dalam kehidupan sehari-hari"
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran tentang moderasi beragama di Indonesia, guru ingin mengintegrasikan teknologi, pedagogi, dan konten untuk menyampaikan topik ini dengan cara yang interaktif dan mendalam. Siswa diajak untuk memahami konsep moderasi beragama melalui aplikasi teknologi yang mendukung pembelajaran berbasis TPACK. Manakah rancangan pembelajaran berikut yang paling sesuai dengan pendekatan TPACK dalam materi moderasi beragama di Indonesia?",
    "o": [
      "Siswa menggunakan platform pembelajaran untuk menonton video tentang moderasi beragama dan membuat postingan refleksi",
      "Siswa bekerja dalam kelompok untuk menyusun presentasi digital yang membahas moderasi beragama di Indonesia",
      "Siswa memanfaatkan aplikasi untuk menyusun proyek tentang peran moderasi beragama dalam kehidupan berbangsa dan bernegara",
      "Siswa melakukan wawancara virtual dengan tokoh agama untuk menggali pandangan mereka tentang moderasi beragama",
      "Siswa membuat podcast yang membahas tantangan dan peluang moderasi beragama di Indonesia"
    ],
    "a": 2
  },
  {
    "q": "Diberikan kasus penyajian materi zakat hasil tanah yang disewakan yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa diminta untuk menentukan penggunaan strategi pembelajaran berpendekatan PBL guna menciptakan suasana belajar yang aman untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing.",
    "o": [
      "Siswa bekerja dalam kelompok untuk meneliti dampak zakat hasil tanah terhadap pembangunan sosial-ekonomi di masyarakat",
      "Siswa membuat presentasi tentang zakat hasil tanah dengan mengaitkan konsep-konsep modern dalam ekonomi syariah",
      "Siswa mengikuti seminar tentang zakat hasil tanah yang disewakan dan membuat laporan penelitian",
      "Siswa melakukan eksperimen tentang penghitungan zakat hasil tanah dengan menggunakan data dunia nyata",
      "Siswa berdiskusi tentang zakat hasil tanah dengan menggali perspektif sejarah dan sosial terkait"
    ],
    "a": 0
  },
  {
    "q": "Diberikan kasus penyajian materi zakat hasil tanah yang disewakan yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa diminta untuk menentukan penggunaan strategi pembelajaran berpendekatan PjBL guna menciptakan suasana belajar yang nyaman untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing.",
    "o": [
      "Siswa membuat proyek penelitian tentang zakat hasil tanah dan cara distribusinya yang lebih efektif di masa kini",
      "Siswa menyusun proposal untuk mengembangkan program zakat yang inovatif berbasis teknologi di masyarakat",
      "Siswa membuat video dokumentasi tentang sejarah zakat hasil tanah dan pengaruhnya terhadap perekonomian",
      "Siswa melakukan diskusi panel tentang masalah pengelolaan zakat hasil tanah dalam konteks perkembangan zaman",
      "Siswa membuat aplikasi digital untuk menghitung zakat hasil tanah secara otomatis"
    ],
    "a": 1
  },
  {
    "q": "Diberikan kasus penyajian materi zakat profesi atau zakat produktif yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa diminta untuk menentukan penggunaan strategi pembelajaran berpendekatan DBL guna menciptakan suasana belajar yang membahagiakan untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing.",
    "o": [
      "Siswa membuat skenario simulasi tentang zakat profesi dan produktif yang relevan dengan perkembangan ekonomi saat ini",
      "Siswa mencari informasi tentang zakat profesi dan zakat produktif, lalu membuat presentasi tentang penerapan di masyarakat",
      "Siswa mengunjungi organisasi yang mengelola zakat profesi dan produktif dan melaporkan temuan mereka",
      "Siswa mengikuti diskusi terbuka mengenai bagaimana zakat profesi dapat meningkatkan kesejahteraan masyarakat",
      "Siswa melakukan kajian studi kasus tentang tantangan zakat profesi di dunia modern dan solusinya"
    ],
    "a": 0
  },
  {
    "q": "Diberikan kasus penyajian materi zakat profesi atau zakat produktif yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa diminta untuk menentukan penggunaan model pembelajaran berpendekatan DL guna menciptakan suasana belajar yang akomodatif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing.",
    "o": [
      "Siswa mengikuti kuliah daring tentang zakat profesi, kemudian mengerjakan tugas mandiri tentang zakat produktif",
      "Siswa mengakses materi zakat profesi secara online dan mendiskusikannya melalui forum diskusi daring",
      "Siswa mengerjakan tugas proyek tentang zakat profesi dengan menggunakan platform pembelajaran berbasis cloud",
      "Siswa belajar melalui modul online tentang zakat produktif, kemudian membuat refleksi tentang pengaplikasiannya",
      "Siswa menonton video tentang zakat profesi dan produktif, lalu menyusun laporan analisis secara individu"
    ],
    "a": 1
  },
  {
    "q": "Diberikan kasus penyajian materi penyaluran zakat untuk pembangunan masjid yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa diminta untuk menentukan penggunaan model pembelajaran berpendekatan TPACK guna menciptakan suasana belajar yang adaptif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing.",
    "o": [
      "Siswa membuat presentasi digital yang menggambarkan cara penyaluran zakat untuk pembangunan masjid menggunakan teknologi",
      "Siswa membuat video tentang penyaluran zakat untuk pembangunan masjid dan mendiskusikan dampaknya dalam kelas",
      "Siswa mengembangkan aplikasi yang membantu masyarakat memahami penyaluran zakat untuk masjid dengan sistem digital",
      "Siswa menyusun laporan tentang penyaluran zakat menggunakan data yang diperoleh melalui aplikasi",
      "Siswa berdiskusi tentang model penyaluran zakat dan merancang sistem online untuk melacak kontribusi zakat"
    ],
    "a": 2
  },
  {
    "q": "Diberikan kasus penyajian materi monogami, poligami, atau nikah mut’ah yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa diminta untuk menentukan penggunaan model pembelajaran berbasis pelayanan bimbingan konseling guna menciptakan suasana belajar yang progresif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing.",
    "o": [
      "Siswa melakukan sesi bimbingan untuk mengeksplorasi nilai-nilai sosial yang terkait dengan monogami dan poligami",
      "Siswa mendengarkan ceramah mengenai poligami dan nikah mut'ah dari berbagai sudut pandang",
      "Siswa menyusun artikel tentang monogami dan poligami di era modern",
      "Siswa melakukan kegiatan debat tentang kelebihan dan kekurangan monogami dan poligami",
      "Siswa mengunjungi tempat yang mempraktikkan monogami dan poligami untuk wawasan langsung"
    ],
    "a": 0
  },
  {
    "q": "Diberikan kasus penyajian materi bank, rente, atau fee yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa diminta untuk menentukan penggunaan pendekatan pembelajaran berbasis pelayanan ABK guna menciptakan lingkungan belajar yang akomodatif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing.",
    "o": [
      "Siswa diberikan penugasan kelompok untuk membahas perbedaan antara bank syariah dan konvensional",
      "Siswa diberikan materi video interaktif yang menjelaskan konsep bank dan rente dengan cara visual yang mudah dipahami",
      "Siswa melakukan presentasi individu tentang konsep bank, rente, dan fee dalam konteks ekonomi digital",
      "Siswa membaca artikel tentang bank dan rente, kemudian berdiskusi dalam kelompok kecil",
      "Siswa membuat diagram alur yang menggambarkan perbedaan antara bank konvensional dan syariah"
    ],
    "a": 1
  },
  {
    "q": "Diberikan kasus penyajian materi pemerintahan dalam Islam yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa diminta untuk menentukan penggunaan pendekatan pembelajaran yang relevan guna menciptakan lingkungan belajar yang adaptif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing.",
    "o": [
      "Siswa meneliti struktur pemerintahan Islam dalam sejarah dan membandingkannya dengan sistem pemerintahan modern",
      "Siswa mengikuti kuliah tentang sejarah pemerintahan Islam dan mengaitkannya dengan pemerintahan saat ini",
      "Siswa berdiskusi tentang aplikasi nilai-nilai pemerintahan Islam dalam kehidupan modern",
      "Siswa mengadakan simulasi pemilihan umum berdasarkan sistem pemerintahan Islam",
      "Siswa mengerjakan makalah tentang sejarah pemerintahan Islam dengan menggunakan referensi dari sumber digital"
    ],
    "a": 2
  },
  {
    "q": "Diberikan kasus penyajian materi pendidikan nilai dan pendidikan karakter yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa diminta untuk menentukan penggunaan pendekatan pembelajaran yang relevan guna menciptakan lingkungan belajar yang progresif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing.",
    "o": [
      "Siswa mempelajari nilai-nilai karakter melalui simulasi peran yang menggambarkan situasi kehidupan nyata",
      "Siswa membuat karya seni yang menggambarkan nilai-nilai karakter yang mereka pelajari",
      "Siswa menulis jurnal harian untuk merefleksikan nilai-nilai yang diterima selama pembelajaran",
      "Siswa mengikuti ceramah motivasi tentang pendidikan karakter dan nilai-nilai kehidupan",
      "Siswa bekerja dalam kelompok untuk menyusun dan mempresentasikan proyek tentang pendidikan karakter"
    ],
    "a": 0
  },
  {
    "q": "Diberikan kasus penyajian materi implementasi moderasi beragama di Indonesia yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa diminta untuk menentukan penggunaan pendekatan pembelajaran yang relevan guna menciptakan lingkungan belajar yang membahagiakan untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing.",
    "o": [
      "Siswa mengadakan diskusi terbuka tentang moderasi beragama dan saling berbagi pengalaman pribadi",
      "Siswa menyusun proyek kelompok yang menggambarkan penerapan moderasi beragama dalam kehidupan sehari-hari",
      "Siswa menonton video dokumenter tentang moderasi beragama di Indonesia dan mengulasnya",
      "Siswa melakukan kunjungan ke tempat ibadah yang berbeda untuk mengamati praktik moderasi beragama",
      "Siswa membuat poster yang menggambarkan nilai-nilai moderasi beragama di Indonesia"
    ],
    "a": 0
  },
  {
    "q": "Dalam sebuah proyek pembelajaran berbasis masalah (PBL), mahasiswa diminta menganalisis kasus tentang seorang petani yang menyewakan lahannya untuk ditanami padi. Setelah menerima hasil sewa berupa gabah, muncul pertanyaan tentang kewajiban zakat atas hasil tersebut. Dalam konteks ini, teknik asesmen sikap yang paling tepat digunakan dosen untuk menilai kepekaan sosial mahasiswa terhadap pentingnya zakat adalah:",
    "o": [
      "Observasi sikap saat diskusi kelompok",
      "Ujian essay tertulis",
      "Tes pilihan ganda",
      "Lembar kerja proyek",
      "Penilaian produk berbasis karya"
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran dengan pendekatan PjBL, mahasiswa merancang kampanye edukasi tentang zakat hasil tanah yang disewakan. Untuk menilai pengetahuan mahasiswa secara tepat, instrumen asesmen yang sebaiknya digunakan dosen adalah:",
    "o": [
      "Angket sikap",
      "Rubrik observasi keterampilan",
      "Tes lisan (oral test)",
      "Kuis pilihan ganda berbasis kasus",
      "Penilaian proyek berbasis presentasi"
    ],
    "a": 3
  },
  {
    "q": "Dalam pembelajaran berbasis diskusi kelompok (DL), mahasiswa membahas tentang zakat profesi bagi para pekerja freelance. Untuk mengukur keterampilan berargumentasi mahasiswa dalam lingkungan belajar tersebut, teknik asesmen yang paling sesuai adalah:",
    "o": [
      "Ujian essay tertulis",
      "Observasi aktivitas diskusi",
      "Tes objektif",
      "Penilaian portofolio individu",
      "Tes lisan satu arah"
    ],
    "a": 1
  },
  {
    "q": "Dalam kegiatan belajar mandiri, mahasiswa mendalami zakat produktif dan membuat simulasi penyaluran dana zakat untuk modal usaha kecil. Untuk mengukur keterampilan mahasiswa, instrumen asesmen yang paling tepat adalah:",
    "o": [
      "Rubrik penilaian portofolio proyek",
      "Soal pilihan ganda",
      "Daftar cek sikap",
      "Ujian tulis essay",
      "Angket refleksi diri"
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran tentang zakat untuk pembangunan masjid, mahasiswa diminta menyusun rancangan distribusi dana zakat sesuai prinsip syariah. Untuk mengukur pengetahuan mahasiswa sesuai tujuan pembelajaran, teknik asesmen yang tepat adalah:",
    "o": [
      "Observasi kerja kelompok",
      "Tes essay berbasis analisis kasus",
      "Penilaian produk kreatif",
      "Refleksi individu",
      "Rubrik penilaian sikap sosial"
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran tentang hukum monogami, poligami, dan nikah mut’ah, mahasiswa ditugaskan membuat refleksi pribadi tentang nilai-nilai keadilan dalam pernikahan menurut Islam. Instrumen asesmen yang paling tepat untuk menilai sikap mahasiswa berdasarkan tujuan pembelajaran tersebut adalah:",
    "o": [
      "Tes pilihan ganda",
      "Angket refleksi sikap",
      "Ujian essay",
      "Lembar observasi keterampilan",
      "Tes lisan"
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran tentang bank, rente, dan fee, dosen melihat bahwa berdasarkan asesmen sebelumnya, banyak mahasiswa kurang memahami konsep riba. Teknik asesmen yang paling tepat untuk memperdalam pengetahuan mahasiswa saat ini adalah:",
    "o": [
      "Debat terbuka",
      "Kuis formatif berbasis kasus",
      "Lembar observasi sikap",
      "Portofolio karya",
      "Ujian praktik"
    ],
    "a": 1
  },
  {
    "q": "Pada materi tentang pemerintahan dalam Islam, setelah diketahui dari asesmen sebelumnya bahwa banyak mahasiswa sudah memahami konsep khilafah, dosen ingin mengukur keterampilan mahasiswa dalam menerapkan prinsip-prinsip pemerintahan Islam pada studi kasus. Instrumen asesmen yang tepat adalah:",
    "o": [
      "Tes objektif",
      "Lembar observasi praktik simulasi",
      "Tes essay deskriptif",
      "Kuis pilihan ganda",
      "Angket sikap"
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran tentang implementasi pendidikan karakter, setelah asesmen awal menunjukkan keragaman nilai yang dianut peserta didik, teknik asesmen yang tepat untuk mengukur perubahan sikap mahasiswa adalah:",
    "o": [
      "Portofolio tugas proyek",
      "Observasi perilaku di lapangan",
      "Ujian pilihan ganda",
      "Tes tertulis essay",
      "Penilaian produk karya"
    ],
    "a": 1
  },
  {
    "q": "Saat membahas moderasi beragama di Indonesia, asesmen awal menunjukkan sebagian mahasiswa memiliki pandangan eksklusif. Instrumen asesmen yang tepat untuk menilai perkembangan sikap mahasiswa setelah pembelajaran adalah:",
    "o": [
      "Rubrik penilaian produk",
      "Daftar cek sikap moderasi",
      "Tes pilihan ganda",
      "Laporan hasil belajar individu",
      "Portofolio media kampanye moderasi"
    ],
    "a": 1
  },
  {
    "q": "Dalam narasi pembelajaran tentang zakat hasil tanah yang disewakan, guru terlalu fokus pada teknologi (video animasi) tanpa memperhatikan pemahaman peserta didik. Best practice yang sebaiknya dilakukan guru untuk meningkatkan kualitas perencanaan pembelajaran ke depan adalah:",
    "o": [
      "Mengurangi penggunaan teknologi dalam kelas",
      "Memilih teknologi yang relevan untuk mendukung tujuan pembelajaran",
      "Memberi tugas sebanyak mungkin kepada peserta didik",
      "Hanya menggunakan metode ceramah",
      "Menghapus penggunaan animasi dalam pembelajaran"
    ],
    "a": 1
  },
  {
    "q": "Dalam narasi tentang pembelajaran monogami, poligami, atau nikah mut’ah, guru mengalami kesulitan mengelola diskusi akibat penggunaan media sosial yang tidak terarah. Praktik baik (best practice) dalam pelaksanaan pembelajaran yang harus diutamakan guru adalah:",
    "o": [
      "Membatasi akses internet saat diskusi",
      "Menggunakan media sosial dengan panduan dan etika diskusi yang jelas",
      "Menghentikan seluruh diskusi daring",
      "Fokus hanya pada ceramah tanpa diskusi",
      "Melarang penggunaan gadget saat belajar"
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran tentang bank, rente, dan fee, guru mengabaikan analisis hasil belajar sehingga kesulitan dalam memperbaiki strategi evaluasi. Praktik baik (best practice) dalam evaluasi pembelajaran yang sebaiknya diterapkan adalah:",
    "o": [
      "Melakukan evaluasi berbasis observasi sikap saja",
      "Menganalisis hasil asesmen untuk merancang evaluasi formatif dan sumatif",
      "Melakukan evaluasi hanya di akhir semester",
      "Mengandalkan nilai rata-rata tanpa analisis",
      "Menyerahkan evaluasi sepenuhnya ke mahasiswa"
    ],
    "a": 1
  },
  {
    "q": "Dalam sebuah narasi, guru fiqih di era digital mampu menguasai berbagai platform digital untuk mendukung pembelajaran. Hal ini menunjukkan bahwa kemampuan tersebut menjadi modal penting bagi guru untuk:",
    "o": [
      "Meningkatkan prestise pribadi",
      "Mengembangkan diri secara berkelanjutan",
      "Meningkatkan jumlah tugas siswa",
      "Menyederhanakan seluruh materi",
      "Menghindari proses refleksi pembelajaran"
    ],
    "a": 1
  },
  {
    "q": "Dalam narasi lain, guru menggunakan AI untuk membuat simulasi kasus fiqih berbasis gaya belajar Gen Z dan Alpha. Namun, guru mengalami kesulitan dalam validasi materi. Langkah ilmiah untuk menyelesaikan masalah ini adalah:",
    "o": [
      "Menyerahkan semua pada mesin AI",
      "Melakukan telaah pakar dan uji validasi konten",
      "Mengurangi penggunaan AI secara keseluruhan",
      "Membiarkan peserta didik mencari sendiri jawabannya",
      "Mengabaikan gaya belajar peserta didik"
    ],
    "a": 1
  }
]
  
