[
  {
    "q": "Disajikan deskripsi materi tentang karakteristik perkembangan anak, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah sikap yang paling sesuai dengan indikator tujuan supaya peserta didik dapat meningkatkan keimanan, ketakwaan dan akhlak mulia. Seorang guru RA kelompok B (usia 5-6 tahun) merancang kegiatan pembiasaan pagi berupa berdoa bersama, mengucapkan salam, dan membantu teman merapikan alat bermain. Rumusan tujuan pembelajaran ranah sikap yang paling tepat untuk adalah…",
    "o": [
      "Anak mampu menjelaskan makna doa dan pentingnya membantu teman sebagai bentuk ketaatan kepada Allah SWT.",
      "Anak menunjukkan kebiasaan berdoa sebelum kegiatan, mengucapkan salam, dan membantu teman secara konsisten dalam kegiatan sehari-hari di kelas.",
      "Anak memahami konsep iman, takwa, dan akhlak mulia melalui pembiasaan pagi.",
      "Anak dapat menyebutkan hadis tentang tolong-menolong dan adab berdoa dengan benar setelah dibiasakan melalui pembiasaan pagi.",
      "Anak mampu menceritakan kembali nasihat guru tentang pentingnya berperilaku baik sesuai ajaran agama."
    ],
    "a": 2
  },
  {
    "q": "Disajikan pernyataan materi tentang aspek pembelajaran PAUD, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan indikator supaya peserta didik mampu berpikir kritis. Seorang guru TK kelompok B (usia 5-6 tahun) merancang kegiatan eksperimen sederhana dengan tema \"Air\". Anak diminta mengamati beberapa benda (batu, daun, plastik, dan kertas) lalu mencoba memasukkannya ke dalam air untuk mengetahui benda mana yang tenggelam dan mengapung. Guru ingin mengembangkan berpikir kritis anak melalui proses mengamati, membandingkan, dan menarik kesimpulan sederhana. Rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan indikator tersebut adalah…",
    "o": [
      "Anak mengetahui pengertian benda tenggelam dan mengapung melalui penjelasan guru.",
      "Anak memahami konsep massa jenis benda berdasarkan hasil percobaan yang dilakukan.",
      "Anak mampu mengamati perbedaan benda yang tenggelam dan mengapung serta menyampaikan alasan sederhana berdasarkan hasil percobaan.",
      "Anak dapat menyebutkan jenis-jenis benda yang tenggelam dan mengapung secara benar.",
      "Anak mampu menceritakan kembali proses pengamatannya dari awal sampai akhir dan membuat kesimpulan."
    ],
    "a": 3
  },
  {
    "q": "Disajikan pernyataan materi tentang berbagai pendekatan pembelajaran yang dapat digunakan di PAUD, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai dengan indikator supaya peserta didik memiliki semangat gotong royong. Seorang guru TK kelompok B (usia 5-6 tahun) menggunakan pendekatan pembelajaran berbasis proyek (Project Based Learning) melalui kegiatan membuat mini taman kelas. Anak bekerja dalam kelompok kecil untuk menyiapkan tanah, menanam bibit, dan menyiram tanaman secara bergantian. Guru ingin menumbuhkan semangat gotong royong melalui keterampilan bekerja sama. Rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai dengan indikator tersebut adalah …",
    "o": [
      "Anak mampu menjelaskan pentingnya bekerja sama dalam kelompok saat membuat mini taman.",
      "Anak memahami makna gotong royong sebagai bagian dari nilai sosial.",
      "Anak dapat menjelaskan langkah-langkah membuat mini taman secara runtut bersama kelompoknya.",
      "Anak mampu menyebutkan contoh kegiatan gotong royong yang ada di lingkungan sekolah.",
      "Anak mampu bekerja sama dengan teman satu kelompok dalam menanam dan merawat tanaman sesuai perannya."
    ],
    "a": 5
  },
  {
    "q": "Disajikan deskripsi kasus pengembangan materi tentang konsep bermain sebagai metode pembelajaran utama di PAUD, mahasiswa dapat menentukan rumusan indikator tujuan pembelajaran ranah sikap yang paling sesuai dengan materi supaya peserta didik memiliki sikap penerimaan terhadap tradisi. Seorang guru PAUD merancang kegiatan bermain menggunakan permainan tradisional daerah seperti engklek dan congklak. Kegiatan dilakukan secara berkelompok dengan pendampingan guru melalui cerita singkat tentang asal-usul permainan tersebut. Guru ingin anak mengenal tradisi lokal melalui pengalaman bermain yang menyenangkan, tanpa penjelasan yang bersifat abstrak. Berdasarkan konsep bermain sebagai metode pembelajaran utama di PAUD, rumusan indikator tujuan pembelajaran ranah sikap yang paling sesuai agar peserta didik memiliki sikap penerimaan terhadap tradisi adalah…",
    "o": [
      "Anak menunjukkan sikap senang, mau mencoba, dan menghargai permainan tradisional saat bermain bersama teman.",
      "Anak mampu menceritakan kembali aturan permainan tradisional secara runtut.",
      "Anak dapat menjelaskan perbedaan permainan tradisional dan permainan modern.",
      "Anak mampu menyebutkan nama-nama permainan tradisional daerah yang dimainkan di kelas.",
      "Anak dapat menunjukkan keahliannya dalam memainkan berbagai permainan tradisional."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi materi tentang konsep Kurikulum Merdeka dalam konteks PAUD, mahasiswa dapat menentukan rumusan indikator tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan materi supaya peserta didik memiliki kemampuan berpikir dinamis dan inovatif. Seorang guru PAUD merancang kegiatan projek tema “Alat Transportasi”. Anak diberi berbagai bahan bekas (kardus, tutup botol, sedotan) dan diajak mengeksplorasi cara membuat model alat transportasi sesuai ide masing-masing. Guru tidak memberikan contoh jadi, tetapi memfasilitasi anak untuk mencoba berbagai kemungkinan dan mendiskusikan hasilnya secara sederhana. Berdasarkan prinsip Kurikulum Merdeka dan karakteristik anak usia dini, rumusan indikator tujuan pembelajaran ranah pengetahuan yang paling sesuai untuk menumbuhkan berpikir dinamis dan inovatif adalah …",
    "o": [
      "Anak mengetahui jenis-jenis alat transportasi yang ada di darat, laut, dan udara.",
      "Anak mampu menyebutkan bahan-bahan yang digunakan untuk membuat model alat transportasi.",
      "Anak memahami konsep inovasi dan kreativitas dalam pembuatan alat transportasi.",
      "Anak dapat mengemukakan ide sederhana tentang bentuk dan fungsi alat transportasi yang dibuat berdasarkan hasil eksplorasi.",
      "Anak dapat menunjukkan kemampuan dalam menciptakan suatu hal berdasarkan hasil imajinasi."
    ],
    "a": 4
  },
  {
    "q": "Disajikan deskripsi aktivitas pembelajaran guru dalam perencanaan tujuan pembelajaran dengan pendekatan PBL, mahasiswa dapat menganalisis materi ajar prinsip-prinsip pembelajaran berbasis perkembangan AUD berdasarkan struktur keilmuan pada perencanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik. Seorang guru TK kelompok B (usia 5–6 tahun) merencanakan pembelajaran dengan pendekatan Problem Based Learning (PBL) pada tema “Lingkunganku”. Guru mengawali kegiatan dengan menghadirkan masalah sederhana: “Mengapa halaman sekolah sering kotor setelah jam bermain?” Anak diajak mengamati kondisi lingkungan, berdiskusi secara kelompok kecil, dan mencoba solusi sederhana seperti memilah sampah dan membersihkan halaman bersama. Rumusan tujuan pembelajaran yang paling tepat adalah …",
    "o": [
      "Anak memahami konsep kebersihan lingkungan dan jenis-jenis sampah melalui penjelasan guru.",
      "Anak dapat mengidentifikasi masalah sederhana di lingkungan sekitar dan mencoba solusi melalui kegiatan bermain dan bekerja sama.",
      "Anak mengetahui langkah-langkah menjaga kebersihan lingkungan sekolah.",
      "Anak mampu menjelaskan penyebab dan dampak lingkungan kotor secara runtut.",
      "Anak dapat menceritakan kembali langkah-langkah yang dilakukan untuk menjaga kebersihan."
    ],
    "a": 2
  },
  {
    "q": "Disajikan deskripsi aktivitas guru dalam pelaksanaan tujuan pembelajaran dengan pendekatan PjBL, mahasiswa dapat menganalisis materi ajar aspek pembelajaran kognitif, sosial-emosional, bahasa, motorik, hingga nilai agama atau moral PAUD berdasarkan struktur keilmuan pada pelaksanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik. Seorang guru TK kelompok B melaksanakan pembelajaran dengan pendekatan PjBL melalui proyek “Kebun Mini Sekolah”. Anak-anak bekerja dalam kelompok untuk menyiapkan tanah, menanam bibit, menyiram tanaman, dan mendokumentasikan pertumbuhan tanaman melalui gambar dan cerita sederhana. Selama kegiatan, guru membiasakan anak berdoa sebelum memulai, bekerja sama, bergiliran menggunakan alat, dan berdiskusi tentang hasil pengamatan. Berdasarkan pelaksanaan pembelajaran tersebut, analisis materi ajar yang paling tepat sesuai struktur keilmuan PAUD adalah …",
    "o": [
      "Materi lebih menekankan pada kemampuan anak mengenal dan memahami proses pertumbuhan tanaman.",
      "Materi lebih menekankan pada kemampuan anak pada keterampilan motorik melalui kegiatan menanam.",
      "Materi lebih menekankan pada keterlibatan anak agar mengetahui cara menanam.",
      "Materi pembelajaran menekankan pada pembiasaan nilai-nilai agama, kerja sama, dan keterampilan motorik dalam konteks nyata yang bermakna bagi anak.",
      "Materi fokus pada hasil akhir karya proyek yang dihasilkan oleh anak."
    ],
    "a": 4
  },
  {
    "q": "Disajikan pernyataan penerapan pembelajaran dengan materi pengintegrasian aspek pembelajaran PAUD dalam kegiatan pembelajaran yang bermakna sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan pengetahuan pedagogik. Dalam tema “Makananku Sehat”, guru PAUD ingin mengintegrasikan aspek kognitif (memilih makanan sehat), bahasa (bercerita), sosial-emosional (bergiliran dan bekerja sama), serta motorik (menyiapkan makanan sederhana). Guru memilih pendekatan pembelajaran berbasis masalah agar anak terlibat aktif dan pembelajaran menjadi bermakna. Rancangan pembelajaran berpendekatan PBL yang paling sesuai berdasarkan pengetahuan pedagogik PAUD adalah …",
    "o": [
      "Guru mengajukan masalah sederhana tentang pilihan makanan, mengajak anak berdiskusi, lalu guru menentukan penyelesaian masalah.",
      "Guru menghadirkan masalah nyata lingkungan bermain yang kotor, mengajak anak mengamati, berdiskusi, mencoba berbagai cara penyelesaian melalui kegiatan membersihkan bersama, dan merefleksikan pengalaman.",
      "Guru menyampaikan masalah kebersihan, mengajak anak mendiskusikan penyelesaian, lalu menetapkan solusi terbaik berdasarkan arahan guru.",
      "Guru menayangkan gambar lingkungan kotor sebagai masalah, kemudian menjelaskan penyelesaian masalah sambil anak menirukan kegiatan guru.",
      "Guru menceritakan masalah kebersihan lingkungan dan meminta anak menyebutkan cara penyelesaian secara lisan."
    ],
    "a": 2
  },
  {
    "q": "Disajikan deskripsi kasus penerapan pembelajaran dengan materi pendekatan tematik, saintifik, berbasis proyek, atau pendekatan berbasis bermain di PAUD, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan pengetahuan teknologi. Seorang guru PAUD kelompok B melaksanakan pembelajaran tema “Lingkunganku” dengan pendekatan tematik dan saintifik. Anak diajak mengamati kondisi taman sekolah, bermain membersihkan area bermain, dan berdiskusi tentang cara menjaga lingkungan tetap bersih. Guru ingin mengembangkan pembelajaran berbasis masalah dengan memanfaatkan teknologi sederhana yang relevan dan aman bagi anak usia dini. Berdasarkan deskripsi tersebut, rancangan pembelajaran berpendekatan Problem Based Learning (PBL) yang paling tepat dari sisi pengetahuan teknologi adalah …",
    "o": [
      "Guru menayangkan video tentang masalah lingkungan kotor lalu menjelaskan penyelesaian masalah kepada anak.",
      "Guru mendokumentasikan kondisi taman dengan foto sederhana, mengajak anak mengamati sebagai masalah nyata, mencoba solusi melalui bermain membersihkan lingkungan, dan merefleksikan hasil dengan melihat kembali foto sebelum–sesudah.",
      "Guru memutar video animasi panjang tentang kebersihan lingkungan sebagai masalah dan meminta anak menirukan solusi.",
      "Guru memberikan permainan digital tentang lingkungan bersih sebagai penyelesaian masalah utama.",
      "Guru menampilkan gambar digital sebagai masalah, mengajak anak berdiskusi, lalu menentukan solusi terbaik bersama guru."
    ],
    "a": 2
  },
  {
    "q": "Disajikan pernyataan penerapan pembelajaran dengan materi konsep Kurikulum Merdeka dalam konteks PAUD sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis perbedaan individu sesuai dengan pengetahuan teknologi. Seorang guru PAUD menerapkan Kurikulum Merdeka pada tema “Diriku”. Guru merancang pembelajaran dengan memberi ruang pilihan aktivitas sesuai minat dan kesiapan anak. Untuk mendukung pembelajaran, guru memanfaatkan teknologi sederhana seperti foto, audio, dan aplikasi gambar. Guru ingin memastikan rancangan pembelajaran tetap menghargai perbedaan individu dan berpusat pada anak. Berdasarkan deskripsi tersebut, rancangan pembelajaran yang paling tepat dengan pendekatan berbasis perbedaan individu sesuai pengetahuan teknologi PAUD adalah …",
    "o": [
      "Guru menyiapkan beberapa aktivitas bermain dengan pilihan media digital sederhana, memberi kebebasan anak memilih sesuai minat, dan mendampingi sesuai kebutuhan masing-masing.",
      "Guru menggunakan satu aplikasi pembelajaran digital yang sama agar semua anak belajar dengan cara seragam.",
      "Guru memutar video pembelajaran sebagai media utama, lalu meminta anak mengikuti instruksi yang sama.",
      "Guru menggunakan teknologi untuk menjelaskan materi secara lengkap agar anak memiliki pemahaman yang setara.",
      "Guru memberikan tugas digital kepada seluruh anak untuk dilakukan di rumah dengan pendampingan orang tua."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi kasus tentang pembelajaran berbasis lingkungan, mahasiswa dapat menentukan pendekatan pembelajaran yang paling sesuai dengan karakteristik perkembangan anak usia dini. Guru RA ingin mengenalkan konsep alam semesta pada kelompok A (usia 4-5 tahun) dengan memanfaatkan kebun sekolah. Guru ingin anak belajar secara konkret dan aktif. Pendekatan yang paling tepat digunakan adalah…",
    "o": [
      "Pendekatan saintifik dengan melakukan pengamatan langsung, bertanya, dan mengumpulkan data tentang benda-benda di kebun.",
      "Pendekatan ekspositori dengan menjelaskan materi tentang kebun secara rinci di dalam kelas.",
      "Pendekatan klasikal dengan meminta anak duduk rapi mendengarkan cerita guru tentang alam semesta.",
      "Pendekatan drill dengan meminta anak menghafal nama-nama tanaman di kebun.",
      "Pendekatan individual dengan memberikan lembar kerja untuk dikerjakan sendiri-sendiri."
    ],
    "a": 1
  },
  {
    "q": "Disajikan kasus mengenai anak yang belum bisa bersosialisasi dengan teman sebaya, mahasiswa dapat menentukan langkah penanganan yang tepat berdasarkan perkembangan sosial-emosional. Di kelompok B, terdapat anak berinisial A yang selalu bermain sendiri dan menangis jika didekati temannya. Guru ingin mengembangkan kemampuan sosial-emosional anak tersebut secara bertahap. Langkah penanganan yang tepat adalah…",
    "o": [
      "Membiarkan anak tersebut sendiri sampai dia berani mendekati teman-temannya.",
      "Memaksa anak tersebut untuk ikut bermain bersama teman-temannya agar terbiasa.",
      "Memberikan kesempatan anak bermain mandiri, lalu perlahan mendampingi anak bermain dengan satu teman sebaya menggunakan media permainan yang menarik.",
      "Menegur anak tersebut agar tidak menjadi anak yang cengeng dan penakut.",
      "Meminta orang tua anak untuk tidak menitipkan anaknya di RA terlebih dahulu."
    ],
    "a": 3
  },
  {
    "q": "Disajikan ilustrasi mengenai kegiatan bermain motorik kasar, mahasiswa dapat menentukan tujuan pembelajaran yang tepat sesuai dengan indikator perkembangan fisik motorik anak. Guru menyiapkan lintasan halang rintang di halaman sekolah yang terdiri dari merangkak di bawah tali, melompat ke dalam lingkaran hula hoop, dan berjalan di atas papan titian. Tujuan pembelajaran yang paling sesuai adalah…",
    "o": [
      "Anak mampu menyebutkan alat-alat motorik yang digunakan dalam permainan halang rintang.",
      "Anak mampu memahami aturan permainan halang rintang yang dijelaskan guru.",
      "Anak dapat menunjukkan koordinasi mata-tangan dan keseimbangan tubuh melalui aktivitas fisik halang rintang.",
      "Anak mampu menceritakan pengalaman bermain halang rintang kepada temannya.",
      "Anak dapat berpartisipasi dalam kegiatan berolahraga secara aktif."
    ],
    "a": 3
  },
  {
    "q": "Disajikan narasi tentang evaluasi pembelajaran, mahasiswa dapat menentukan instrumen penilaian yang tepat untuk mengukur perkembangan anak secara autentik. Guru ingin mengetahui kemajuan kemampuan bahasa anak, khususnya dalam bercerita, setelah mengikuti tema \"Buku Cerita\". Instrumen penilaian yang paling autentik digunakan adalah…",
    "o": [
      "Tes tertulis mengenai isi cerita yang dibacakan guru.",
      "Lembar ceklis perkembangan anak.",
      "Catatan anekdot dan portofolio hasil karya anak berupa gambar cerita.",
      "Soal pilihan ganda tentang tokoh-tokoh dalam cerita.",
      "Angket untuk orang tua tentang kebiasaan membaca di rumah."
    ],
    "a": 3
  },
  {
    "q": "Disajikan kasus mengenai anak yang kesulitan dalam motorik halus, mahasiswa dapat menentukan media yang tepat untuk menstimulasi kemampuan tersebut. Anak didik kelompok A kesulitan menggunakan gunting dan memegang pensil dengan benar (belum sesuai usia). Guru ingin menyiapkan kegiatan stimulasi. Media yang tepat digunakan adalah…",
    "o": [
      "Bermain balok kayu yang besar.",
      "Bermain perosotan di halaman.",
      "Bermain meronce manik-manik berukuran besar dan meremas plastisin.",
      "Mendengarkan cerita guru tentang cara memegang pensil.",
      "Menonton video tentang cara menggunting kertas."
    ],
    "a": 3
  },
  {
    "q": "Disajikan ilustrasi pembelajaran sains sederhana, mahasiswa dapat menentukan keterampilan proses sains yang sedang dikembangkan pada anak. Guru mengajak anak mencampur air berwarna merah dan kuning dalam botol bening. Anak-anak berteriak gembira saat melihat perubahan warna menjadi oranye. Keterampilan proses sains yang sedang dikembangkan adalah…",
    "o": [
      "Mengomunikasikan hasil.",
      "Mengklasifikasikan benda.",
      "Mengamati dan inferensi (menyimpulkan) hasil pencampuran.",
      "Mengukur volume air.",
      "Memprediksi warna selanjutnya."
    ],
    "a": 3
  },
  {
    "q": "Disajikan pernyataan mengenai perencanaan pembelajaran, mahasiswa dapat menentukan prinsip penyusunan Rencana Pelaksanaan Pembelajaran Harian (RPPH) yang berpusat pada anak. Guru sedang menyusun RPPH untuk tema \"Tanaman\". Prinsip utama yang harus diperhatikan agar pembelajaran berpusat pada anak adalah…",
    "o": [
      "Tujuan pembelajaran disesuaikan dengan kurikulum pusat.",
      "Kegiatan yang dirancang harus menarik dan dapat memotivasi anak untuk mengeksplorasi sesuai minatnya.",
      "Evaluasi dilakukan hanya pada akhir minggu.",
      "Guru menjadi pusat sumber informasi dan menjelaskan seluruh materi.",
      "Media pembelajaran harus dibeli dari toko agar terlihat profesional."
    ],
    "a": 2
  },
  {
    "q": "Disajikan situasi mengenai anak yang memiliki bakat khusus, mahasiswa dapat menentukan sikap guru yang sesuai dengan prinsip pendidikan inklusif. Terdapat seorang anak di RA yang sangat mahir menggambar dan memiliki pengetahuan luas tentang ruang angkasa, melebihi teman seusianya. Sikap guru yang tepat adalah…",
    "o": [
      "Meminta anak tersebut mengerjakan tugas yang sama dengan teman lainnya.",
      "Memberikan pengayaan materi dan fasilitas khusus untuk mengembangkan bakatnya tanpa mengabaikan aspek perkembangan lainnya.",
      "Meminta orang tua membawa anak tersebut ke sekolah khusus.",
      "Membiarkan anak tersebut menggambar sendiri sepanjang hari.",
      "Mengurangi perhatian pada anak tersebut karena sudah pintar."
    ],
    "a": 2
  },
  {
    "q": "Disajikan narasi tentang pemanfaatan media pembelajaran, mahasiswa dapat memilih media yang sesuai untuk mengenalkan konsep matematika awal. Guru ingin mengenalkan konsep penjumlahan sederhana pada anak kelompok B. Media yang paling tepat dan konkret digunakan adalah…",
    "o": [
      "Buku paket matematika bergambar.",
      "Papan tulis dan kapur.",
      "Benda-benda di sekitar seperti kancing, batu kecil, atau biji-bijian.",
      "Video pembelajaran tentang angka.",
      "Lembar kerja anak (LKA) berisi soal angka."
    ],
    "a": 3
  },
  {
    "q": "Disajikan konteks tentang peran guru dalam pendidikan anak usia dini, mahasiswa dapat menentukan perilaku guru yang mencerminkan fasilitator pembelajaran. Dalam sebuah kegiatan projek, anak-anak sedang kesulitan menyusun balok agar tidak jatuh. Perilaku guru yang tepat sebagai fasilitator adalah…",
    "o": [
      "Langsung mengambil alih balok dan menyusunnya hingga benar.",
      "Menyuruh anak untuk berhenti bermain dan mengganti kegiatan lain.",
      "Memberikan pertanyaan pemantik dan dorongan agar anak mencoba kembali dengan ide baru.",
      "Memarahi anak karena tidak bisa menyusun balok dengan rapi.",
      "Mengerjakan tugas administrasi di dekat anak-anak."
    ],
    "a": 3
  },
  {
    "q": "Disajikan kasus mengenai anak yang kesulitan dalam memahami konsep waktu, mahasiswa dapat menentukan metode yang tepat untuk mengajarkan konsep tersebut. Anak didik kelompok B sering bertanya 'kapan pulang?' padahal kegiatan baru saja dimulai. Guru ingin membantu anak memahami konsep waktu secara sederhana. Metode yang tepat digunakan adalah…",
    "o": [
      "Menjelaskan pengertian waktu dan jam secara teoretis.",
      "Menggunakan jadwal visual (gambar urutan kegiatan) dan timer sederhana saat beraktivitas.",
      "Meminta anak menghafal nama-nama hari dan bulan.",
      "Menghukum anak jika terus bertanya hal yang sama.",
      "Membiarkan anak sampai dia mengerti sendiri konsep waktu."
    ],
    "a": 2
  },
  {
    "q": "Disajikan narasi tentang perilaku anak yang menonjolkan ego, mahasiswa dapat menentukan pendekatan bimbingan yang tepat. Seorang anak selalu berebut mainan dan tidak mau berbagi dengan teman kelompoknya. Pendekatan bimbingan sosial-emosional yang tepat untuk anak tersebut adalah…",
    "o": [
      "Membatasi anak tersebut bermain agar tidak berebut.",
      "Memberikan penguatan positif (pujian) saat anak berhasil berbagi dan membimbingnya melakukan teknik *sharing* (berbagi) secara konsisten.",
      "Memarahi anak agar merasa bersalah dan tidak mengulanginya.",
      "Mengambil mainan yang diperebutkan agar adil.",
      "Meminta teman lainnya untuk mengalah pada anak tersebut."
    ],
    "a": 2
  },
  {
    "q": "Disajikan kasus tentang pengenalan budaya, mahasiswa dapat menentukan kegiatan yang paling sesuai dengan karakteristik perkembangan anak usia dini. Guru ingin mengenalkan keberagaman budaya Indonesia kepada anak kelompok B. Kegiatan yang paling sesuai agar pembelajaran bermakna dan menyenangkan adalah…",
    "o": [
      "Meminta anak menghafal rumah adat dari 34 provinsi.",
      "Menyelenggarakan kegiatan pentas seni mengenakan pakaian adat dan mencicipi makanan tradisional.",
      "Menjelaskan sejarah perjuangan bangsa melalui ceramah.",
      "Menonton video dokumenter tentang sejarah Indonesia.",
      "Mengerjakan lembar kerja berisi gambar pakaian adat."
    ],
    "a": 2
  },
  {
    "q": "Disajikan ilustrasi mengenai kegiatan literasi awal, mahasiswa dapat menentukan strategi yang tepat untuk mengembangkan kemampuan membaca pada anak usia dini. Guru ingin mengenalkan huruf dan kata pada anak kelompok A. Strategi yang tepat sesuai dengan prinsip pembelajaran PAUD adalah…",
    "o": [
      "Menggunakan metode dril menghafal abjad A-Z.",
      "Memberikan beban PR menulis huruf yang banyak.",
      "Menggunakan media kartu kata bergambar dan membacakan buku cerita secara interaktif.",
      "Memaksa anak mengeja kata sebelum mengenali huruf.",
      "Memberikan tes membaca untuk menilai kemampuan anak."
    ],
    "a": 3
  },
  {
    "q": "Disajikan narasi tentang pembelajaran berbasis seni, mahasiswa dapat menentukan tujuan dari aktivitas seni tersebut bagi perkembangan anak. Anak-anak diminta membuat kolase menggunakan berbagai jenis daun kering, biji-bijian, dan lem. Tujuan utama aktivitas seni ini adalah…",
    "o": [
      "Menghasilkan karya seni yang bernilai jual tinggi.",
      "Mengembangkan kreativitas, imajinasi, dan keterampilan motorik halus anak.",
      "Melatih anak untuk diam dan tenang dalam waktu lama.",
      "Menguji kemampuan anak dalam meniru pola yang dicontohkan guru.",
      "Membiasakan anak untuk bekerja sendiri tanpa bantuan teman."
    ],
    "a": 2
  },
  {
    "q": "Disajikan kasus tentang anak dengan kebutuhan khusus ringan (misal: hiperaktif), mahasiswa dapat menentukan penyesuaian lingkungan belajar yang tepat. Seorang anak di kelas cenderung tidak bisa duduk tenang dan sering mengganggu teman. Penyesuaian lingkungan belajar yang tepat adalah…",
    "o": [
      "Mengikat anak di kursi agar tidak berlarian.",
      "Memberikan ruang gerak yang cukup dan menyelingi kegiatan duduk dengan aktivitas fisik motorik.",
      "Meminta orang tua membawa anak ke sekolah khusus.",
      "Menegur anak setiap kali dia berdiri dari kursi.",
      "Memindahkan anak ke pojok kelas agar tidak mengganggu."
    ],
    "a": 2
  },
  {
    "q": "Disajikan pernyataan tentang pengembangan karakter, mahasiswa dapat menentukan kegiatan yang paling efektif untuk menanamkan nilai kejujuran. Guru ingin menanamkan nilai kejujuran pada anak kelompok B. Kegiatan yang paling efektif adalah…",
    "o": [
      "Menceritakan kisah fiksi tentang akibat berbohong.",
      "Membuat aturan kelas yang ketat dan memberikan hukuman berat bagi yang tidak jujur.",
      "Menciptakan budaya kelas yang aman dan terbuka, di mana guru mengapresiasi anak yang berani mengakui kesalahan.",
      "Meminta anak menghafal ayat tentang kejujuran.",
      "Memberikan hadiah pada anak yang paling tidak pernah salah."
    ],
    "a": 3
  },
  {
    "q": "Disajikan narasi tentang penggunaan teknologi di PAUD, mahasiswa dapat memilih aplikasi atau teknologi yang aman dan edukatif. Guru ingin mengenalkan konsep bentuk geometri pada anak kelompok B menggunakan teknologi. Teknologi yang paling aman dan edukatif digunakan adalah…",
    "o": [
      "Game online bertema kekerasan.",
      "Aplikasi puzzle interaktif untuk mengenali bentuk geometri.",
      "Video YouTube yang durasinya sangat panjang.",
      "Media sosial untuk memposting hasil karya anak.",
      "Tablet untuk bermain game tanpa pendampingan."
    ],
    "a": 2
  },
  {
    "q": "Disajikan kasus mengenai konflik antar anak, mahasiswa dapat menentukan peran guru dalam penyelesaian konflik. Dua anak berebut balok susun dan mulai saling dorong. Peran guru yang tepat dalam menyelesaikan konflik tersebut adalah…",
    "o": [
      "Mengambil balok tersebut dan tidak memberikannya pada siapapun.",
      "Memarahi kedua anak dan menyuruh mereka berdiri di pojok.",
      "Menjadi mediator, membantu anak mengenali emosinya, dan membimbing mereka mencari solusi bersama.",
      "Memihak salah satu anak yang dirasa lebih lemah.",
      "Membiarkan anak-anak menyelesaikan konflik mereka sendiri agar mandiri."
    ],
    "a": 3
  },
  {
    "q": "Disajikan narasi tentang evaluasi hasil belajar, mahasiswa dapat menentukan tindakan reflektif guru setelah melakukan penilaian. Guru menemukan bahwa sebagian besar anak belum memahami konsep angka 1-10 berdasarkan hasil evaluasi mingguan. Tindakan reflektif yang tepat adalah…",
    "o": [
      "Menyalahkan anak karena tidak belajar di rumah.",
      "Mengabaikan hasil evaluasi dan melanjutkan materi selanjutnya.",
      "Menganalisis kembali metode dan media pembelajaran, lalu merencanakan ulang kegiatan dengan pendekatan yang lebih konkret.",
      "Memberikan hukuman pada anak yang belum paham.",
      "Meminta orang tua memanggil guru les untuk anak."
    ],
    "a": 3
  },
  {
    "q": "Disajikan narasi tentang anak yang suka mengganggu teman saat jam tenang, mahasiswa dapat menentukan pendekatan disiplin positif yang tepat. Saat guru sedang membacakan cerita, seorang anak terus berbicara dan mengganggu teman di sebelahnya. Pendekatan disiplin positif yang tepat adalah…",
    "o": [
      "Menghentikan cerita dan memarahi anak tersebut di depan teman-temannya.",
      "Mengabaikan perilaku anak tersebut agar tidak menjadi pusat perhatian.",
      "Mendekati anak tersebut, memberikan isyarat halus untuk tenang, atau mengajaknya duduk di dekat guru.",
      "Menyuruh anak tersebut keluar kelas sampai cerita selesai.",
      "Mengurangi waktu bermain anak tersebut sebagai hukuman."
    ],
    "a": 3
  },
  {
    "q": "Disajikan kasus mengenai anak yang belum bisa melepas ketergantungan pada orang tua (tantrum saat ditinggal), mahasiswa dapat menentukan langkah transisi yang tepat. Anak didik baru di kelompok A selalu menangis histeris dan menolak masuk kelas saat diantar orang tuanya. Langkah transisi yang tepat adalah…",
    "o": [
      "Meminta orang tua langsung pulang agar anak terbiasa.",
      "Memaksa anak masuk kelas dan menutup pintu agar tidak mendengar tangisan anak.",
      "Mengizinkan orang tua menemani anak di dalam kelas selama beberapa hari dengan pengurangan durasi secara bertahap.",
      "Memberikan hadiah mainan yang banyak agar anak mau masuk kelas.",
      "Menegur anak agar berani dan tidak manja."
    ],
    "a": 3
  },
  {
    "q": "Disajikan pernyataan tentang asesmen perkembangan anak, mahasiswa dapat memilih metode pencatatan perkembangan yang efektif. Guru ingin mencatat perubahan perilaku drastis seorang anak secara mendetail, baik perilaku positif maupun negatif yang terjadi secara tiba-tiba. Metode pencatatan yang paling efektif adalah…",
    "o": [
      "Ceklis perkembangan.",
      "Catatan anekdot.",
      "Hasil karya (portofolio).",
      "Skala capaian perkembangan.",
      "Foto berseri."
    ],
    "a": 2
  },
  {
    "q": "Disajikan narasi tentang pembelajaran tema budaya, mahasiswa dapat memilih kegiatan yang mengembangkan aspek nilai agama dan moral. Dalam tema 'Pakaian Adat', guru ingin mengintegrasikan aspek nilai agama dan moral secara konkret. Kegiatan yang paling tepat adalah…",
    "o": [
      "Mewarnai gambar pakaian adat.",
      "Menyanyikan lagu daerah.",
      "Membiasakan anak mengucapkan salam dan menghargai perbedaan pakaian teman tanpa mengejek.",
      "Menonton video tentang jenis-jenis pakaian adat.",
      "Membuat kerajinan tangan pakaian adat dari kertas."
    ],
    "a": 3
  },
  {
    "q": "Disajikan kasus anak yang lambat dalam perkembangan bicara, mahasiswa dapat menentukan stimulasi yang tepat. Seorang anak kelompok A (usia 4 tahun) masih menggunakan bahasa isyarat untuk meminta sesuatu dan belum lancar berbicara. Stimulasi yang tepat dilakukan guru adalah…",
    "o": [
      "Meminta anak tersebut diam dan tidak usah berbicara.",
      "Memberikan semua keinginan anak meskipun tanpa diminta dengan bicara.",
      "Melakukan terapi bicara intensif setiap hari di kelas.",
      "Sering mengajak anak berbicara, membacakan buku cerita, dan mendorong anak untuk mengeluarkan bunyi/kata.",
      "Menyuruh teman-temannya untuk tidak menemani anak tersebut."
    ],
    "a": 4
  },
  {
    "q": "Disajikan situasi mengenai ruang kelas yang terbatas, mahasiswa dapat menentukan penataan lingkungan main yang efektif. Kelas RA kecil namun jumlah anak banyak. Guru ingin menata kelas agar tetap kondusif untuk bermain. Penataan yang tepat adalah…",
    "o": [
      "Menggunakan meja dan kursi yang besar agar kelas terlihat penuh.",
      "Menata lingkungan main berbasis sudut atau area, serta memanfaatkan dinding untuk media visual.",
      "Menghilangkan semua area main dan hanya menggunakan buku.",
      "Menyuruh anak bermain di luar ruangan sepanjang hari.",
      "Membuat pagar pembatas di dalam kelas."
    ],
    "a": 2
  },
  {
    "q": "Disajikan kasus mengenai anak yang takut mencoba hal baru (motorik), mahasiswa dapat menentukan pendekatan motivasi yang tepat. Anak didik takut mencoba memanjat jaring laba-laba di taman bermain. Pendekatan motivasi yang tepat adalah…",
    "o": [
      "Memaksa anak memanjat agar berani.",
      "Mengatakan pada anak bahwa memanjat itu berbahaya.",
      "Mendampingi anak secara fisik, memberikan semangat, dan membiarkan anak mencoba perlahan dari tahapan terendah.",
      "Membiarkan anak tidak bermain sama sekali.",
      "Membandingkan anak dengan teman lain yang lebih berani."
    ],
    "a": 3
  },
  {
    "q": "Disajikan narasi tentang peran orang tua dalam pendidikan, mahasiswa dapat memilih kegiatan kolaborasi yang tepat. Guru ingin meningkatkan keterlibatan orang tua dalam tema pembelajaran 'Pekerjaan'. Kegiatan kolaborasi yang tepat adalah…",
    "o": [
      "Meminta orang tua mengerjakan tugas-tugas anak di rumah.",
      "Mengundang orang tua menjadi guru tamu untuk menceritakan profesi mereka.",
      "Meminta orang tua membeli peralatan sekolah yang mahal.",
      "Meminta orang tua hanya memantau anak tanpa terlibat langsung.",
      "Mengadakan rapat orang tua setiap hari."
    ],
    "a": 2
  },
  {
    "q": "Disajikan situasi pembelajaran kognitif, mahasiswa dapat menentukan kegiatan yang mengembangkan kemampuan *problem solving* (pemecahan masalah). Guru ingin anak kelompok B bisa memecahkan masalah. Kegiatan yang paling tepat adalah…",
    "o": [
      "Mengerjakan lembar kerja yang hanya memiliki satu jawaban benar.",
      "Mendengarkan cerita guru tentang cara memecahkan masalah.",
      "Diberikan balok yang tidak cukup untuk membangun menara, lalu anak diminta mencari solusi agar menaranya tetap terbangun.",
      "Menghafal angka 1-20.",
      "Mewarnai gambar geometri."
    ],
    "a": 3
  },
  {
    "q": "Disajikan narasi tentang prinsip Kurikulum Merdeka, mahasiswa dapat menentukan evaluasi pembelajaran yang tepat. Dalam Kurikulum Merdeka, evaluasi pembelajaran untuk PAUD bertujuan untuk…",
    "o": [
      "Menentukan rangking anak di kelas.",
      "Menilai hasil belajar anak untuk kenaikan kelas.",
      "Mendokumentasikan dan merefleksikan pertumbuhan serta perkembangan anak secara holistik.",
      "Membandingkan kemampuan satu anak dengan anak lainnya.",
      "Memberikan nilai angka pada rapor anak."
    ],
    "a": 3
  },
  {
    "q": "Disajikan deskripsi pembelajaran materi aspek perkembangan kognitif PAUD, mahasiswa dapat menentukan instrumen asesmen yang tepat dengan mempertimbangkan hasil asesmen awal pada aspek pengetahuan. Seorang guru PAUD merencanakan pembelajaran tema “Bentuk di Sekitarku”. Hasil asesmen awal menunjukkan sebagian besar anak sudah mengenal bentuk geometri dasar (lingkaran, persegi, segitiga), namun masih kesulitan membedakan bentuk yang lebih kompleks seperti persegi panjang dan belah ketupat. Guru ingin menilai pemahaman anak tentang perbedaan bentuk-bentuk tersebut setelah pembelajaran. Instrumen asesmen yang tepat digunakan guru sesuai hasil asesmen awal adalah…",
    "o": [
      "Catatan anekdot untuk mencatat perilaku anak saat bermain.",
      "Portofolio hasil gambar anak.",
      "Ceklis capaian perkembangan untuk menilai kemampuan anak membedakan bentuk kompleks.",
      "Dokumentasi foto kegiatan anak bermain balok.",
      "Wawancara lisan tentang perasaan anak."
    ],
    "a": 3
  },
  {
    "q": "Disajikan narasi praktik pembelajaran seorang guru dengan materi pendekatan tematik, saintifik, berbasis proyek, atau pendekatan berbasis bermain di PAUD, mahasiswa dapat menentukan alur materi ajar pembelajaran dalam mengevaluasi tujuan pembelajaran. Seorang guru PAUD kelompok B melaksanakan pembelajaran berbasis proyek bertema “Pusat Perbelanjaan” (Supermarket). Guru mengajak anak mendesain dan membuat miniatur supermarket dari kardus bekas, berperan sebagai kasir dan pembeli, serta berdiskusi tentang jenis barang. Alur materi ajar yang paling tepat dalam mengevaluasi tujuan pembelajaran untuk menilai pemahaman anak adalah…",
    "o": [
      "Penjelasan tentang supermarket → Anak mendesain → Anak bermain peran → Guru menilai hasil karya.",
      "Penyampaian tujuan → Diskusi jenis barang → Anak bermain peran → Tanya jawab tentang pengalaman bermain.",
      "Observasi lingkungan → Diskusi tentang peran → Merancang dan membuat miniatur → Bermain peran → Refleksi pengalaman bermain.",
      "Pemutaran video supermarket → Anak menggambar supermarket → Evaluasi hasil gambar.",
      "Langsung bermain peran supermarket → Tanya jawab → Penjelasan tentang hasil bermain."
    ],
    "a": 3
  },
  {
    "q": "Disajikan deskripsi penerapan pembelajaran dengan materi integrasi aspek kognitif, sosial-emosional, bahasa, motorik, hingga nilai agama atau moral PAUD, mahasiswa dapat menentukan instrumen asesmen yang tepat pada aspek keterampilan. Dalam tema “Makananku Sehat”, anak PAUD belajar membuat salad buah. Guru ingin menilai keterampilan anak dalam menggunakan alat makan aman (sendok/garpu), motorik halus saat memotong buah lunak, dan kemampuan sosial saat bekerja sama mencuci buah. Instrumen asesmen yang tepat digunakan adalah…",
    "o": [
      "Daftar cek keterampilan (skala capaian perkembangan).",
      "Hasil karya berupa foto salad buah.",
      "Catatan anekdot interaksi anak.",
      "Wawancara lisan tentang rasa buah.",
      "Portofolio gambar buah."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi pembelajaran materi implementasi pendidikan nilai atau pendidikan karakter, mahasiswa dapat menentukan teknik asesmen yang tepat dengan mempertimbangkan hasil asesmen awal pada aspek sikap, pengetahuan atau keterampilan. Dalam pembelajaran pendidikan karakter tema “Peduli dan Tanggung Jawab”, guru PAUD melakukan asesmen awal melalui observasi dan catatan anekdot. Hasil asesmen menunjukkan bahwa sebagian anak sudah mampu bekerja sama dan mengikuti aturan bermain, sementara beberapa anak masih sering menghindari tanggung jawab saat kegiatan kelompok. Berdasarkan praktik tersebut, makna asesmen yang dilakukan guru dalam konteks pembelajaran PAUD adalah [cite: 9]…",
    "o": [
      "Asesmen digunakan untuk menentukan capaian akhir perkembangan anak.",
      "Asesmen berfungsi sebagai alat pencatatan perilaku anak selama pembelajaran.",
      "Asesmen dimanfaatkan untuk membandingkan perkembangan sikap anak dari satu waktu ke waktu.",
      "Asesmen digunakan sebagai dasar refleksi dan pengambilan keputusan pembelajaran untuk mendukung perkembangan sikap anak.",
      "Asesmen dilakukan untuk memastikan kegiatan berjalan sesuai rencana awal guru."
    ],
    "a": 4
  },
  {
    "q": "Disajikan deskripsi pembelajaran materi implementasi moderasi beragama di Indonesia, mahasiswa dapat menentukan instrumen asesmen yang tepat dengan mempertimbangkan hasil asesmen awal pada aspek sikap, pengetahuan atau keterampilan. Dalam pembelajaran PAUD tentang implementasi moderasi beragama di Indonesia, guru menanamkan nilai toleransi, saling menghargai, dan hidup rukun melalui bermain peran dan kegiatan kolaboratif. Berdasarkan asesmen awal, guru mengetahui bahwa: sebagian anak sudah mampu menerima perbedaan, sebagian anak masih menunjukkan sikap memilih teman dan enggan bekerja sama. Asesmen guru tepat karena digunakan untuk memahami perkembangan sikap anak secara berkelanjutan[cite: 9].",
    "o": [
      "Catatan anekdot untuk mencatat perilaku interaksi sosial anak.",
      "Tes tertulis tentang nilai toleransi.",
      "Lembar ceklis untuk mengelompokkan anak.",
      "Angket untuk orang tua.",
      "Portofolio hasil karya anak."
    ],
    "a": 1
  },
  {
    "q": "Disajikan narasi praktek pembelajaran seorang guru dengan materi aspek pembelajaran kognitif, sosial-emosional, bahasa, motorik, hingga nilai agama atau moral PAUD dengan menekankan pada aspek konten, pedagogi dan teknologi yang berpotensi menimbulkan masalah pembelajaran, mahasiswa dapat mengidentifikasi praktik baik/best practice dalam merencanakan pembelajaran yang berkualitas secara berkelanjutan. Langkah perencanaa yang dilakukan guru agar pembelajaran berjalan efektif dan tepat sasaran adalah menyusun tujuan berdasarkan perkembangan anak, merancang aktivitas kolaboratif, serta memilih teknologi sebagai alat pendukung eksplorasi dan refleksi[cite: 9].",
    "o": [
      "Menentukan materi dan media digital terlebih dahulu, lalu menyesuaikan aktivitas bermain.",
      "Menggabungkan video dengan lembar kerja digital agar semua anak mendapat informasi yang sama.",
      "Menyusun tujuan berdasarkan perkembangan anak, merancang aktivitas kolaboratif, serta memilih teknologi sebagai alat pendukung eksplorasi dan refleksi.",
      "Memaksimalkan penggunaan aplikasi pembelajaran agar anak terbiasa teknologi sejak dini.",
      "Mengintegrasikan seluruh aspek dalam satu kegiatan agar anak memiliki banyak waktu eksplorasi."
    ],
    "a": 3
  },
  {
    "q": "Disajikan narasi praktek pembelajaran seorang guru dengan pendekatan tematik, saintifik, berbasis proyek, atau pendekatan berbasis bermain di PAUD, mahasiswa dapat menentukan alur materi ajar pembelajaran dalam merencanakan pembelajaran yang berkualitas secara berkelanjutan. Seorang guru PAUD ingin mengenalkan konsep sains \"Terapung dan Tenggelam\" dengan pendekatan saintifik. Langkah perencanaan agar kegiatan bermakna sesuai dengan karakteristik anak usia dini adalah…",
    "o": [
      "Menjelaskan konsep terapung dan tenggelam menggunakan papan tulis.",
      "Meminta anak menghafal benda yang terapung dan tenggelam.",
      "Menyiapkan berbagai benda konkrit (batu, daun, gabus), mengajak anak melakukan prediksi, mencoba memasukkannya ke air, dan mendiskusikan hasilnya.",
      "Menayangkan video sains tentang konsep massa jenis.",
      "Memberikan lembar kerja tentang benda terapung tenggelam."
    ],
    "a": 3
  },
  {
    "q": "Disajikan deskripsi penerapan pembelajaran dengan materi pentingnya stimulasi yang sesuai dengan tahap pertumbuhan anak usia dini sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan materi pembelajaran. Rancangan pembelajaran dengan pendekatan Problem Based Learning (PBL) yang paling tepat adalah guru menghadirkan masalah nyata dalam bermain (misalnya teman tidak mau berbagi), memfasilitasi anak mencoba berbagai cara penyelesaian melalui bermain peran dan refleksi sederhana[cite: 3].",
    "o": [
      "Guru menjelaskan masalah kurangnya kerja sama dan menyampaikan cara penyelesaian melalui aturan bermain.",
      "Guru menyajikan masalah sosial sederhana, mengajak anak mendiskusikan penyelesaian, lalu menentukan solusi yang paling benar bersama guru.",
      "Guru menayangkan video berisi masalah sosial, kemudian menjelaskan penyelesaian masalah untuk ditiru.",
      "Guru menceritakan sebuah masalah tentang pertemanan dan meminta anak menyebutkan penyelesaian yang baik.",
      "Guru menghadirkan masalah nyata dalam bermain (misalnya teman tidak mau berbagi), memfasilitasi anak mencoba berbagai cara penyelesaian melalui bermain peran dan refleksi sederhana."
    ],
    "a": 5
  },
  {
    "q": "Disajikan deskripsi pembelajaran materi implementasi pendidikan nilai atau pendidikan karakter, mahasiswa dapat menentukan teknik asesmen yang tepat dengan mempertimbangkan hasil asesmen awal pada aspek sikap, pengetahuan atau keterampilan. Guru PAUD ingin menilai perkembangan karakter “mandiri” pada anak kelompok B. Berdasarkan asesmen awal, anak-anak sudah bisa merapikan mainan sendiri, namun belum berani ke kamar mandi sendiri. Teknik asesmen lanjutan yang tepat untuk menilai kemandirian ke kamar mandi adalah…",
    "o": [
      "Observasi terstruktur saat jam istirahat/toilet.",
      "Tes lisan tentang tata cara ke kamar mandi.",
      "Angket untuk orang tua di rumah.",
      "Wawancara dengan teman sebaya.",
      "Portofolio hasil karya anak."
    ],
    "a": 1
  },
  {
    "q": "Disajikan deskripsi pembelajaran materi implementasi moderasi beragama di Indonesia, mahasiswa dapat menentukan instrumen asesmen yang tepat dengan mempertimbangkan hasil asesmen awal pada aspek sikap, pengetahuan atau keterampilan. Dalam tema “Tempat Ibadah”, guru mengetahui anak-anak masih bingung membedakan tempat ibadah agama lain. Guru ingin menilai pengetahuan anak tentang keberagaman tempat ibadah setelah pembelajaran. Instrumen asesmen yang tepat adalah…",
    "o": [
      "Catatan anekdot perilaku toleransi.",
      "Foto hasil karya anak membuat miniatur tempat ibadah.",
      "Daftar ceklis keterampilan bermain peran.",
      "Refleksi lisan dengan menunjukkan gambar tempat ibadah.",
      "Portofolio gambar pemandangan."
    ],
    "a": 4
  }
]
