[
  {
    "q": "Seorang guru Bahasa Indonesia di Madrasah Ibtidaiyah akan mengajarkan materi mengenai Pengenalan Huruf dan Kata Sederhana dengan tema \"Mengenal Huruf melalui Kosakata Islami\" untuk kelas 1. Guru tersebut ingin merumuskan tujuan pembelajaran ranah sikap yang mengintegrasikan nilai-nilai keislaman dalam pembelajaran Bahasa Indonesia.\n\nManakah rumusan tujuan pembelajaran ranah sikap yang paling tepat?",
    "o": [
      "Siswa dapat menyebutkan lima kosakata islami (seperti Alhamdulillah, Bismillah) dengan pelafalan yang benar.",
      "Siswa menunjukkan sikap sabar dan menghargai teman ketika menunggu giliran membaca kata-kata islami di depan kelas.",
      "Siswa menuliskan huruf-huruf penyusun kosakata islami dengan bentuk yang rapi dan benar.",
      "Siswa mengelompokkan gambar benda yang namanya mengandung kosakata islami dan non-islami.",
      "Siswa menyalin tulisan di papan tulis yang namanya mengandung kosakata islami dan non-islami."
    ],
    "a": 1
  },
  {
    "q": "Pak Rano adalah pria suku Betawi menikah dengan Bu Ira yang merupakan suku Madura, keduanya berdomisili di Semarang.\n\nMereka mendiskusikan tradisi keluarga saat lebaran, yaitu tradisi Toron (mudik saat Idul Adha) bagi masyarakat Madura dan tradisi silaturahmi Idul Fitri bagi masyarakat Betawi.\n\nHasil diskusi yang menguntungkan kedua belah pihak adalah",
    "o": [
      "Pak Rano dan Bu Ira merayakan Idul Fitri dan Idul Adha di Semarang.",
      "Pak Rano dan Bu Ira berlebaran Idul Fitri di Jakarta dan Idul Adha di Madura.",
      "Pak Rano dan Bu Ira berlebaran Idul Fitri di Jakarta.",
      "Pak Rano dan Bu Ira berlebaran Idul Adha di Madura.",
      "Pak Rano dan Bu Ira silaturahmi di luar waktu lebaran."
    ],
    "a": 1
  },
  {
    "q": "Seorang guru IPA merancang pembelajaran mengenai konsep Gaya Apung (Hukum Archimedes).\n\nGuru tersebut ingin peserta didik dapat mengaplikasikan konsep ini melalui eksperimen berkelompok, sambil mengembangkan nilai gotong royong.\n\nGuru tersebut memberikan tugas praktikum kepada setiap kelompok yang terdiri dari 4 orang peserta didik.\n\nPraktikum ini melibatkan percobaan sederhana mengukur berat benda di udara dan di dalam air untuk menentukan gaya apung.\n\nPeserta didik juga diminta untuk mengukur volume air yang dipindahkan oleh benda yang tenggelam.\n\nSetiap anggota kelompok bergiliran melakukan pengukuran, mencatat data, dan secara kolektif membahas serta menyimpulkan hubungan antara gaya apung dan volume air yang dipindahkan.\n\nBagaimanakah rumusan tujuan pembelajaran ranah keterampilan/aplikasi yang paling mencerminkan kinerja praktikum tersebut?",
    "o": [
      "Peserta didik dapat menafsirkan data hasil pengukuran berat benda di udara dan di dalam air untuk menentukan besar gaya apung yang dialami benda melalui kerja sama kelompok.",
      "Peserta didik dapat memprediksi apakah suatu benda akan tenggelam atau terapung berdasarkan massa jenisnya.",
      "Peserta didik dapat mengukur volume air yang dipindahkan oleh benda dengan menggunakan gelas ukur secara individu.",
      "Peserta didik dapat merumuskan definisi Gaya Apung berdasarkan teori yang dijelaskan guru.",
      "Peserta didik dapat mengorganisir langkah-langkah percobaan gaya apung sesuai panduan."
    ],
    "a": 0
  },
  {
    "q": "Pada awal pembelajaran, seorang guru menyajikan sebuah video pendek berjudul \"Batik: Karya Seni yang Menghubungkan Generasi,\" yang menceritakan tentang seorang pengrajin batik yang telah menggeluti seni batik tradisional selama puluhan tahun.\n\nDalam video tersebut, siswa melihat bagaimana pengrajin batik dengan penuh keahlian dan kesabaran menggambar motif-motif batik yang diwariskan oleh nenek moyang, meskipun batik modern dan mesin produksi lebih cepat dan murah.\n\nIa berkata, \"Batik bukan sekadar kain, tapi warisan budaya yang harus dijaga dan dihargai.\"\n\nSetelah menonton, guru mengajak siswa berdiskusi dengan pertanyaan: \"Bagaimana perasaan kalian setelah melihat proses pembuatan batik? Mengapa batik tradisional perlu kita lestarikan? Apa kaitannya dengan rasa cinta tanah air?\"\n\nSiswa aktif berbagi pendapat dan menyatakan rasa bangga terhadap kerajinan batik serta pentingnya memilih produk batik lokal.\n\nBagaimanakah rumusan tujuan pembelajaran ranah sikap yang paling sesuai?",
    "o": [
      "Peserta didik mampu menggambar motif batik dengan teknik tradisional",
      "Peserta didik mampu membandingkan batik tradisional dengan batik modern dalam hal nilai budaya",
      "Peserta didik mampu mengungkapkan rasa bangga terhadap batik sebagai warisan budaya Indonesia",
      "Peserta didik mampu mengungkapkan rasa bangga terhadap kemampuan para pembatik tradisional",
      "Peserta didik mampu memahami proses pembuatan batik tradisional dari awal hingga akhir"
    ],
    "a": 2
  },
  {
    "q": "Bu Sari merencanakan pembelajaran materi luas bangun datar dengan kegiatan berkelompok menggunakan media konkret berupa potongan karton berbentuk persegi, persegi panjang, dan segitiga.\n\nSetiap kelompok diberikan berbagai ukuran karton tersebut. Siswa diajak untuk mengukur panjang dan lebar karton menggunakan penggaris, lalu menghitung luas masing masing bentuk.\n\nSetelah itu, mereka diberi tantangan untuk merancang sebuah taman bermain sederhana dengan menggabungkan beberapa bangun datar tersebut (misalnya: lantai arena berbentuk persegi panjang, kolam berbentuk segitiga, dan taman berbentuk persegi).\n\nSetiap kelompok harus menghitung luas total taman bermain yang mereka buat dan mempresentasikan desain serta perhitungan luasnya dengan alasan yang logis dan kreatif.\n\nDari situasi di atas, tentukan rumusan indikator tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan materi supaya peserta didik memiliki kemampuan berpikir dinamis dan inovatif!",
    "o": [
      "Siswa dapat menyebutkan rumus luas berbagai bangun datar dengan benar berdasarkan contoh karton yang tersedia.",
      "Siswa dapat menghitung luas bangun datar tunggal seperti persegi dan segitiga secara tepat berdasarkan ukuran yang diberikan.",
      "Siswa dapat membandingkan luas dua bangun datar yang berbeda dengan menggunakan satuan cm².",
      "Siswa dapat merancang kombinasi berbagai bangun datar untuk membentuk desain taman bermain secara kreatif dan menghitung luas totalnya secara logis.",
      "Siswa dapat mengidentifikasi nama-nama bangun datar dari bentuk karton yang disediakan."
    ],
    "a": 3
  },
  {
    "q": "Seorang guru Bahasa Indonesia kelas 3 MI merancang pembelajaran PBL dengan materi “Menulis Pengalaman Pribadi” dan “Membaca Nyaring” bertema “Kegiatan di Sekolah”.\n\nBerikut rancangannya:\n1. Tujuan Pembelajaran:\n* Siswa mampu menulis 4 kalimat tentang pengalaman menyenangkan di sekolah\n* Siswa dapat membaca nyaring tulisan sendiri dengan lafal jelas\n* Siswa menunjukkan sikap percaya diri saat presentasi\n2. Skenario PBL:\n* Masalah: “Bagaimana menceritakan pengalaman sekolah kepada teman baru?”\n* Siswa berdiskusi dalam kelompok kecil\n* Menulis pengalaman dan mempresentasikannya dengan ekspresi\nManakah analisis yang PALING TEPAT tentang rancangan ini?",
    "o": [
      "Rancangan efektif karena mengintegrasikan menulis, membaca, dan sikap melalui masalah kontekstual.",
      "Tidak tepat karena seharusnya menggunakan metode ceramah untuk materi pengalaman pribadi.",
      "Siswa kelas 3 belum mampu menulis 4 kalimat sekaligus.",
      "Presentasi kurang relevan dengan pembelajaran Bahasa Indonesia.",
      "Siswa kelas 3 belum mampu menulis 2 kalimat sekaligus."
    ],
    "a": 0
  },
  {
    "q": "Pak Roki merupakan guru PPKN yang akan menyampaikan materi sila ketiga dalam Pancasila dengan menggunakan pendekatan Project Based Learning (PjBL).\n\nUrutan kegiatan yang tepat adalah …. \n1. Guru membagi siswa dalam kelompok kecil. \n2. Setiap kelompok diberikan hak memilih tema. \n3. Setiap kelompok mengumpulkan informasi sesuai tema yang dipilih. \n4. Setiap kelompok menyusun PPT.\n5. PPT dipresentasikan oleh masing-masing kelompok dan mendapatkan penilaian dari guru sesuai dengan keunggulan dan kedalaman tugas.",
    "o": [
      "1-3-2-4-5",
      "1-2-3-4-5",
      "1-3-4-2-5",
      "1-2-5-3-4",
      "1-4-2-3-5"
    ],
    "a": 1
  },
  {
    "q": "Seorang guru IPA MI mengajarkan topik bunyi dan cara menghasilkannya.\n\nSetiap kelompok telah membuat alat musik sederhana dari barang bekas—botol berisi air sebagai tangga nada, gitar kardus dengan karet gelang, dan sejenisnya—dengan pilihan bahan dan bantuan yang disesuaikan minat serta kesiapan masing-masing.\n\nKini guru menyiapkan evaluasi yang harus menegaskan konsep pokok bahwa bunyi bersumber dari getaran dan mengakomodasi kemampuan beragam peserta didik.\n\nPertimbangan evaluasi manakah yang paling selaras dengan prinsip pembelajaran tersebut?",
    "o": [
      "Guru menggunakan rubrik tunggal yang menilai ide dasar, proses pembuatan, dan hasil bunyi setiap kelompok dengan bobot seragam.",
      "Guru menyiapkan rubrik bertingkat yang menilai ide, proses, hasil bunyi, dan penjelasan konsep getaran dengan kriteria berbeda untuk tiga tingkat kesiapan.",
      "Guru memilih bentuk laporan video bagi seluruh kelompok, lalu menilai ketepatan konsep bunyi–getaran berdasarkan durasi presentasi.",
      "Guru menawarkan tiga format pelaporan—poster, video, atau lisan—namun seluruh karya dinilai memakai satu daftar cek konsep akademik.",
      "Guru membedakan tugas akhir menjadi kuis konsep untuk kelompok pemula dan proyek tambahan untuk kelompok mahir, kemudian menggabungkan skor kedua tugas menjadi nilai akhir kelas."
    ],
    "a": 1
  },
  {
    "q": "Seorang guru IPS di kelas IV SD sedang menyusun alur materi ajar tema “Kehidupan Sosial dan Budaya di Abad 21”.\n\nManakah aktivitas yang sesuai dengan karakteristik belajar siswa?",
    "o": [
      "Siswa merancang cara untuk melestarikan nilai-nilai budaya lokal di tengah perubahan zaman, mengamati video tentang perbedaan kehidupan sosial dan budaya masyarakat di masa lalu dan masa kini, menyebutkan contoh kegiatan sosial budaya yang dilakukan di masyarakat sekitar.",
      "Siswa mengamati video tentang perbedaan kehidupan sosial dan budaya masyarakat di masa lalu dan masa kini, menganalisis perubahan sosial budaya yang terjadi dalam kehidupan masyarakat dari masa lalu hingga sekarang, merancang cara untuk melestarikan nilai-nilai budaya lokal di tengah perubahan zaman.",
      "Siswa mengamati video tentang perbedaan kehidupan sosial dan budaya masyarakat di masa lalu dan masa kini, merancang cara untuk melestarikan nilai-nilai budaya lokal di tengah perubahan zaman, menganalisis perubahan sosial budaya yang terjadi dalam kehidupan masyarakat dari masa lalu hingga sekarang.",
      "Siswa menyebutkan contoh kegiatan sosial budaya yang dilakukan di masyarakat sekitar, merancang cara untuk melestarikan nilai-nilai budaya lokal di tengah perubahan zaman, mengamati video tentang perbedaan kehidupan sosial dan budaya masyarakat di masa lalu dan masa kini.",
      "Siswa mengidentifikasi tradisi sosial budaya yang semakin jarang dilakukan di masyarakat, merancang cara untuk melestarikan nilai-nilai budaya lokal di tengah perubahan zaman, menjelaskan definisi tradisi sosial budaya."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran matematika, guru ingin mengajarkan konsep Bilangan Pecahan kepada siswa kelas IV SD.\n\nPeserta didik cenderung aktif, memiliki rasa ingin tahu tinggi, dan lebih mudah memahami konsep jika dikaitkan dengan aktivitas nyata yang mereka alami.\n\nGuru berencana menerapkan pendekatan Deep Learning (DL) agar siswa tidak hanya mampu menghitung pecahan, tetapi juga memahami makna pecahan dalam berbagai konteks kehidupan sehari-hari.\n\nGuru harus merancang alur kegiatan yang memungkinkan siswa mengalami, mengeksplorasi, dan merefleksikan konsep pecahan secara bertahap.\n\nDalam situasi ini, pendekatan alur pembelajaran manakah yang paling tepat?",
    "o": [
      "Guru memperkenalkan gambar potongan pizza, meminta siswa menghitung pecahan bagian pizza, lalu langsung memberikan rumus penjumlahan dan pengurangan pecahan.",
      "Guru membagikan potongan kertas warna-warni berbentuk berbagai pecahan, meminta siswa membentuk sendiri konsep pecahan melalui diskusi kelompok, lalu menyimpulkan prinsip pecahan bersama.",
      "Guru menjelaskan definisi pecahan menggunakan papan tulis, kemudian memberikan soal latihan individu dan meminta siswa mendiskusikannya bersama teman setelah selesai.",
      "Guru menayangkan video tentang pecahan dalam kehidupan nyata, seperti membagi kue ulang tahun, kemudian memberikan latihan soal berdasarkan video tersebut.",
      "Guru meminta siswa membaca buku teks tentang pecahan, lalu membuat mind map tentang jenis-jenis operasi pecahan yang mereka pelajari."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran materi “Ekosistem” di kelas V MI, guru ingin mengembangkan keterampilan berpikir kritis (HOTS) siswa. Manakah aktivitas yang paling tepat?",
    "o": [
      "Siswa diminta menghafal definisi komponen biotik dan abiotik dari buku teks.",
      "Siswa membuat gambar ekosistem sawah dan mewarnainya dengan rapi.",
      "Siswa menganalisis dampak penebangan hutan terhadap rantai makanan di ekosistem tersebut.",
      "Siswa menyebutkan contoh-contoh hewan herbivora, karnivora, dan omnivora.",
      "Siswa menonton video tentang jenis-jenis ekosistem di dunia."
    ],
    "a": 2
  },
  {
    "q": "Seorang guru Fiqih di MA mengajarkan materi tentang “Keluarga Sakinah” dengan menggunakan model Role Playing. Siswa dibagi menjadi kelompok untuk memerankan kasus-kasus dalam keluarga dan mencari solusinya berdasarkan Fiqih.\n\nApa keunggulan utama metode ini dalam membangun karakter siswa?",
    "o": [
      "Siswa menjadi hafal dalil-dalil tentang pernikahan.",
      "Siswa memahami materi secara teoretis saja.",
      "Siswa terlatih dalam empati dan penyelesaian masalah sosial secara islami.",
      "Siswa mendapatkan nilai yang tinggi pada aspek pengetahuan.",
      "Siswa menjadi takut untuk menikah dini."
    ],
    "a": 2
  },
  {
    "q": "Dalam merencanakan evaluasi pembelajaran IPS tentang “Keragaman Budaya”, guru ingin mengukur kompetensi sikap sosial siswa. Manakah instrumen yang paling tepat?",
    "o": [
      "Tes tulis objektif tentang suku-suku di Indonesia.",
      "Lembar observasi partisipasi siswa dalam kerja kelompok.",
      "Tugas membuat makalah tentang sejarah batik.",
      "Tes lisan tentang nama-nama rumah adat.",
      "Kuisioner pengetahuan tentang alat musik tradisional."
    ],
    "a": 1
  },
  {
    "q": "Guru mengajarkan sejarah kebudayaan Islam materi “Strategi Dakwah Nabi di Madinah”. Tujuan pembelajaran adalah agar siswa mampu menganalisis relevansi strategi tersebut di era digital. Manakah indikator HOTS yang tepat?",
    "o": [
      "Menyebutkan tahun hijrah Nabi ke Madinah.",
      "Menceritakan kembali kisah Nabi membangun Masjid Nabawi.",
      "Menemukan persamaan dakwah Nabi di Madinah dengan penggunaan media sosial saat ini.",
      "Menuliskan nama-nama sahabat yang ikut hijrah.",
      "Menggambar peta kota Madinah."
    ],
    "a": 2
  },
  {
    "q": "Pada pembelajaran Matematika materi “Bangun Ruang”, guru menggunakan media aplikasi Geogebra. Apa fungsi utama media tersebut dalam pendekatan TPACK?",
    "o": [
      "Menggantikan peran guru dalam menjelaskan materi.",
      "Membuat siswa sibuk dengan teknologi tanpa memahami konsep.",
      "Memvisualisasikan objek bangun ruang secara dinamis untuk mempermudah pemahaman konsep.",
      "Mengurangi durasi waktu pembelajaran.",
      "Menjadi alat untuk mengerjakan soal ujian secara otomatis."
    ],
    "a": 2
  },
  {
    "q": "Guru melakukan refleksi pembelajaran. Ia menemukan bahwa 80% siswa belum mencapai KKTP pada materi perkalian pecahan. Apa langkah tindak lanjut yang paling tepat?",
    "o": [
      "Melanjutkan ke materi berikutnya karena waktu terbatas.",
      "Memberikan hukuman kepada siswa yang belum tuntas.",
      "Melakukan remedial klasikal dengan metode atau media pembelajaran yang berbeda.",
      "Meminta siswa belajar mandiri di rumah.",
      "Menurunkan kriteria ketercapaian (KKTP)."
    ],
    "a": 2
  },
  {
    "q": "Seorang guru ingin menerapkan prinsip moderasi beragama dalam pembelajaran Akidah Akhlak. Manakah tindakan yang mencerminkan hal tersebut?",
    "o": [
      "Hanya mengajarkan satu pandangan mazhab dan menyalahkan mazhab lain.",
      "Mengajarkan siswa untuk menghargai perbedaan pendapat dalam fiqih sebagai kekayaan intelektual.",
      "Melarang diskusi tentang isu-isu sosial keagamaan.",
      "Mewajibkan semua siswa mengikuti pandangan politik guru.",
      "Membedakan perlakuan kepada siswa berdasarkan latar belakang organisasinya."
    ],
    "a": 1
  },
  {
    "q": "Dalam PjBL materi “Proyek Sejarah lokal”, siswa kesulitan mencari sumber primer. Tindakan guru sebagai fasilitator adalah...",
    "o": [
      "Menyuruh siswa mencari sendiri sampai ketemu.",
      "Memberikan sumber sekunder saja dan meminta siswa menyimpulkan.",
      "Mengarahkan siswa ke perpustakaan daerah atau membantu menghubungkan dengan narasumber sejarah setempat.",
      "Mengganti tema proyek menjadi tema yang sumbernya banyak di internet.",
      "Mengambil alih pencarian sumber agar cepat selesai."
    ],
    "a": 2
  },
  {
    "q": "Manakah rumusan indikator tujuan pembelajaran yang mencerminkan aspek 'kreatif' pada profil pelajar Pancasila?",
    "o": [
      "Siswa dapat menyebutkan definisi teks laporan hasil observasi.",
      "Siswa dapat membuat infografis menarik tentang siklus air berdasarkan data pengamatan.",
      "Siswa dapat menjawab soal pilihan ganda tentang ekosistem.",
      "Siswa dapat menyalin puisi yang ada di buku paket.",
      "Siswa dapat membaca nyaring teks prosedur."
    ],
    "a": 1
  },
  {
    "q": "Dalam evaluasi pembelajaran Fiqih, guru menemukan soal yang terlalu sulit dan tidak bisa dijawab oleh semua siswa. Analisis kualitas soal menunjukkan...",
    "o": [
      "Soal memiliki tingkat kesukaran yang ideal.",
      "Soal memiliki tingkat kesukaran yang rendah.",
      "Soal memiliki tingkat kesukaran yang tinggi (terlalu sukar).",
      "Soal memiliki daya pembeda yang baik.",
      "Soal valid dan reliabel."
    ],
    "a": 2
  },
    [
  {
    "q": "Dalam pembelajaran materi “Peradaban Islam masa Abbasiyah”, guru meminta siswa menganalisis perkembangan ilmu pengetahuan dan mengaitkannya dengan kondisi Indonesia saat ini. Aktivitas ini mengembangkan kemampuan berpikir...",
    "o": [
      "Hafalan (C1)",
      "Pemahaman (C2)",
      "Aplikasi (C3)",
      "Analisis dan Evaluasi (HOTS)",
      "Kreativitas (C6)"
    ],
    "a": 3
  },
  {
    "q": "Seorang guru ingin menerapkan penilaian portofolio dalam mata pelajaran SKI. Langkah pertama yang harus dilakukan guru tersebut adalah...",
    "o": [
      "Mengumpulkan seluruh hasil karya siswa tanpa seleksi.",
      "Menentukan tujuan dan kompetensi yang akan dinilai.",
      "Meminta siswa menyusun karya berdasarkan urutan abjad.",
      "Memberikan nilai akhir langsung pada karya siswa.",
      "Memamerkan karya siswa di ruang kelas."
    ],
    "a": 1
  },
  {
    "q": "Guru mengajarkan materi “Sejarah Wali Songo”. Siswa diminta membuat peta perjalanan dakwah Wali Songo menggunakan aplikasi Google Earth. Pendekatan pembelajaran ini mencerminkan...",
    "o": [
      "Pembelajaran berpusat pada guru (Teacher Centered).",
      "Pemanfaatan teknologi untuk visualisasi sejarah (TPACK).",
      "Pembelajaran tradisional dengan buku paket.",
      "Metode ceramah dan tanya jawab.",
      "Evaluasi sumatif di akhir semester."
    ],
    "a": 1
  },
  {
    "q": "Dalam materi “Akhlak Terpuji”, guru mengamati bahwa siswa sering berkata tidak sopan kepada teman. Langkah pedagogik yang paling tepat adalah...",
    "o": [
      "Memberikan hukuman fisik kepada siswa yang berkata kasar.",
      "Mengabaikan perilaku tersebut karena dianggap wajar bagi anak-anak.",
      "Melakukan konseling individu dan memberikan pembiasaan akhlak mulia melalui pendekatan personal.",
      "Melaporkan perilaku siswa kepada kepala sekolah untuk dikeluarkan.",
      "Memarahi siswa di depan kelas."
    ],
    "a": 2
  },
  {
    "q": "Apa tujuan utama penggunaan studi kasus dalam pembelajaran Fiqih di Madrasah Aliyah?",
    "o": [
      "Agar siswa hafal ayat-ayat fiqih.",
      "Untuk melatih kemampuan analisis siswa dalam memecahkan masalah kontekstual berdasarkan prinsip hukum Islam.",
      "Agar pembelajaran menjadi lebih lama.",
      "Untuk mengurangi materi yang harus diajarkan guru.",
      "Agar siswa tidak perlu membawa buku paket."
    ],
    "a": 1
  },
  {
    "q": "Guru menemukan bahwa hasil belajar siswa sangat rendah setelah materi selesai. Guru menyadari bahwa media yang digunakan kurang menarik. Apa yang harus dilakukan guru?",
    "o": [
      "Tetap menggunakan media tersebut pada tahun depan.",
      "Melakukan evaluasi terhadap media pembelajaran dan menggantinya dengan media yang lebih interaktif.",
      "Menyalahkan siswa karena kurang belajar.",
      "Mengubah tujuan pembelajaran menjadi lebih mudah.",
      "Memberikan nilai remedial tanpa perbaikan proses."
    ],
    "a": 1
  },
  {
    "q": "Dalam konteks moderasi beragama, guru SKI harus bersikap netral dan objektif saat membahas peristiwa sejarah yang sensitif. Sikap ini disebut...",
    "o": [
      "Fanatik.",
      "Tasamuh (Toleransi).",
      "Tawasuth (Moderat).",
      "Ta'awun (Tolong-menolong).",
      "Tadaabur (Perenungan)."
    ],
    "a": 2
  },
  {
    "q": "Komponen yang harus ada dalam modul ajar kurikulum merdeka pada bagian komponen inti adalah...",
    "o": [
      "Identitas sekolah.",
      "Sarana dan prasarana.",
      "Tujuan pembelajaran dan langkah kegiatan pembelajaran.",
      "Profil pelajar pancasila.",
      "Glosarium."
    ],
    "a": 2
  },
  {
    "q": "Seorang guru ingin mengukur keterampilan siswa dalam berpidato materi “Dakwah”. Teknik penilaian yang tepat adalah...",
    "o": [
      "Tes tulis pilihan ganda.",
      "Tes tulis esai.",
      "Penilaian kinerja (Performance Assessment).",
      "Penilaian antar teman.",
      "Wawancara."
    ],
    "a": 2
  },
  {
    "q": "Manakah yang merupakan contoh rumusan tujuan pembelajaran yang spesifik dan terukur (SMART)?",
    "o": [
      "Siswa memahami materi sejarah.",
      "Siswa mengetahui Wali Songo.",
      "Siswa mampu menjelaskan tiga strategi dakwah Sunan Kalijaga dengan tepat.",
      "Siswa belajar sejarah dengan senang.",
      "Siswa menghormati tokoh Islam."
    ],
    "a": 2
  },
  {
    "q": "Seorang guru Fiqih ingin menerapkan model pembelajaran Problem Based Learning (PBL) pada materi 'Hukum Waris'. Masalah nyata yang paling relevan untuk diangkat adalah...",
    "o": [
      "Menghafal ayat-ayat waris dalam Al-Qur'an.",
      "Pembagian warisan yang tidak sesuai dengan ketentuan Fiqih di suatu masyarakat.",
      "Mengerjakan soal-soal latihan perhitungan waris.",
      "Membaca buku teks tentang sejarah ilmu faraid.",
      "Mendengarkan ceramah tentang keutamaan ilmu waris."
    ],
    "a": 1
  },
  {
    "q": "Guru mengajarkan nilai-nilai moderasi beragama dalam materi 'Sejarah Bani Umayyah'. Tindakan yang tepat adalah...",
    "o": [
      "Mengagungkan satu khalifah dan merendahkan khalifah lain.",
      "Menekankan pada aspek pencapaian ilmu pengetahuan dan keterbukaan terhadap budaya lain pada masa tersebut.",
      "Fokus pada konflik politik yang terjadi tanpa mengambil hikmah.",
      "Mengajarkan bahwa Bani Umayyah adalah dinasti terbaik.",
      "Melarang siswa mempelajari dinasti lain."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran TPACK, guru menggunakan VR (Virtual Reality) untuk membawa siswa 'berkunjung' ke situs sejarah Islam di Cordoba. Manakah aspek TPACK yang menonjol?",
    "o": [
      "Technological Content Knowledge (TCK).",
      "Technological Pedagogical Knowledge (TPK).",
      "Technological Knowledge (TK).",
      "Pedagogical Content Knowledge (PCK).",
      "Content Knowledge (CK)."
    ],
    "a": 0
  },
  {
    "q": "Apa fungsi umpan balik (feedback) yang konstruktif dalam asesmen formatif?",
    "o": [
      "Untuk memberikan nilai akhir kepada siswa.",
      "Untuk memberi tahu siswa kelemahan mereka tanpa saran perbaikan.",
      "Untuk membantu siswa memahami sejauh mana kemajuan belajar mereka dan apa yang perlu ditingkatkan.",
      "Untuk meranking siswa berdasarkan kemampuan.",
      "Untuk menggantikan fungsi nilai rapor."
    ],
    "a": 2
  },
  {
    "q": "Dalam materi 'Zakat', guru meminta siswa melakukan simulasi penghitungan zakat profesi. Aktivitas ini berada pada tingkat kognitif...",
    "o": [
      "C1 (Mengingat).",
      "C2 (Memahami).",
      "C3 (Mengaplikasikan).",
      "C4 (Menganalisis).",
      "C6 (Menciptakan)."
    ],
    "a": 2
  },
  {
    "q": "Guru profesional harus memiliki komitmen tinggi terhadap tugasnya. Contoh perilaku tersebut adalah...",
    "o": [
      "Datang ke kelas tepat waktu dan mempersiapkan materi pembelajaran dengan baik.",
      "Meninggalkan kelas sebelum jam pelajaran usai.",
      "Mengerjakan tugas administrasi sekolah saat mengajar.",
      "Menggunakan jam mengajar untuk urusan pribadi.",
      "Mengabaikan siswa yang bertanya."
    ],
    "a": 0
  },
  {
    "q": "Dalam konteks pembelajaran berpusat pada siswa, guru berperan sebagai...",
    "o": [
      "Sumber utama pengetahuan.",
      "Fasilitator dan motivator belajar.",
      "Pengawas ketat kegiatan siswa.",
      "Penentu tunggal hasil belajar.",
      "Pemberi informasi satu arah."
    ],
    "a": 1
  },
  {
    "q": "Manakah pernyataan yang paling tepat menggambarkan evaluasi pembelajaran?",
    "o": [
      "Evaluasi hanya dilakukan di akhir semester.",
      "Evaluasi bertujuan untuk mengukur keberhasilan proses dan hasil pembelajaran.",
      "Evaluasi hanya bertugas memberikan nilai kepada siswa.",
      "Evaluasi tidak perlu memperhatikan tujuan pembelajaran.",
      "Evaluasi hanya dilakukan oleh kepala sekolah."
    ],
    "a": 1
  },
  {
    "q": "Guru ingin mengajarkan nilai 'kejujuran' pada materi 'Jual Beli'. Metode yang paling efektif adalah...",
    "o": [
      "Metode ceramah tentang definisi kejujuran.",
      "Metode diskusi kelompok tentang contoh kejujuran.",
      "Metode pembiasaan dan modeling (keteladanan) melalui simulasi transaksi jual beli.",
      "Menghafal ayat tentang kejujuran.",
      "Tes tulis tentang perilaku jujur."
    ],
    "a": 2
  },
  {
    "q": "Proses pembelajaran di era digital menuntut guru untuk...",
    "o": [
      "Menghindari penggunaan teknologi.",
      "Menguasai dan mengintegrasikan teknologi dalam pembelajaran secara bijak (TPACK).",
      "Menyerahkan seluruh proses belajar kepada teknologi.",
      "Fokus pada hafalan konvensional.",
      "Mengurangi interaksi dengan siswa."
    ],
    "a": 1
  }
]
