[
  {
    "q": "1. Disajikan deskripsi materi tentang Pengenalan Huruf dan Kata, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah sikap yang paling sesuai dengan indikator tujuan supaya peserta didik dapat meningkatkan keimanan, ketakwaan dan akhlak mulia.\n\nSeorang guru kelas I Madrasah Ibtidaiyah akan melaksanakan pembelajaran pengenalan huruf dan kata sederhana. Guru ingin menanamkan nilai religius melalui kegiatan belajar membaca awal. Oleh karena itu, guru perlu merumuskan tujuan pembelajaran pada ranah sikap yang sesuai dengan karakteristik peserta didik kelas awal.\n\nRumusan tujuan pembelajaran ranah sikap yang paling tepat adalah",
    "o": [
      "Murid mampu menyebutkan huruf vokal dan konsonan dengan lafal yang benar",
      "Murid dapat membaca kata sederhana dengan lancar dan tepat",
      "Murid menunjukkan sikap syukur dan percaya diri sebagai wujud karunia Tuhan dalam proses belajar membaca huruf dan kata sederhana",
      "Murid mampu menuliskan kata sederhana menggunakan ejaan yang benar",
      "Murid dapat mengurutkan huruf alfabet secara tepat"
    ],
    "a": 2
  },
  {
    "q": "2. Disajikan pernyataan materi tentang pancasila dan keluarga, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan indikator supaya peserta didik mampu berpikir kritis.\n\nSeorang guru kelas IV Madrasah Ibtidaiyah merencanakan pembelajaran materi Pancasila dalam Kehidupan Keluarga. Guru ingin peserta didik tidak hanya memahami makna setiap sila Pancasila, tetapi juga mampu mengaitkan dan menilai penerapannya dalam berbagai aktivitas keluarga, seperti pembagian tugas rumah, pengambilan keputusan bersama, dan sikap saling menghargai.\n\nOleh karena itu, guru perlu merumuskan tujuan pembelajaran pada ranah pengetahuan yang sesuai.\n\nRumusan tujuan pembelajaran ranah pengetahuan yang paling tepat adalah ...",
    "o": [
      "Murid dapat menyebutkan sila-sila Pancasila secara berurutan",
      "Murid dapat menjelaskan bunyi setiap sila Pancasila dengan lafal yang tepat",
      "Murid mampu menganalisis contoh penerapan nilai-nilai Pancasila dalam berbagai kegiatan kehidupan keluarga secara logis",
      "Murid menunjukkan sikap patuh dan hormat kepada orang tua di rumah",
      "Murid membiasakan perilaku hidup rukun dan saling tolong-menolong dalam keluarga"
    ],
    "a": 2
  },
  {
    "q": "3. Disajikan pernyataan materi tentang teori dan aplikasi materi ajar Ilmu Fisik, mahasiswa dapat menentukan rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai dengan indikator supaya peserta didik memiliki semangat gotong royong.\n\nDalam pembelajaran Ilmu Fisik kelas VI, guru merancang kegiatan praktik sederhana tentang gaya dan gerak menggunakan alat-alat sederhana di sekitar sekolah.\n\nKegiatan dilakukan secara berkelompok, di mana setiap anggota memiliki tugas berbeda, seperti menyiapkan alat, melakukan percobaan, mencatat hasil, dan mempresentasikan temuan. Guru berharap kegiatan ini dapat melatih keterampilan bekerja sama, berbagi peran, dan tanggung jawab antar peserta didik.\n\nRumusan tujuan pembelajaran ranah keterampilan yang paling tepat adalah ...",
    "o": [
      "Murid dapat menjelaskan pengertian gaya dan gerak secara lisan dengan benar",
      "Murid dapat menyebutkan contoh gaya dan gerak dalam kehidupan sehari-hari",
      "Murid menunjukkan sikap tanggung jawab dan disiplin selama kegiatan berlangsung",
      "Murid dapat menghafal langkah-langkah percobaan gaya dan gerak dengan urut",
      "Murid mampu melakukan percobaan tentang gaya dan gerak secara berkelompok dengan pembagian tugas dan kerja sama yang baik"
    ],
    "a": 4
  },
  {
    "q": "4. Disajikan deskripsi materi tentang Bilangan, mahasiswa dapat menentukan rumusan indikator tujuan pembelajaran ranah pengetahuan yang paling sesuai dengan materi supaya peserta didik memiliki kemampuan berpikir dinamis dan inovatif.\n\nPada pembelajaran materi bilangan, guru mengajak peserta didik melakukan eksplorasi menggunakan balok angka dan kartu tantangan. Setiap kelompok diminta menyusun beberapa bilangan berbeda (bilangan genap, ganjil, dan kelipatan tertentu) untuk memenuhi suatu target nilai yang sama. Murid harus menemukan lebih dari satu cara penyusunan, kemudian mempresentasikan alasan pemilihan bilangan serta pola yang mereka temukan selama proses penyusunan.\n\nBerdasarkan situasi pembelajaran tersebut, rumusan indikator tujuan pembelajaran ranah pengetahuan yang paling sesuai agar peserta didik memiliki kemampuan berpikir dinamis dan inovatif adalah …",
    "o": [
      "Murid dapat mengidentifikasi bilangan genap dan ganjil dengan benar.",
      "Murid dapat menghitung hasil penjumlahan beberapa bilangan sesuai prosedur.",
      "Murid dapat menyebutkan contoh bilangan kelipatan suatu bilangan tertentu.",
      "Murid dapat membuat kombinasi bilangan untuk mencapai nilai tertentu secara logis dan kreatif.",
      "Murid dapat memilih bilangan yang sesuai dengan instruksi guru."
    ],
    "a": 3
  },
  {
    "q": "5. Disajikan deskripsi aktivitas pembelajaran guru dalam perencanaan tujuan pembelajaran pada materi bahasa Indonesia dengan pendekatan PBL, mahasiswa dapat menganalisis materi ajar membaca dan menulis kalimat sederhana berdasarkan struktur keilmuan pada perencanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik\n\nDalam pembelajaran Bahasa Indonesia kelas I Madrasah Ibtidaiyah, guru menemukan bahwa murid masih kesulitan menyusun kalimat sederhana yang sesuai dengan gambar. Untuk mengatasi masalah tersebut, guru merancang pembelajaran berbasis masalah dengan mengajak murid mengamati gambar aktivitas sehari-hari, mendiskusikan kata-kata yang sesuai, lalu menyusun dan membaca kalimat sederhana secara bertahap.\n\nGuru perlu menentukan materi ajar yang paling tepat agar proses belajar berjalan sesuai dengan pendekatan PBL dan tahap perkembangan murid.\n\nBerdasarkan kasus tersebut, materi ajar yang paling tepat dipilih guru adalah …",
    "o": [
      "Daftar kosakata tanpa konteks gambar untuk dilatih pengucapannya",
      "Kumpulan contoh kalimat sederhana yang dibacakan guru untuk dihafalkan",
      "Lembar kerja menyalin kalimat sederhana dari buku teks",
      "Teks bacaan pendek yang memuat kalimat sederhana tanpa ilustrasi gambar",
      "Materi berbasis gambar kontekstual yang memuat masalah sederhana, dilengkapi aktivitas mengidentifikasi kata, menyusun kalimat, serta membaca dan menuliskan kalimat hasil pemecahan masalah"
    ],
    "a": 4
  },
  {
    "q": "6. Disajikan deskripsi aktivitas guru dalam pelaksanaan tujuan pembelajaran pada materi Pendidikan Pancasila dan Kewarganegaraan dengan pendekatan PjBL, mahasiswa dapat menganalisis materi kehidupan sosial di masyarakat berdasarkan struktur keilmuan pada pelaksanaan tujuan pembelajaran sesuai dengan karakteristik peserta didik.\n\nSeorang guru kelas IV SD melaksanakan pembelajaran Pendidikan Pancasila dan Kewarganegaraan (PPKn) menggunakan pendekatan Project Based Learning (PjBL) pada materi kehidupan sosial di masyarakat. Guru menugaskan peserta didik untuk melakukan wawancara sederhana dengan warga sekitar rumah mengenai bentuk musyawarah dan kepatuhan terhadap aturan lingkungan. Hasil wawancara kemudian disusun dalam laporan proyek kelompok dan dipresentasikan di kelas untuk didiskusikan bersama.\n\nBerdasarkan deskripsi tersebut, analisis yang paling tepat terkait pelaksanaan tujuan pembelajaran adalah …",
    "o": [
      "Kegiatan pembelajaran belum sesuai dengan karakteristik peserta didik karena kegiatan wawancara terlalu kompleks untuk siswa sekolah dasar.",
      "Pelaksanaan pembelajaran telah mencerminkan struktur keilmuan PPKn karena mengintegrasikan konsep kehidupan sosial, nilai musyawarah, dan pengalaman nyata peserta didik melalui proyek.",
      "Pembelajaran kurang tepat karena PjBL tidak menuntut adanya kegiatan presentasi hasil proyek di kelas.",
      "Tujuan pembelajaran tidak tercapai karena guru memberikan kebebasan terlalu besar kepada peserta didik dalam menentukan bentuk proyek.",
      "Materi pembelajaran tidak sesuai dengan tujuan PPKn karena lebih menekankan keterampilan bahasa daripada pemahaman nilai kewarganegaraan."
    ],
    "a": 1
  },
  {
    "q": "7. Disajikan narasi kasus guru melakukan evaluasi pembelajaran pada materi Ilmu Pengetahuan Alam dengan pendekatan DBL, mahasiswa dapat menguraikan materi Ilmu Kehidupan atau Getaran dan Gelombang dalam evaluasi tujuan pembelajaran sesuai dengan karakteristik peserta didik.\n\nSeorang guru IPA kelas V SD melaksanakan pembelajaran dengan pendekatan Differentiated Based Learning (DBL) pada materi Ilmu Kehidupan (ciri-ciri makhluk hidup). Pada tahap evaluasi, guru merancang penilaian yang berbeda sesuai dengan kebutuhan belajar peserta didik. Sebagian murid diminta mengelompokkan gambar makhluk hidup berdasarkan cirinya, sebagian lain menjelaskan hasil pengamatan makhluk hidup di lingkungan sekolah secara lisan, dan murid dengan kesiapan tinggi diminta menyimpulkan hubungan antara ciri makhluk hidup dan cara bertahan hidupnya.\n\nBerdasarkan narasi tersebut, evaluasi tujuan pembelajaran yang paling tepat adalah …",
    "o": [
      "Mengukur kemampuan murid menguraikan konsep ilmu kehidupan melalui bentuk evaluasi yang berbeda sesuai karakteristik dan kesiapan belajar peserta didik.",
      "Menguji kemampuan murid menghafal daftar ciri-ciri makhluk hidup secara seragam.",
      "Menilai kemampuan murid menjawab soal pilihan ganda yang sama tanpa mempertimbangkan perbedaan kemampuan.",
      "Menentukan keberhasilan pembelajaran berdasarkan kerapian gambar yang dibuat murid.",
      "Mengukur kecepatan murid dalam menyelesaikan tugas evaluasi sebagai indikator utama keberhasilan."
    ],
    "a": 0
  },
  {
    "q": "8. Disajikan deskripsi penerapan pembelajaran dengan materi menulis cerita sederhana dan membaca nyaring sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan materi pembelajaran.\n\nSeorang guru kelas II SD merencanakan pembelajaran Bahasa Indonesia pada materi menulis cerita sederhana dan membaca nyaring. Guru memulai pembelajaran dengan menyajikan masalah berupa teks cerita bergambar yang alurnya tidak runtut, sehingga peserta didik kesulitan memahami isi cerita. Guru kemudian mengajak peserta didik berdiskusi untuk mengidentifikasi bagian cerita yang tidak sesuai, menyusun kembali alur cerita, menuliskan cerita sederhana secara berkelompok, dan membacakan hasilnya dengan nyaring di depan kelas.\n\nBerdasarkan deskripsi tersebut, rancangan pembelajaran berbasis masalah yang paling tepat adalah …",
    "o": [
      "Pembelajaran difokuskan pada kegiatan membaca nyaring saja tanpa mengaitkan dengan proses menulis cerita.",
      "Guru memberikan latihan menulis cerita secara individu tanpa diskusi untuk menghemat waktu pembelajaran.",
      "Murid diminta menghafal unsur-unsur cerita sebelum menulis dan membaca cerita di depan kelas.",
      "Pembelajaran diawali dengan permasalahan kontekstual, dilanjutkan diskusi, penulisan cerita sederhana, dan kegiatan membaca nyaring sebagai solusi atas masalah yang dihadapi peserta didik.",
      "Guru menjelaskan struktur cerita secara rinci, kemudian peserta didik menyalin contoh cerita dan membacanya dengan nyaring."
    ],
    "a": 3
  },
  {
    "q": "9. Disajikan pernyataan penerapan pembelajaran dengan materi menghargai keragaman sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan pengetahuan pedagogik.\n\nSeorang guru kelas IV SD melaksanakan pembelajaran PPKn pada materi menghargai keragaman suku, budaya, dan pendapat. Guru memulai pembelajaran dengan menyajikan kasus berupa terjadinya perbedaan pendapat antar siswa dalam kerja kelompok yang menyebabkan konflik kecil. Murid kemudian diajak untuk mendiskusikan penyebab masalah, mencari solusi bersama, dan menyusun kesepakatan sikap saling menghargai yang dapat diterapkan dalam kehidupan kelas sehari-hari.\n\nBerdasarkan pernyataan tersebut, rancangan pembelajaran berbasis masalah yang paling tepat sesuai dengan pengetahuan pedagogik adalah …",
    "o": [
      "Pembelajaran diawali dengan penyajian masalah kontekstual tentang perbedaan, dilanjutkan diskusi kelompok, pencarian solusi, dan refleksi untuk menanamkan sikap menghargai keragaman.",
      "Guru menjelaskan konsep keragaman secara teoritis, kemudian peserta didik mencatat dan menghafalkan pengertian keragaman.",
      "Murid diminta membaca buku teks secara mandiri tanpa diskusi agar pembelajaran berjalan efektif.",
      "Guru langsung memberikan aturan kelas tanpa melibatkan peserta didik dalam pemecahan masalah yang terjadi.",
      "Pembelajaran difokuskan pada pemberian tugas individu tanpa mengaitkan dengan masalah nyata yang dialami peserta didik."
    ],
    "a": 0
  },
  {
    "q": "10. Disajikan deskripsi kasus penerapan pembelajaran dengan materi Makhluk Hidup dan Lingkungan atau Perubahan Alam, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan pengetahuan teknologi.\n\nSeorang guru kelas V SD melaksanakan pembelajaran IPA pada materi Perubahan Alam dan Dampaknya terhadap Lingkungan. Guru memulai pembelajaran dengan menampilkan video singkat tentang banjir dan tanah longsor melalui perangkat digital. Murid kemudian diminta mengidentifikasi penyebab peristiwa tersebut, mencari informasi tambahan dari sumber digital yang aman dan sesuai usia, serta menyusun solusi sederhana untuk menjaga lingkungan agar terhindar dari bencana alam.\n\nBerdasarkan deskripsi kasus tersebut, rancangan pembelajaran berbasis masalah yang paling tepat sesuai dengan pengetahuan teknologi adalah …",
    "o": [
      "Menyampaikan materi perubahan alam melalui ceramah tanpa menggunakan media teknologi agar pembelajaran lebih terkontrol.",
      "Mengintegrasikan media digital sebagai pemicu masalah, memfasilitasi pencarian informasi melalui teknologi, dan mengarahkan peserta didik menyusun solusi berbasis hasil analisis masalah lingkungan.",
      "Memberikan tugas membaca buku teks secara mandiri tanpa melibatkan teknologi digital.",
      "Menugaskan peserta didik menyalin rangkuman materi dari internet tanpa diskusi dan pemecahan masalah.",
      "Menggunakan teknologi hanya untuk menampilkan materi, tanpa mengaitkannya dengan aktivitas pemecahan masalah."
    ],
    "a": 1
  },
  {
    "q": "11. Disajikan deskripsi kasus penerapan pembelajaran dengan materi Sejarah Kebudayaan Islam atau Seni Budaya, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan pengetahuan konten.\n\nSeorang guru kelas VI SD/MI akan mengajarkan materi Sejarah Kebudayaan Islam tentang perjuangan Nabi Muhammad SAW di Madinah. Guru ingin peserta didik memahami nilai-nilai toleransi dan strategi dakwah pada masa itu, serta mampu mengaitkannya dengan kehidupan berbangsa saat ini. Namun, peserta didik cenderung bosan jika pembelajaran hanya berupa ceramah.\n\nBerdasarkan deskripsi kasus tersebut, rancangan pembelajaran berbasis masalah yang paling tepat sesuai dengan pengetahuan konten adalah ...",
    "o": [
      "Guru menugaskan peserta didik membaca buku teks sejarah secara mandiri dan membuat rangkuman.",
      "Guru menayangkan video dokumenter tentang sejarah Madinah dan meminta peserta didik mencatat poin penting.",
      "Guru menyajikan masalah dilematis tentang konflik sosial saat ini, kemudian mengajak peserta didik mencari solusi berdasarkan strategi dakwah Nabi dalam piagam Madinah.",
      "Guru memberikan kuis pilihan ganda tentang tokoh-tokoh yang berperan dalam sejarah Madinah.",
      "Guru meminta peserta didik menghafal tahun dan tempat kejadian penting dalam sejarah Islam."
    ],
    "a": 2
  },
  {
    "q": "12. Disajikan deskripsi kasus tentang pembelajaran tematik terpadu, mahasiswa dapat menentukan bentuk penilaian autentik yang tepat untuk mengukur pencapaian kompetensi sikap dan keterampilan peserta didik.\n\nDalam pembelajaran tematik terpadu tema \"Lingkungan Bersih\", guru kelas II SD/MI ingin menilai sikap peduli lingkungan dan keterampilan peserta didik dalam memilah sampah organik dan anorganik. Pembelajaran dilakukan melalui praktik langsung di lingkungan sekolah.\n\nBentuk penilaian autentik yang paling tepat untuk mengukur pencapaian kompetensi sikap dan keterampilan tersebut adalah ...",
    "o": [
      "Tes tulis objektif tentang jenis-jenis sampah.",
      "Lembar observasi sikap perilaku peduli lingkungan dan rubrik penilaian praktik memilah sampah.",
      "Wawancara dengan orang tua tentang kebiasaan siswa di rumah.",
      "Portofolio kumpulan gambar lingkungan bersih.",
      "Tes lisan tentang pengertian sampah organik dan anorganik."
    ],
    "a": 1
  },
  {
    "q": "13. Disajikan deskripsi kasus pembelajaran Bahasa Indonesia, mahasiswa dapat menentukan metode pembelajaran yang paling sesuai untuk meningkatkan keterampilan berbicara peserta didik.\n\nSeorang guru kelas V SD/MI mendapati bahwa peserta didik sering merasa gugup dan kurang percaya diri saat diminta berbicara di depan kelas. Guru ingin meningkatkan keterampilan berbicara peserta didik melalui kegiatan bercerita tentang pengalaman liburan dengan percaya diri dan runtut.\n\nMetode pembelajaran yang paling sesuai untuk meningkatkan keterampilan berbicara peserta didik adalah ...",
    "o": [
      "Metode ceramah tentang cara berbicara yang baik.",
      "Metode diskusi kelompok kecil untuk membahas tema cerita.",
      "Metode demonstrasi cara bercerita oleh guru.",
      "Metode bermain peran (role playing) atau bercerita berantai dalam kelompok.",
      "Metode penugasan menulis cerita sebelum dibacakan."
    ],
    "a": 3
  },
  {
    "q": "14. Disajikan deskripsi kasus pembelajaran Matematika, mahasiswa dapat menentukan strategi remedial yang tepat bagi peserta didik yang belum mencapai Kriteria Ketercapaian Tujuan Pembelajaran (KKTP).\n\nSetelah dilakukan asesmen sumatif pada materi pecahan, ditemukan 5 dari 30 peserta didik di kelas IV SD/MI belum mencapai KKTP. Kesulitan utama mereka adalah memahami konsep dasar pecahan sebagai bagian dari keseluruhan menggunakan media konkret.\n\nStrategi remedial yang paling tepat untuk peserta didik tersebut adalah ...",
    "o": [
      "Memberikan tambahan tugas latihan soal yang lebih banyak di rumah.",
      "Meminta peserta didik mempelajari kembali buku teks secara mandiri.",
      "Mengulang penjelasan materi di depan seluruh kelas dengan media yang sama.",
      "Memberikan bimbingan perorangan atau kelompok kecil menggunakan media manipulatif secara intensif.",
      "Memberikan soal remedial yang sama dengan soal tes sumatif sebelumnya."
    ],
    "a": 3
  },
  {
    "q": "15. Disajikan kasus tentang media pembelajaran, mahasiswa dapat memilih media pembelajaran yang tepat untuk menjelaskan konsep abstrak dalam mata pelajaran IPA.\n\nSeorang guru IPA kelas VI SD/MI akan mengajarkan tentang sistem tata surya. Konsep ini bersifat abstrak karena peserta didik tidak dapat mengamati secara langsung pergerakan planet-planet yang luas. Guru ingin peserta didik memahami urutan planet, rotasi, dan revolusi dengan mudah.\n\nMedia pembelajaran yang paling tepat untuk menjelaskan konsep tersebut adalah ...",
    "o": [
      "Gambar poster tata surya di dinding kelas.",
      "Buku teks pelajaran IPA dengan ilustrasi.",
      "Model tiga dimensi (torso) tata surya atau aplikasi simulasi ruang angkasa berbasis digital.",
      "Papan tulis untuk menggambar lintasan planet.",
      "Video dokumenter kehidupan di bumi."
    ],
    "a": 2
  },
  {
    "q": "16. Disajikan kasus tentang interaksi sosial dalam pembelajaran, mahasiswa dapat menentukan langkah yang tepat untuk menciptakan lingkungan belajar yang kondusif dan inklusif.\n\nDi kelas IV SD/MI, terdapat beberapa peserta didik yang kurang aktif dan cenderung terisolasi saat diskusi kelompok. Guru ingin memastikan seluruh peserta didik memiliki kesempatan yang sama untuk berpartisipasi dan merasa dihargai dalam proses pembelajaran.\n\nLangkah yang paling tepat untuk menciptakan lingkungan belajar yang kondusif dan inklusif adalah ...",
    "o": [
      "Membiarkan peserta didik memilih kelompoknya sendiri.",
      "Menegur peserta didik yang diam agar lebih aktif berbicara.",
      "Menerapkan struktur kelompok kooperatif dengan pembagian peran yang jelas dan adil.",
      "Mengurangi porsi diskusi dan memperbanyak tugas individu.",
      "Memindahkan peserta didik yang pendiam ke bangku paling depan."
    ],
    "a": 2
  },
  {
    "q": "17. Disajikan deskripsi kasus tentang refleksi pembelajaran, mahasiswa dapat menentukan tindakan reflektif yang tepat untuk meningkatkan kualitas pembelajaran selanjutnya.\n\nSeorang guru baru saja selesai mengajarkan materi perkalian bilangan dua angka. Hasil tes menunjukkan bahwa sebagian besar peserta didik salah dalam melakukan prosedur perkalian susun, meskipun mereka sudah hafal tabel perkalian dasar. Guru merasa perlu melakukan refleksi untuk memperbaiki proses pengajaran.\n\nTindakan reflektif yang paling tepat untuk meningkatkan kualitas pembelajaran selanjutnya adalah ...",
    "o": [
      "Menyalahkan peserta didik karena tidak teliti saat mengerjakan soal.",
      "Langsung melanjutkan ke materi pembagian karena waktu yang terbatas.",
      "Menganalisis hasil tes untuk mengetahui letak kesalahan prosedur dan merancang ulang kegiatan latihan menggunakan media visual.",
      "Memberikan hukuman kepada peserta didik yang nilainya rendah.",
      "Meminta peserta didik mengulang pembelajaran dari awal secara mandiri."
    ],
    "a": 2
  },
  {
    "q": "18. Disajikan deskripsi kasus tentang pemanfaatan teknologi informasi dan komunikasi (TIK), mahasiswa dapat menentukan penggunaan TIK yang paling tepat untuk mendukung pembelajaran mandiri.\n\nGuru ingin mendorong peserta didik kelas V SD/MI untuk melakukan pembelajaran mandiri mengenai keanekaragaman budaya Indonesia. Guru memiliki akses internet dan beberapa perangkat komputer di madrasah.\n\nPenggunaan TIK yang paling tepat untuk mendukung pembelajaran mandiri adalah ...",
    "o": [
      "Menampilkan video pembelajaran di proyektor untuk ditonton bersama.",
      "Guru menjelaskan materi menggunakan presentasi PowerPoint.",
      "Menugaskan peserta didik mencari informasi dari situs web yang ditentukan dan membuat infografis sederhana.",
      "Meminta peserta didik mengetik laporan makalah dengan komputer.",
      "Menggunakan TIK hanya untuk membuat soal kuis."
    ],
    "a": 2
  },
  {
    "q": "19. Disajikan narasi tentang etika profesi guru, mahasiswa dapat menentukan tindakan yang sesuai dengan kode etik guru dalam menghadapi wali murid.\n\nSeorang wali murid mendatangi guru kelas dan marah-marah karena merasa nilai anaknya tidak adil dibandingkan teman lainnya. Wali murid tersebut menuntut guru untuk menaikkan nilai anaknya tanpa melihat hasil pekerjaan yang sesungguhnya.\n\nTindakan yang sesuai dengan kode etik guru dalam menghadapi situasi tersebut adalah ...",
    "o": [
      "Langsung menaikkan nilai anak tersebut agar wali murid tidak marah.",
      "Melayani kemarahan wali murid dengan ikut marah balik.",
      "Mendengarkan keluhan dengan tenang, menjelaskan dasar penilaian secara objektif dengan menunjukkan bukti hasil pekerjaan anak, dan memberikan saran perbaikan.",
      "Menghindari wali murid tersebut dan melaporkannya ke pihak berwajib.",
      "Menyerahkan seluruh tanggung jawab penilaian kepada wali kelas tanpa penjelasan."
    ],
    "a": 2
  },
  {
    "q": "20. Disajikan deskripsi kasus tentang pembelajaran berbasis lingkungan, mahasiswa dapat menentukan kegiatan yang tepat untuk menanamkan kepedulian lingkungan.\n\nGuru kelas III SD/MI ingin menanamkan sikap peduli lingkungan pada materi \"Pentingnya Udara Bersih\". Lokasi madrasah berada di pinggir jalan raya yang cukup padat kendaraan.\n\nKegiatan pembelajaran berbasis lingkungan yang paling tepat adalah ...",
    "o": [
      "Mengajak peserta didik menutup jendela kelas selama pelajaran berlangsung.",
      "Menugaskan peserta didik menggambar pemandangan alam di buku gambar.",
      "Mengajak peserta didik menanam pohon di lingkungan sekolah dan mendiskusikan manfaatnya untuk menyaring udara.",
      "Menjelaskan bahaya polusi udara secara teoritis di dalam kelas.",
      "Meminta peserta didik membaca artikel tentang polusi udara dari koran."
    ],
    "a": 2
  },
  {
    "q": "21. Disajikan pernyataan penerapan pembelajaran dengan materi Pengukuran sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis perbedaan individu sesuai dengan pengetahuan teknologi.\n\nDalam pembelajaran matematika kelas IV SD pada materi Pengukuran waktu dan panjang, guru menyusun pembelajaran sesuai struktur keilmuan: memahami satuan, membaca alat ukur, dan menerapkannya dalam situasi sehari-hari.\n\nHasil asesmen awal menunjukkan perbedaan individu peserta didik: sebagian siswa lebih mudah belajar melalui latihan konkret menggunakan alat ukur, sebagian melalui media digital interaktif, dan sebagian lain melalui penjelasan bertahap yang disertai contoh.\n\nGuru memiliki akses teknologi berupa video pembelajaran, kuis daring, dan aplikasi pengukuran sederhana.\n\nRancangan pembelajaran yang paling tepat dengan pendekatan pembelajaran berbasis perbedaan individu sesuai dengan pengetahuan teknologi adalah …",
    "o": [
      "Guru mengintegrasikan diferensiasi konten, proses, dan produk berbasis teknologi: peserta didik memilih media belajar (praktik langsung, simulasi digital, atau video), mengikuti proses belajar sesuai kebutuhannya, serta menunjukkan pemahaman melalui produk yang beragam (hasil ukur nyata, laporan digital, atau respons kuis daring)",
      "Guru memanfaatkan video pembelajaran dan aplikasi pengukuran sebagai pengantar materi, kemudian seluruh peserta didik melakukan praktik pengukuran dan mengerjakan kuis daring yang sama",
      "Guru membagi peserta didik ke dalam kelompok belajar berdasarkan kesiapan, menggunakan media digital berbeda pada setiap kelompok, tetapi menerapkan proses dan produk akhir yang seragam",
      "Guru menggunakan aplikasi pengukuran untuk semua peserta didik, menyesuaikan tingkat kesulitan soal secara digital, dan menilai hasil belajar melalui tes daring",
      "Guru menyediakan beberapa pilihan aktivitas berbasis teknologi di awal pembelajaran, tetapi menyamakan tahapan pembelajaran dan bentuk penilaian akhir bagi seluruh peserta didik"
    ],
    "a": 0
  },
  {
    "q": "22. Disajikan narasi kasus penerapan pembelajaran dengan materi Prinsip-prinsip Pembelajaran Tematik sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis pembelajaran mendalam sesuai dengan materi pembelajaran.\n\nSeorang guru kelas II SD melaksanakan pembelajaran dengan tema “Kegemaranku”.\n\nGuru merancang pembelajaran tematik dengan mengintegrasikan beberapa mata pelajaran, seperti Bahasa Indonesia, PPKn, SBdP, dan Matematika.\n\nMurid diminta menceritakan kegemarannya, menggambar kegemaran tersebut, berdiskusi tentang perbedaan kegemaran teman, serta mengelompokkan data kegemaran secara sederhana.\n\nGuru ingin agar peserta didik tidak hanya memahami konsep pembelajaran tematik, tetapi juga merasakan pembelajaran yang menyenangkan, fokus pada proses belajar, dan mampu memaknai pengalaman belajar dalam kehidupan sehari-hari.\n\nBerdasarkan narasi tersebut, rancangan pembelajaran yang paling tepat dengan pendekatan pembelajaran mendalam (joyful, mindful, meaningful) sesuai dengan prinsip-prinsip pembelajaran tematik adalah …",
    "o": [
      "Guru menyampaikan tema Kegemaranku, kemudian menjelaskan materi setiap mata pelajaran secara terpisah dan menutup pembelajaran dengan latihan tertulis",
      "Guru mengintegrasikan beberapa mata pelajaran dalam tema Kegemaranku, lalu memberikan tugas tematik yang sama kepada seluruh peserta didik tanpa kegiatan refleksi",
      "Guru melaksanakan diskusi kelompok pada salah satu mata pelajaran dalam tema Kegemaranku, kemudian melakukan evaluasi hasil belajar melalui tes tertulis",
      "Guru menggunakan media menarik dalam pembelajaran tema Kegemaranku, tetapi kegiatan belajar masih berpusat pada penjelasan guru",
      "Guru merancang pembelajaran tematik terpadu melalui tema Kegemaranku dengan aktivitas berbagi cerita dan menggambar kegemaran, diskusi terarah tentang keterkaitan materi dan sikap menghargai perbedaan kegemaran, serta refleksi sederhana untuk memaknai kegemaran dan sikap saling menghargai dalam kehidupan sehari-hari."
    ],
    "a": 4
  },
  {
    "q": "23. Disajikan narasi kasus penerapan pembelajaran dengan materi Kelebihan dan Kekurangan Pembelajaran Tematik sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis pembelajaran mendalam sesuai dengan pengetahuan pedagogi.\n\nDalam pembelajaran tematik kelas III MI, guru mengintegrasikan beberapa mata pelajaran ke dalam satu tema agar pembelajaran terasa lebih utuh dan dekat dengan kehidupan peserta didik.\n\nHasil pengamatan menunjukkan bahwa peserta didik terlihat antusias dan aktif selama kegiatan tematik.\n\nNamun, pada saat evaluasi, sebagian peserta didik belum mampu menjelaskan kembali konsep inti dari setiap mata pelajaran yang terintegrasi dan belum menyadari tujuan pembelajaran yang ingin dicapai.\n\nGuru ingin tetap mempertahankan kelebihan pembelajaran tematik, tetapi juga membantu peserta didik memahami konsep secara lebih sadar dan bermakna melalui pendekatan pembelajaran mendalam.\n\nBerdasarkan narasi tersebut, rancangan pembelajaran yang paling tepat untuk mengoptimalkan kelebihan dan meminimalkan kekurangan pembelajaran tematik dengan pendekatan pembelajaran mendalam adalah …",
    "o": [
      "Guru mengembangkan pembelajaran tematik dengan aktivitas kontekstual yang melibatkan peserta didik secara aktif, menyisipkan penegasan konsep dan tujuan belajar melalui diskusi terarah, serta menutup pembelajaran dengan refleksi untuk memaknai pengalaman belajar dan ketercapaian tujuan.",
      "Guru memperbanyak aktivitas tematik yang menyenangkan agar motivasi belajar peserta didik tetap terjaga",
      "Guru mengurangi kegiatan tematik dan lebih menekankan pembelajaran per mata pelajaran",
      "Guru menambah jumlah latihan soal di akhir pembelajaran tematik agar pemahaman konsep meningkat",
      "Guru memperpanjang waktu pembelajaran tematik agar seluruh materi dapat disampaikan secara lengkap."
    ],
    "a": 0
  },
  {
    "q": "24. Disajikan kasus penerapan pembelajaran dengan materi implementasi pendidikan karakter atau pendidikan nilai sesuai dengan struktur keilmuan, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis pembelajaran mendalam sesuai dengan pengetahuan teknologi.\n\nSeorang guru kelas VI SD melaksanakan pembelajaran pada materi pendidikan karakter tentang tanggung jawab dan kepedulian sosial.\n\nGuru menyajikan kasus nyata berupa permasalahan kebersihan lingkungan sekolah melalui dokumentasi foto dan video yang ditampilkan secara digital.\n\nMurid kemudian diajak untuk menganalisis penyebab masalah, mengaitkannya dengan nilai tanggung jawab dan kepedulian, merancang aksi nyata perbaikan lingkungan, serta melakukan refleksi berbasis portofolio digital terhadap perubahan sikap yang mereka alami.\n\nBerdasarkan kasus tersebut, rancangan pembelajaran yang paling tepat sesuai dengan pendekatan pembelajaran mendalam dan pengetahuan teknologi adalah …",
    "o": [
      "Menyampaikan materi pendidikan karakter melalui ceramah dan menugaskan peserta didik menghafal nilai-nilai yang disampaikan guru.",
      "Menggunakan media digital hanya sebagai alat presentasi materi tanpa melibatkan peserta didik dalam proses analisis dan refleksi.",
      "Mengintegrasikan masalah nyata, pemanfaatan teknologi digital, proses analisis reflektif, dan tindakan nyata yang terdokumentasi dalam portofolio digital untuk membentuk karakter tanggung jawab.",
      "Fokus pada penggunaan teknologi digital untuk membuat video tentang lingkungan tanpa menekankan pada analisis nilai karakter.",
      "Menugaskan peserta didik mencari gambar-gambar di internet tentang kebersihan untuk dikumpulkan kepada guru."
    ],
    "a": 2
  },
  {
    "q": "25. Disajikan deskripsi materi Pendidikan Pancasila, mahasiswa dapat merumuskan tujuan pembelajaran ranah sikap yang tepat supaya peserta didik memiliki semangat kebangsaan.\n\nDalam pembelajaran materi keberagaman budaya di Indonesia, guru kelas IV ingin peserta didik tidak hanya mengenali budaya daerah lain, tetapi juga memiliki sikap menghargai dan bangga terhadap keberagaman tersebut.\n\nRumusan tujuan pembelajaran ranah sikap yang tepat adalah …",
    "o": [
      "Murid dapat menyebutkan contoh budaya daerah dari berbagai provinsi.",
      "Murid dapat menjelaskan pentingnya menghargai perbedaan budaya.",
      "Murid menunjukkan sikap toleran dan bangga atas keberagaman budaya bangsa.",
      "Murid mampu menampilkan tarian tradisional daerahnya sendiri.",
      "Murid dapat membuat laporan tentang festival budaya yang diamati."
    ],
    "a": 2
  },
  {
    "q": "26. Disajikan kasus tentang media pembelajaran, mahasiswa dapat memilih media pembelajaran yang tepat untuk menjelaskan konsep abstrak dalam mata pelajaran IPA.\n\nSeorang guru IPA kelas V SD/MI akan mengajarkan tentang proses peredaran darah manusia. Konsep ini bersifat abstrak karena peserta didik tidak dapat mengamati secara langsung aliran darah di dalam tubuh.\n\nMedia pembelajaran yang paling tepat untuk menjelaskan konsep tersebut adalah ...",
    "o": [
      "Gambar poster peredaran darah di dinding kelas.",
      "Buku teks pelajaran IPA dengan ilustrasi.",
      "Model tiga dimensi (torso) peredaran darah manusia atau aplikasi simulasi interaktif.",
      "Papan tulis untuk menggambar diagram alir.",
      "Video tentang kesehatan jantung."
    ],
    "a": 2
  },
  {
    "q": "27. Disajikan deskripsi kasus pembelajaran Bahasa Indonesia, mahasiswa dapat menentukan metode pembelajaran yang paling sesuai untuk meningkatkan keterampilan menulis narasi peserta didik.\n\nSeorang guru kelas IV SD/MI ingin meningkatkan keterampilan peserta didik dalam menulis cerita narasi yang runtut dengan memperhatikan penggunaan tanda baca yang tepat.\n\nMetode pembelajaran yang paling sesuai untuk meningkatkan keterampilan tersebut adalah ...",
    "o": [
      "Metode ceramah tentang struktur cerita.",
      "Metode diskusi kelompok untuk menentukan tema cerita.",
      "Metode dikte kalimat-kalimat narasi.",
      "Metode teknik permodelan (modeling) dan latihan terbimbing menulis cerita.",
      "Metode penugasan membaca buku cerita."
    ],
    "a": 3
  },
  {
    "q": "28. Disajikan kasus tentang interaksi sosial dalam pembelajaran, mahasiswa dapat menentukan langkah yang tepat untuk menciptakan lingkungan belajar yang kondusif dan inklusif.\n\nDi kelas V SD/MI, terdapat peserta didik yang memiliki kebutuhan khusus (lamban belajar) yang sering tertinggal dalam mengikuti pembelajaran klasikal.\n\nLangkah yang paling tepat untuk menciptakan lingkungan belajar yang kondusif dan inklusif adalah ...",
    "o": [
      "Meminta peserta didik tersebut mengikuti kelas khusus di luar kelas reguler.",
      "Mengabaikan kesulitan peserta didik tersebut agar tidak mengganggu kecepatan pembelajaran.",
      "Memberikan pendampingan khusus atau modifikasi tugas yang sesuai dengan kemampuan peserta didik tersebut tanpa mengeluarkannya dari kelas.",
      "Meminta orang tua mendampingi anak tersebut di dalam kelas sepanjang waktu.",
      "Menurunkan standar kompetensi seluruh kelas agar sesuai dengan kemampuan anak tersebut."
    ],
    "a": 2
  },
  {
    "q": "29. Disajikan narasi kasus tentang refleksi pembelajaran, mahasiswa dapat menentukan tindakan reflektif yang tepat untuk meningkatkan kualitas pembelajaran selanjutnya.\n\nSetelah pembelajaran materi bangun ruang, guru mendapati hasil tes peserta didik sangat rendah pada soal yang menuntut kemampuan visualisasi bangun ruang dari berbagai sudut pandang.\n\nTindakan reflektif yang paling tepat untuk meningkatkan kualitas pembelajaran selanjutnya adalah ...",
    "o": [
      "Menyatakan bahwa soal tes terlalu sulit untuk tingkat SD.",
      "Memberikan nilai apa adanya dan melanjutkan materi berikutnya.",
      "Mengevaluasi strategi pengajaran dengan menambah penggunaan media konkret atau teknologi 3D untuk memvisualisasikan bangun ruang.",
      "Menghukum peserta didik yang tidak bisa menjawab soal.",
      "Meminta peserta didik belajar lebih giat lagi di rumah tanpa perbaikan metode pengajaran."
    ],
    "a": 2
  },
  {
    "q": "30. Disajikan deskripsi kasus tentang pemanfaatan teknologi informasi dan komunikasi (TIK), mahasiswa dapat menentukan penggunaan TIK yang paling tepat untuk mendukung pembelajaran kolaboratif.\n\nGuru ingin mendorong peserta didik kelas VI SD/MI untuk bekerja sama dalam membuat proyek laporan tentang pelestarian lingkungan.\n\nPenggunaan TIK yang paling tepat untuk mendukung pembelajaran kolaboratif adalah ...",
    "o": [
      "Menugaskan peserta didik mencari bahan laporan dari situs web.",
      "Meminta peserta didik mengetik laporan secara individu di komputer.",
      "Menggunakan aplikasi berbagi dokumen (cloud computing) seperti Google Docs untuk pengerjaan laporan bersama-sama.",
      "Guru menampilkan contoh laporan menggunakan PowerPoint.",
      "Menggunakan TIK hanya untuk mengirim hasil akhir laporan melalui email."
    ],
    "a": 2
  },
  {
    "q": "31. Diberikan kasus penyajian materi Statistika atau Peluang yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa dapat menentukan penggunaan model pembelajaran berbasis pelayanan bimbingan konseling guna menciptkan suasana belajar yang progresif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing.\n\nDalam pembelajaran matematika kelas V MI, guru mengajarkan materi Statistika dengan menggunakan data contoh yang bersifat lama dan tidak dekat dengan kehidupan peserta didik.\n\nMurid diminta menghitung rata-rata dan membuat tabel data tanpa memahami makna data tersebut.\n\nBeberapa peserta didik menunjukkan sikap kurang percaya diri, ragu mengemukakan pendapat, dan mudah menyerah ketika menghadapi soal.\n\nGuru menyadari bahwa selain pemahaman konsep, peserta didik juga membutuhkan pendampingan emosional, motivasi belajar, dan penguatan kepercayaan diri agar mampu menghadapi tantangan pembelajaran statistika di era digital.\n\nBerdasarkan kasus tersebut, model pembelajaran yang paling tepat diterapkan adalah …",
    "o": [
      "Model pembelajaran kontekstual berbasis bimbingan dan konseling yang menggunakan data nyata dari kehidupan peserta didik, disertai kegiatan refleksi, diskusi, dan penguatan motivasi belajar",
      "Model pembelajaran ekspositori dengan penjelasan konsep statistika secara bertahap",
      "Model pembelajaran berbasis latihan soal untuk meningkatkan ketepatan perhitungan",
      "Model pembelajaran mandiri dengan tugas individual agar peserta didik lebih disiplin",
      "Model pembelajaran remedial yang diberikan setelah peserta didik mengalami kesulitan belajar"
    ],
    "a": 0
  },
  {
    "q": "32. Diberikan kasus penyajian materi teori dan aplikasi materi ajar Contoh Jaring Tema dalam Pembelajaran Tematik yang materinya kurang sesuai dengan perkembangan zaman, mahasiswa dapat menentukan penggunaan pendekatan pembelajaran berbasis pelayanan ABK guna menciptkan lingkungan belajar yang akomodatif untuk menghasilkan lulusan yang berkarakter unggul dan berdaya saing.\n\nSeorang guru Madrasah Ibtidaiyah menyajikan contoh jaring tema pembelajaran tematik dengan menggunakan pola lama yang seragam untuk seluruh peserta didik.\n\nMateri dan aktivitas belajar belum mengakomodasi perkembangan zaman serta keragaman kebutuhan belajar, termasuk peserta didik dengan kebutuhan khusus (ABK) yang memiliki perbedaan kemampuan dalam memahami konsep, berkomunikasi, dan berinteraksi sosial.\n\nAkibatnya, sebagian peserta didik kurang terlibat aktif dan pembelajaran belum sepenuhnya menciptakan lingkungan belajar yang inklusif, adaptif, dan mendukung penguatan karakter.\n\nBerdasarkan kasus tersebut, pendekatan pembelajaran yang paling tepat diterapkan untuk menciptakan lingkungan belajar akomodatif berbasis pelayanan ABK adalah …",
    "o": [
      "Pendekatan pembelajaran tematik konvensional dengan penyesuaian waktu belajar bagi peserta didik ABK",
      "Pendekatan pembelajaran individual dengan pemberian tugas khusus kepada peserta didik ABK",
      "Pendekatan pembelajaran inklusif berbasis diferensiasi dan Universal Design for Learning (UDL) dalam penyusunan jaring tema, sehingga seluruh peserta didik, termasuk ABK, dapat belajar sesuai kebutuhan, potensi, dan perkembangan zaman",
      "Pendekatan pembelajaran berbasis latihan berulang untuk membantu peserta didik memahami jaring tema"
    ],
    "a": 2
  },
  {
    "q": "33. [Soal ini tidak ditemukan secara lengkap dalam dokumen untuk konteks 33-40. Menggunakan asumsi struktur berdasarkan contoh sebelumnya].\n\nDisajikan kasus penerapan teknologi dalam pembelajaran tematik di MI, mahasiswa dapat memilih rancangan pembelajaran berbasis masalah yang sesuai dengan TPACK.",
    "o": [
      "Menggunakan buku teks sebagai sumber utama pembelajaran tematik.",
      "Meminta siswa menghafal definisi teknologi dalam pembelajaran.",
      "Mengintegrasikan alat digital (seperti video pembelajaran) untuk memecahkan masalah dalam proyek tematik.",
      "Menggunakan teknologi hanya untuk menampilkan hasil karya siswa.",
      "Melakukan tes berbasis komputer tanpa ada aktivitas pemecahan masalah."
    ],
    "a": 2
  },
  {
    "q": "34. Disajikan deskripsi tentang pembelajaran tematik, mahasiswa dapat memilih strategi yang tepat untuk meningkatkan kemampuan berpikir kritis siswa.\n\nDalam pembelajaran tema \"Ekosistem\", siswa kelas V menemukan banyak ikan di sungai dekat sekolah mati. Guru ingin menggunakan situasi ini untuk meningkatkan kemampuan berpikir kritis.",
    "o": [
      "Guru menjelaskan penyebab ikan mati melalui ceramah.",
      "Siswa diminta menghafal jenis-jenis ekosistem.",
      "Siswa diminta melakukan observasi dan diskusi kelompok untuk menganalisis penyebab dan dampak pencemaran sungai.",
      "Guru memberikan soal pilihan ganda tentang pencemaran air.",
      "Siswa diminta membaca artikel tentang ekosistem di buku paket."
    ],
    "a": 2
  },
  {
    "q": "35. Disajikan deskripsi pembelajaran IPS di MI, mahasiswa dapat menentukan alur materi yang tepat menggunakan pendekatan kontekstual.\n\nGuru kelas IV ingin mengajarkan tentang \"Jenis-jenis Pekerjaan di Lingkungan Sekitar\".",
    "o": [
      "Siswa diminta membaca buku tentang pekerjaan di kota lain.",
      "Guru menjelaskan jenis pekerjaan melalui gambar di papan tulis.",
      "Siswa diminta mewawancarai warga sekitar mengenai jenis pekerjaan mereka dan dampaknya bagi lingkungan.",
      "Siswa diminta menghafal daftar pekerjaan.",
      "Siswa mengerjakan soal latihan di LKS."
    ],
    "a": 2
  },
  {
    "q": "36. Disajikan kasus tentang media pembelajaran IPA di kelas rendah, mahasiswa dapat memilih media yang sesuai dengan karakteristik perkembangan kognitif siswa.\n\nSiswa kelas II SD/MI masih berada dalam tahap operasional konkret.",
    "o": [
      "Guru menjelaskan konsep gaya magnet menggunakan diagram abstrak.",
      "Siswa diminta membaca buku teks tentang sifat-sifat magnet.",
      "Siswa menggunakan magnet dan berbagai benda logam/non-logam untuk melakukan eksperimen langsung.",
      "Guru menayangkan video animasi tentang kutub magnet.",
      "Siswa mendengarkan ceramah guru tentang manfaat magnet."
    ],
    "a": 2
  },
  {
    "q": "37. Disajikan narasi mengenai evaluasi pembelajaran PAI di MI, mahasiswa dapat menentukan bentuk penilaian yang sesuai untuk mengukur ranah afektif.\n\nGuru ingin menilai kejujuran siswa saat pelaksanaan ujian.",
    "o": [
      "Tes tertulis mengenai teori kejujuran.",
      "Pengamatan perilaku siswa menggunakan rubrik selama ujian berlangsung.",
      "Wawancara siswa tentang pendapat mereka mengenai kejujuran.",
      "Tes lisan mengenai kisah teladan kejujuran Nabi.",
      "Laporan tertulis tentang pengalaman perilaku jujur."
    ],
    "a": 1
  },
  {
    "q": "38. Disajikan studi kasus mengenai kesulitan belajar siswa, mahasiswa dapat menentukan langkah bimbingan konseling yang tepat.\n\nSeorang siswa kelas III sering terlihat melamun dan tidak mengerjakan tugas.",
    "o": [
      "Menghukum siswa tersebut di depan kelas.",
      "Memanggil orang tua untuk memarahi siswa.",
      "Mengadakan pendekatan personal (konseling individu) untuk mengetahui penyebab masalahnya.",
      "Memberikan tambahan tugas agar fokus.",
      "Membiarkan saja karena mungkin siswa tersebut lelah."
    ],
    "a": 2
  },
  {
    "q": "39. Disajikan deskripsi pembelajaran Seni Budaya, mahasiswa dapat memilih metode yang sesuai untuk kreativitas.\n\nGuru kelas V ingin mengajarkan materi membuat kerajinan dari barang bekas.",
    "o": [
      "Ceramah tentang jenis-jenis kerajinan.",
      "Demonstrasi pembuatan kerajinan dan siswa mengikuti langkah-langkah guru.",
      "Siswa diberi kebebasan merancang dan membuat kerajinan unik dari barang bekas yang mereka bawa.",
      "Membaca buku teks tentang kerajinan tangan.",
      "Ujian tulis tentang bahan kerajinan."
    ],
    "a": 2
  },
  {
    "q": "40. Disajikan kasus penerapan moderasi beragama, mahasiswa dapat menentukan tindakan guru yang tepat.\n\nDi kelas terjadi perdebatan mengenai perbedaan tata cara ibadah antarsiswa.",
    "o": [
      "Memihak salah satu pendapat siswa yang paling populer.",
      "Melarang diskusi mengenai agama di kelas.",
      "Menengahi perdebatan dengan menekankan nilai toleransi (tasamuh) dan menghargai perbedaan.",
      "Menyuruh siswa yang berdebat keluar kelas.",
      "Membiarkan perdebatan berlanjut sampai ada yang menang."
    ],
    "a": 2
  },
  {
    "q": "41. Diberikan kasus penyajian materi Sejarah Kebudayaan Islam atau Seni Budaya, mahasiswa dapat memilih rancangan pembelajaran berpendekatan pembelajaran berbasis masalah sesuai dengan pengetahuan konten.\n\nSeorang guru kelas VI SD/MI akan mengajarkan materi Sejarah Kebudayaan Islam tentang perjuangan Nabi Muhammad SAW di Madinah. Guru ingin peserta didik memahami nilai-nilai toleransi dan strategi dakwah pada masa itu, serta mampu mengaitkannya dengan kehidupan berbangsa saat ini. Namun, peserta didik cenderung bosan jika pembelajaran hanya berupa ceramah.\n\nBerdasarkan deskripsi kasus tersebut, rancangan pembelajaran berbasis masalah yang paling tepat sesuai dengan pengetahuan konten adalah ...",
    "o": [
      "Guru menugaskan peserta didik membaca buku teks sejarah secara mandiri dan membuat rangkuman.",
      "Guru menayangkan video dokumenter tentang sejarah Madinah dan meminta peserta didik mencatat poin penting.",
      "Guru menyajikan masalah dilematis tentang konflik sosial saat ini, kemudian mengajak peserta didik mencari solusi berdasarkan strategi dakwah Nabi dalam piagam Madinah.",
      "Guru memberikan kuis pilihan ganda tentang tokoh-tokoh yang berperan dalam sejarah Madinah.",
      "Guru meminta peserta didik menghafal tahun dan tempat kejadian penting dalam sejarah Islam."
    ],
    "a": 2
  },
  {
    "q": "42. Disajikan deskripsi kasus tentang pembelajaran tematik terpadu, mahasiswa dapat menentukan bentuk penilaian autentik yang tepat untuk mengukur pencapaian kompetensi sikap dan keterampilan peserta didik.\n\nDalam pembelajaran tematik terpadu tema \"Lingkungan Bersih\", guru kelas II SD/MI ingin menilai sikap peduli lingkungan dan keterampilan peserta didik dalam memilah sampah organik dan anorganik. Pembelajaran dilakukan melalui praktik langsung di lingkungan sekolah.\n\nBentuk penilaian autentik yang paling tepat untuk mengukur pencapaian kompetensi sikap dan keterampilan tersebut adalah ...",
    "o": [
      "Tes tulis objektif tentang jenis-jenis sampah.",
      "Lembar observasi sikap perilaku peduli lingkungan dan rubrik penilaian praktik memilah sampah.",
      "Wawancara dengan orang tua tentang kebiasaan siswa di rumah.",
      "Portofolio kumpulan gambar lingkungan bersih.",
      "Tes lisan tentang pengertian sampah organik dan anorganik."
    ],
    "a": 1
  },
  {
    "q": "43. Disajikan deskripsi kasus pembelajaran Bahasa Indonesia, mahasiswa dapat menentukan metode pembelajaran yang paling sesuai untuk meningkatkan keterampilan berbicara peserta didik.\n\nSeorang guru kelas V SD/MI mendapati bahwa peserta didik sering merasa gugup dan kurang percaya diri saat diminta berbicara di depan kelas. Guru ingin meningkatkan keterampilan berbicara peserta didik melalui kegiatan bercerita tentang pengalaman liburan dengan percaya diri dan runtut.\n\nMetode pembelajaran yang paling sesuai untuk meningkatkan keterampilan berbicara peserta didik adalah ...",
    "o": [
      "Metode ceramah tentang cara berbicara yang baik.",
      "Metode diskusi kelompok kecil untuk membahas tema cerita.",
      "Metode demonstrasi cara bercerita oleh guru.",
      "Metode bermain peran (role playing) atau bercerita berantai dalam kelompok.",
      "Metode penugasan menulis cerita sebelum dibacakan."
    ],
    "a": 3
  },
  {
    "q": "44. Disajikan deskripsi kasus pembelajaran Matematika, mahasiswa dapat menentukan strategi remedial yang tepat bagi peserta didik yang belum mencapai Kriteria Ketercapaian Tujuan Pembelajaran (KKTP).\n\nSetelah dilakukan asesmen sumatif pada materi pecahan, ditemukan 5 dari 30 peserta didik di kelas IV SD/MI belum mencapai KKTP. Kesulitan utama mereka adalah memahami konsep dasar pecahan sebagai bagian dari keseluruhan menggunakan media konkret.\n\nStrategi remedial yang paling tepat untuk peserta didik tersebut adalah ...",
    "o": [
      "Memberikan tambahan tugas latihan soal yang lebih banyak di rumah.",
      "Meminta peserta didik mempelajari kembali buku teks secara mandiri.",
      "Mengulang penjelasan materi di depan seluruh kelas dengan media yang sama.",
      "Memberikan bimbingan perorangan atau kelompok kecil menggunakan media manipulatif secara intensif.",
      "Memberikan soal remedial yang sama dengan soal tes sumatif sebelumnya."
    ],
    "a": 3
  },
  {
    "q": "45. Disajikan kasus tentang media pembelajaran, mahasiswa dapat memilih media pembelajaran yang tepat untuk menjelaskan konsep abstrak dalam mata pelajaran IPA.\n\nSeorang guru IPA kelas VI SD/MI akan mengajarkan tentang sistem tata surya. Konsep ini bersifat abstrak karena peserta didik tidak dapat mengamati secara langsung pergerakan planet-planet yang luas. Guru ingin peserta didik memahami urutan planet, rotasi, dan revolusi dengan mudah.\n\nMedia pembelajaran yang paling tepat untuk menjelaskan konsep tersebut adalah ...",
    "o": [
      "Gambar poster tata surya di dinding kelas.",
      "Buku teks pelajaran IPA dengan ilustrasi.",
      "Model tiga dimensi (torso) tata surya atau aplikasi simulasi ruang angkasa berbasis digital.",
      "Papan tulis untuk menggambar lintasan planet.",
      "Video dokumenter kehidupan di bumi."
    ],
    "a": 2
  },
  {
    "q": "46. Disajikan kasus tentang interaksi sosial dalam pembelajaran, mahasiswa dapat menentukan langkah yang tepat untuk menciptakan lingkungan belajar yang kondusif dan inklusif.\n\nDi kelas IV SD/MI, terdapat beberapa peserta didik yang kurang aktif dan cenderung terisolasi saat diskusi kelompok. Guru ingin memastikan seluruh peserta didik memiliki kesempatan yang sama untuk berpartisipasi dan merasa dihargai dalam proses pembelajaran.\n\nLangkah yang paling tepat untuk menciptakan lingkungan belajar yang kondusif dan inklusif adalah ...",
    "o": [
      "Membiarkan peserta didik memilih kelompoknya sendiri.",
      "Menegur peserta didik yang diam agar lebih aktif berbicara.",
      "Menerapkan struktur kelompok kooperatif dengan pembagian peran yang jelas dan adil.",
      "Mengurangi porsi diskusi dan memperbanyak tugas individu.",
      "Memindahkan peserta didik yang pendiam ke bangku paling depan."
    ],
    "a": 2
  },
  {
    "q": "47. Disajikan deskripsi kasus tentang refleksi pembelajaran, mahasiswa dapat menentukan tindakan reflektif yang tepat untuk meningkatkan kualitas pembelajaran selanjutnya.\n\nSeorang guru baru saja selesai mengajarkan materi perkalian bilangan dua angka. Hasil tes menunjukkan bahwa sebagian besar peserta didik salah dalam melakukan prosedur perkalian susun, meskipun mereka sudah hafal tabel perkalian dasar. Guru merasa perlu melakukan refleksi untuk memperbaiki proses pengajaran.\n\nTindakan reflektif yang paling tepat untuk meningkatkan kualitas pembelajaran selanjutnya adalah ...",
    "o": [
      "Menyalahkan peserta didik karena tidak teliti saat mengerjakan soal.",
      "Langsung melanjutkan ke materi pembagian karena waktu yang terbatas.",
      "Menganalisis hasil tes untuk mengetahui letak kesalahan prosedur dan merancang ulang kegiatan latihan menggunakan media visual.",
      "Memberikan hukuman kepada peserta didik yang nilainya rendah.",
      "Meminta peserta didik mengulang pembelajaran dari awal secara mandiri."
    ],
    "a": 2
  },
  {
    "q": "48. Disajikan deskripsi kasus tentang pemanfaatan teknologi informasi dan komunikasi (TIK), mahasiswa dapat menentukan penggunaan TIK yang paling tepat untuk mendukung pembelajaran mandiri.\n\nGuru ingin mendorong peserta didik kelas V SD/MI untuk melakukan pembelajaran mandiri mengenai keanekaragaman budaya Indonesia. Guru memiliki akses internet dan beberapa perangkat komputer di madrasah.\n\nPenggunaan TIK yang paling tepat untuk mendukung pembelajaran mandiri adalah ...",
    "o": [
      "Menampilkan video pembelajaran di proyektor untuk ditonton bersama.",
      "Guru menjelaskan materi menggunakan presentasi PowerPoint.",
      "Menugaskan peserta didik mencari informasi dari situs web yang ditentukan dan membuat infografis sederhana.",
      "Meminta peserta didik mengetik laporan makalah dengan komputer.",
      "Menggunakan TIK hanya untuk membuat soal kuis."
    ],
    "a": 2
  },
  {
    "q": "49. Disajikan narasi tentang etika profesi guru, mahasiswa dapat menentukan tindakan yang sesuai dengan kode etik guru dalam menghadapi wali murid.\n\nSeorang wali murid mendatangi guru kelas dan marah-marah karena merasa nilai anaknya tidak adil dibandingkan teman lainnya. Wali murid tersebut menuntut guru untuk menaikkan nilai anaknya tanpa melihat hasil pekerjaan yang sesungguhnya.\n\nTindakan yang sesuai dengan kode etik guru dalam menghadapi situasi tersebut adalah ...",
    "o": [
      "Langsung menaikkan nilai anak tersebut agar wali murid tidak marah.",
      "Melayani kemarahan wali murid dengan ikut marah balik.",
      "Mendengarkan keluhan dengan tenang, menjelaskan dasar penilaian secara objektif dengan menunjukkan bukti hasil pekerjaan anak, dan memberikan saran perbaikan.",
      "Menghindari wali murid tersebut dan melaporkannya ke pihak berwajib.",
      "Menyerahkan seluruh tanggung jawab penilaian kepada wali kelas tanpa penjelasan."
    ],
    "a": 2
  },
  {
    "q": "50. Disajikan deskripsi kasus tentang pembelajaran berbasis lingkungan, mahasiswa dapat menentukan kegiatan yang tepat untuk menanamkan kepedulian lingkungan.\n\nGuru kelas III SD/MI ingin menanamkan sikap peduli lingkungan pada materi \"Pentingnya Udara Bersih\". Lokasi madrasah berada di pinggir jalan raya yang cukup padat kendaraan.\n\nKegiatan pembelajaran berbasis lingkungan yang paling tepat adalah ...",
    "o": [
      "Mengajak peserta didik menutup jendela kelas selama pelajaran berlangsung.",
      "Menugaskan peserta didik menggambar pemandangan alam di buku gambar.",
      "Mengajak peserta didik menanam pohon di lingkungan sekolah dan mendiskusikan manfaatnya untuk menyaring udara.",
      "Menjelaskan bahaya polusi udara secara teoritis di dalam kelas.",
      "Meminta peserta didik membaca artikel tentang polusi udara dari koran."
    ],
    "a": 2
  }
]
