[
  {
    "q": "Seorang guru Bahasa Arab profesional di Madrasah Tsanawiyah sedang merancang pembelajaran pada materi klasifikasi kata (taqsīm al-kalimah: ism, fi'l, dan ḥarf). Berdasarkan hasil asesmen sebelumnya, guru menemukan bahwa peserta didik cenderung memandang materi kebahasaan sebagai hafalan teknis sehingga kurang berdampak pada pembentukan sikap dan nilai dalam praktik berbahasa sehari-hari. Oleh karena itu, guru ingin merancang pembelajaran yang mengintegrasikan materi klasifikasi kata dengan contoh teks bertemakan al-anshitaḥ al-yaumiyyah dan al-ḥayah al-madrasiyyah serta kegiatan yang mendorong keterlibatan aktif peserta didik, tanpa mengaburkan struktur keilmuan bahasa Arab. Berdasarkan deskripsi tersebut, rumusan tujuan pembelajaran ranah sikap yang paling tepat adalah peserta didik menunjukkan sikap...",
    "o": [
      "teliti dan teratur dalam memahami klasifikasi kata bahasa Arab ism, fi'l, dan ḥarf sesuai kaidah.",
      "disiplin dan tanggung jawab dalam mengikuti pembelajaran klasifikasi kata dalam bahasa Arab.",
      "menyadari keteraturan bahasa Arab dari Allah melalui penggunaan klasifikasi kata dalam teks pelajaran.",
      "kerja sama dan kepedulian dalam kegiatan diskusi pengelompokan jenis kata dalam bahasa Arab.",
      "terbuka dan kritis dalam mengaitkan klasifikasi kata bahasa Arab dengan contoh kalimat yang relevan."
    ],
    "a": 2
  },
  {
    "q": "Jumlah fi'liyyah merupakan struktur kalimat dalam bahasa Arab yang tersusun dari fi'il dan fā'il atau nā'ib al-fā'il sebagai unsur inti, serta dapat diperluas dengan unsur lain sesuai konteks. Dalam sebuah teks bahasa Arab, fi'il berfungsi menyatakan peristiwa atau tindakan, sedangkan fā'il atau nā'ib al-fā'il berfungsi sebagai pelaku atau pihak yang dikenai peristiwa tersebut. Pemahaman struktur ini diperlukan agar peserta didik mampu menalar hubungan bentuk dan fungsi unsur kalimat serta maknanya dalam konteks teks. Berdasarkan pernyataan tersebut, rumusan tujuan pembelajaran ranah pengetahuan yang paling sesuai untuk mendorong berpikir kritis peserta didik adalah...",
    "o": [
      "Peserta didik mampu menganalisis fungsi fi'l dan fā'il atau nā'ib al-fā'il dalam jumlah fi'liyyah.",
      "Peserta didik mampu menjelaskan fungsi fi'l dan fā'il atau nā'ib al-fā'il dalam jumlah fi'liyyah.",
      "Peserta didik mampu mengidentifikasi posisi fi'l dan fā'il atau nā'ib al-fā'il dalam jumlah fi'liyyah.",
      "Peserta didik mampu memahami peranan fi'l dan fā'il atau nā'ib al-fā'il dalam sebuah jumlah fi'liyyah.",
      "Peserta didik mampu membedakan konteks fi'l dan fā'il atau nā'ib al-fā'il dalam jumlah fi'liyyah."
    ],
    "a": 0
  },
  {
    "q": "Fashahah (fasāḥah) dalam ilmu balāghah adalah kejelasan dan ketepatan penggunaan bahasa Arab, baik pada tingkat kata (fashāḥah al-kalimah), kalimat (fashāḥah al-kalām), maupun pembicara (fashāḥah al-mutakallim), sehingga tuturan mudah dipahami dan bebas dari kerancuan lafaz (ta'qīd lafẓī) maupun makna (ta'qīd ma'nawī). Fashahah menuntut ketepatan pemilihan kata, ketaatan pada kaidah nahwu dan sharaf, serta kemampuan menyampaikan makna secara jelas sesuai dengan situasi tuturan dan kondisi pendengar, sehingga pesan yang disampaikan tetap tepat, jelas, dan tidak menimbulkan kesalahpahaman. Berdasarkan pernyataan tersebut, rumusan tujuan pembelajaran ranah keterampilan yang paling sesuai agar peserta didik memiliki semangat gotong royong adalah...",
    "o": [
      "Peserta didik mampu menyusun kalimat fasih secara individual dengan memperhatikan kaidah nahwu dan sharaf.",
      "Peserta didik mampu mengidentifikasi kesalahan lafaz dan makna dalam tuturan bahasa Arab secara mandiri.",
      "Peserta didik mampu mempresentasikan hasil analisis fashahah di depan kelas dengan percaya diri.",
      "Peserta didik mampu mempraktikkan penggunaan bahasa Arab yang fasih melalui kerja kelompok dengan saling membantu memperbaiki lafaz dan makna.",
      "Peserta didik mampu mengevaluasi ketepatan pemilihan kata dalam teks bahasa Arab secara kritis."
    ],
    "a": 3
  },
  {
    "q": "Dalam pengembangan materi Ilmu Lughah, pengajar menjelaskan bahwa kajian bahasa Arab mencakup pembahasan tentang bunyi bahasa, kosakata, makna, struktur, serta fungsi bahasa dalam kehidupan sosial. Pengajar juga memaparkan bahwa dalam tradisi keilmuan Arab dikenal istilah lughawiyyāt, lisāniyyāt, dan alsuniyyāt, yang muncul dari beragam pendekatan dalam memahami substansi bahasa. Di antara ketiga istilah tersebut, lughawiyyāt merupakan istilah yang paling luas digunakan dalam kajian kebahasaan bahasa Arab karena mencakup berbagai aspek bahasa secara komprehensif. Adapun lisāniyyāt dan alsuniyyāt cenderung digunakan untuk menunjukkan penekanan tertentu dalam memahami bahasa. Perbedaan istilah dan cakupan pemahaman tersebut berkembang secara historis dan digunakan sesuai dengan konteks kajiannya masing-masing, sehingga melahirkan keragaman tradisi dalam memahami hakikat bahasa Arab. Berdasarkan deskripsi kasus tersebut, rumusan indikator tujuan pembelajaran ranah sikap yang paling sesuai agar peserta didik memiliki sikap penerimaan terhadap tradisi adalah: Melalui kajian Ilmu Lughah, peserta didik diharapkan...",
    "o": [
      "memandang perbedaan pemahaman tentang substansi bahasa sebagai variasi kajian kebahasaan.",
      "menjadikan perbedaan pemahaman terkait substansi bahasa sebagai fokus telaah akademik.",
      "merefleksikan perbedaan pemahaman berkenaan dengan substansi bahasa sebagai fenomena kajian ilmiah.",
      "menyikapi perbedaan pemahaman perihal substansi bahasa sebagai pilihan kajian selektif.",
      "menempatkan perbedaan pemahaman mengenai substansi bahasa sebagai kesinambungan kajian keilmuan."
    ],
    "a": 4
  },
  {
    "q": "Keterampilan reseptif dalam pembelajaran bahasa Arab mencakup kemampuan memahami bahasa melalui proses menyimak dan membaca. Dalam berbagai kajian, proses ini sering dipahami sebagai aktivitas kognitif aktif karena peserta didik mengolah dan menafsirkan makna teks berdasarkan pengalaman dan pengetahuan yang telah dimilikinya. Pemahaman tersebut kerap mendorong anggapan bahwa pembelajaran keterampilan reseptif cukup diarahkan pada aktivitas bermakna dan keterlibatan peserta didik. Namun, tanpa penguasaan konsep dan teori yang melandasinya, tujuan pembelajaran ranah pengetahuan berisiko tidak terumuskan secara tepat. Berdasarkan stimulus tersebut, rumusan indikator tujuan pembelajaran ranah pengetahuan yang paling sesuai adalah peserta didik mampu...",
    "o": [
      "menjelaskan konsep menyimak dan membaca sebagai keterampilan memahami bahasa Arab secara komprehensif.",
      "menganalisis konsep dan teori keterampilan reseptif sebagai landasan perumusan tujuan pembelajaran.",
      "mempraktikkan kegiatan menyimak dan membaca teks bahasa Arab secara bertahap dari yang sederhana.",
      "menunjukkan keterlibatan aktif dalam diskusi memahami teks lisan dan tulis bahasa Arab kontemporer.",
      "mengaitkan kegiatan menyimak dan membaca dengan pengalaman real peserta didik dalam kehidupan sehari-hari."
    ],
    "a": 1
  },
  {
    "q": "Dalam perencanaan pembelajaran ilmu sharaf dengan pendekatan Problem Based Learning (PBL), guru merancang kegiatan awal dengan menyajikan teks tematik sederhana bertema al-ḥayāh al-yaumiyyah dan al-usrah. Peserta didik mengamati teks dan mengidentifikasi permasalahan kebahasaan yang muncul. Berdasarkan kegiatan awal tersebut, guru menyusun tujuan pembelajaran dengan mempertimbangkan kemampuan awal peserta didik sebelum membahas perubahan bentuk kata. Berdasarkan deskripsi kegiatan tersebut, keputusan guru yang paling tepat adalah...",
    "o": [
      "Menempatkan klasifikasi ism dan fi'l sebagai dasar analisis masalah sesuai tahap orientasi PBL.",
      "Menggunakan klasifikasi ism dan fi'l untuk membangun pemahaman masalah pada tahap orientasi PBL.",
      "Menganalisis perubahan bentuk kata ism dan fi'l sebagai solusi awal sebelum perumusan masalah PBL.",
      "Menekankan definisi ism dan fi'l untuk memperkaya diskusi kelompok sebelum masalah PBL dirumuskan.",
      "Mengaitkan klasifikasi ism dan fi'l dengan tema teks sebagai konteks awal pemunculan masalah PBL."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran Bahasa Arab kelas X Madrasah Aliyah, pada materi Struktur Jumlah Ismiyyah sebagai pengantar kaidah nahwu dasar, guru merancang pembelajaran dengan menugaskan peserta didik bekerja dalam kelompok kecil untuk mengkaji teks deskriptif sangat sederhana bertema kehidupan madrasah, seperti ruang kelas atau fasilitas sekolah. Peserta didik diarahkan untuk menemukan unsur mubtada' dan khabar, mendiskusikan fungsi keduanya dalam kalimat nominal sederhana, serta menyusun hasil analisis dalam bentuk produk visual sederhana yang kemudian dipresentasikan dengan bimbingan guru. Berdasarkan deskripsi tersebut, analisis materi ajar Struktur Jumlah Ismiyyah yang paling tepat ditinjau dari struktur keilmuan Ilmu Nahwu dan karakteristik peserta didik kelas X Madrasah Aliyah adalah...",
    "o": [
      "Materi ajar disusun dengan memisahkan pembahasan mubtada' dan khabar secara konseptual terlebih dahulu, kemudian peserta didik diarahkan menganalisis teks kehidupan madrasah secara berkelompok.",
      "Materi ajar dirancang dengan menampilkan contoh kalimat jumlah ismiyyah bertema kehidupan madrasah, lalu guru menjelaskan fungsi mubtada' dan khabar sebelum kegiatan proyek dilakukan.",
      "Materi ajar dirancang dengan mengintegrasikan analisis mubtada' dan khabar dalam teks pelajaran, sehingga peserta didik memahami struktur dan fungsi jumlah ismiyyah melalui kegiatan proyek.",
      "Materi ajar disusun secara bertahap dari kaidah umum jumlah ismiyyah menuju penerapan dalam teks kehidupan madrasah, dengan proyek digunakan sebagai kegiatan penguatan akhir.",
      "Materi ajar diarahkan pada latihan terstruktur pola jumlah ismiyyah melalui contoh kalimat sederhana, sementara teks kehidupan madrasah berfungsi sebagai ilustrasi pendukung."
    ],
    "a": 2
  },
  {
    "q": "Seorang guru Bahasa Arab kelas XI MA Peminatan melakukan evaluasi pembelajaran Ilmu Balaghah setelah menerapkan pendekatan Discovery-Based Learning (DBL) pada kutipan Qaṣīdah al-Burdah sebagai teks sastra Arab klasik. Dalam proses pembelajaran, peserta didik diminta mengamati penggalan qaṣīdah tersebut untuk menemukan makna ungkapan, tujuan retoris, dan efek keindahan bahasa secara mandiri sebelum guru memberikan penguatan. Hasil evaluasi menunjukkan bahwa peserta didik telah mampu mengenali fungsi makna ungkapan balaghiy, tetapi belum mampu mengaitkannya secara konsisten dengan konteks komunikatif dan tujuan penggunaan bahasa dalam qaṣīdah. Berdasarkan temuan tersebut, guru perlu merumuskan tujuan pembelajaran evaluatif yang merefleksikan uraian materi Balaghah sesuai dengan karakteristik peserta didik dan prinsip DBL. Uraian tentang materi Balaghah yang paling tepat dalam evaluasi tujuan pembelajaran Balaghah berdasarkan kasus tersebut adalah...",
    "o": [
      "pengertian dan ruang lingkup Ilmu Balaghah dalam kajian sastra bahasa Arab klasik.",
      "definisi contoh ungkapan balaghiy dalam Qaṣīdah al-Burdah Arab klasik sastra.",
      "ciri kebahasaan Ilmu Balaghah dalam Qaṣīdah al-Burdah dengan konteks komunikatif.",
      "fungsi makna dan tujuan ungkapan balaghiy dalam Qaṣīdah al-Burdah Imam Bushairi.",
      "unsur keindahan bahasa dalam Qaṣīdah al-Burdah sebagai teks sastra Arab."
    ],
    "a": 3
  },
  {
    "q": "Seorang guru Bahasa Arab Madrasah Aliyah akan merancang pembelajaran keterampilan membaca dan berbicara. Peserta didik memiliki kemampuan beragam, cenderung memahami bahasa melalui contoh kontekstual, dan terbiasa menggunakan media digital. Dalam tahap perencanaan, guru menganalisis unsur bunyi, makna, dan fungsi bahasa dari teks pendek berbahasa Arab yang sering dijumpai dalam kehidupan sehari-hari. Guru kemudian memilih media video singkat dan aktivitas diskusi terarah agar peserta didik mampu memahami penggunaan bahasa secara komunikatif. Praktik tersebut menunjukkan bahwa guru memanfaatkan kontribusi Ilmu Lughah (linguistik) sebagai dasar dalam menyusun alur materi dan tujuan pembelajaran Bahasa Arab, bukan sebagai materi yang diajarkan secara terpisah. Berdasarkan deskripsi tersebut, alur perencanaan pembelajaran yang paling tepat adalah...",
    "o": [
      "Menetapkan tujuan pembelajaran bahasa Arab, menyajikan teks Arab, lalu menjelaskan unsur linguistik sebagai penguatan konsep pembelajaran.",
      "Memulai dari konteks penggunaan bahasa, menganalisis unsur linguistik, kemudian merumuskan tujuan dan kegiatan pembelajaran sesuai kebutuhan peserta didik.",
      "Menyusun materi kebahasaan secara sistematis, melatih identifikasi unsur bahasa, lalu mengaitkannya dengan keterampilan membaca dan berbicara.",
      "Memanfaatkan teknologi untuk menyajikan materi teks digital, menugaskan rangkuman konsep bahasa, kemudian melanjutkan ke praktik komunikasi sehari-hari.",
      "Menentukan tujuan pembelajaran linguistik, menyajikan contoh bahasa, lalu mengarahkan penerapan kaidah dalam aktivitas komunikasi berbahasa."
    ],
    "a": 1
  },
  {
    "q": "Seorang guru Bahasa Arab Madrasah Aliyah melaksanakan pembelajaran keterampilan produktif (al-mahārāt al-intājiyyah) pada keterampilan berbicara (mahārah al-kalām) dengan tema al-siyāḥah wa al-marāfiq al-'āmmah (pariwisata dan fasilitas umum), sebagaimana tercantum dalam Standar Isi Kurikulum Bahasa Arab MA. Peserta didik memiliki kemampuan yang beragam: sebagian telah mampu melakukan percakapan sederhana, sementara sebagian lain masih memerlukan contoh konkret dan bimbingan bertahap. Dalam kegiatan pembelajaran, guru menyajikan stimulus berupa dialog dan teks pendek tentang aktivitas al-siyāḥah, penggunaan al-marāfiq al-'āmmah seperti transportasi umum dan layanan publik. Peserta didik diarahkan untuk mengamati ungkapan komunikatif yang digunakan, menemukan pola bahasa melalui diskusi, serta memahami fungsi sosial ungkapan tersebut. Selanjutnya, guru memfasilitasi latihan berbicara secara berpasangan dan kelompok, dengan tingkat bantuan yang semakin berkurang hingga peserta didik mampu memproduksi ungkapan secara mandiri. Berdasarkan praktik pedagogi tersebut, alur materi ajar keterampilan produktif (kalām) yang paling tepat untuk mencapai tujuan pembelajaran adalah...",
    "o": [
      "Penyajian stimulus kontekstual bertema al-siyāḥah dan al-marāfiq al-'āmmah → latihan pengulangan ungkapan komunikatif secara terkontrol → penguatan kaidah kebahasaan secara eksplisit → produksi kalām terpimpin yang seragam.",
      "Penyajian stimulus kontekstual bertema al-siyāḥah dan al-marāfiq al-'āmmah → penjelasan langsung kaidah ungkapan komunikatif → latihan berbicara individual berbasis contoh → produksi kalām sesuai struktur yang telah ditentukan guru.",
      "Penyajian stimulus kontekstual bertema al-siyāḥah dan al-marāfiq al-'āmmah → pengamatan dan identifikasi unsur bahasa → latihan meniru ungkapan komunikatif → produksi kalām melalui presentasi lisan secara terpimpin dengan panduan.",
      "Penyajian stimulus kontekstual bertema al-siyāḥah dan al-marāfiq al-'āmmah → analisis kesalahan penggunaan ungkapan → perbaikan struktur kalimat secara bersama → produksi kalām berbasis kaidah yang telah dikoreksi peserta didik.",
      "Penyajian stimulus kontekstual bertema al-siyāḥah dan al-marāfiq al-'āmmah → eksplorasi serta penemuan pola ungkapan komunikatif → pengembangan kemampuan berbicara secara bertahap → produksi kalām sesuai karakteristik siswa."
    ],
    "a": 4
  },
  {
    "q": "Seorang guru Bahasa Arab kelas XI Madrasah Aliyah merumuskan tujuan pembelajaran sebagai berikut: peserta didik mampu mengekspresikan gagasan secara lisan dalam bahasa Arab dengan percaya diri dan sesuai konteks sederhana. Namun, hasil asesmen awal menunjukkan bahwa sebagian besar peserta didik mengalami kecemasan berbahasa (language anxiety), enggan berbicara di kelas, dan lebih nyaman merespons dalam bentuk non-lisan. Dalam pelaksanaan pembelajaran, guru tidak langsung menuntut peserta didik memproduksi ujaran lisan, tetapi memulai kegiatan dengan memperdengarkan dialog sederhana, memberi kesempatan peserta didik merespons secara terbimbing, serta membangun interaksi kelas yang menekankan rasa aman dan penerimaan. Guru secara sadar menunda tuntutan performa berbicara, menyesuaikan urutan materi ajar dengan kesiapan afektif peserta didik, dan menggunakan hasil pengamatan tersebut untuk menilai kembali apakah tujuan pembelajaran yang telah dirumuskan sudah realistis untuk dicapai pada tahap tersebut. Oleh karena itu, guru menata alur materi ajar dengan berlandaskan teori-teori pemerolehan bahasa sebagai dasar pengambilan keputusan pedagogik. Berdasarkan praktik pedagogi tersebut, alur materi ajar teori pemerolehan bahasa yang paling tepat digunakan guru untuk mengevaluasi kesesuaian tujuan pembelajaran dengan karakteristik peserta didik adalah...",
    "o": [
      "Memulai dari pemberian input yang dapat dipahami, dilanjutkan interaksi bermakna, kemudian evaluasi tujuan berdasarkan kesiapan afektif dan linguistik peserta didik.",
      "Memulai dari latihan produksi bahasa terkontrol, dilanjutkan koreksi kesalahan terarah, kemudian evaluasi tujuan berdasarkan ketepatan struktur kebahasaan peserta didik.",
      "Memulai dari penguasaan kaidah gramatikal formal, dilanjutkan dengan hafalan kosakata tematik, kemudian evaluasi tujuan berdasarkan hasil tes asesmen tertulis peserta didik.",
      "Memulai dari pemaparan terkait teori linguistik deskriptif, dilanjutkan dengan diskusi konsep abstrak, kemudian evaluasi tujuan berdasarkan pemahaman kognitif peserta didik.",
      "Memulai dari penugasan mandiri terstruktur, dilanjutkan dengan presentasi tugas lisan terbatas, kemudian evaluasi tujuan pembelajaran berdasarkan keberanian tampil peserta didik."
    ],
    "a": 0
  },
  {
    "q": "Seorang guru Bahasa Arab merencanakan pembelajaran setelah melakukan refleksi awal terhadap kondisi kelas. Guru menemukan bahwa peserta didik memiliki latar sosial dan budaya yang beragam, dengan kecenderungan belajar yang berbeda—sebagian aktif dalam kerja kelompok, sementara sebagian lain lebih nyaman belajar secara individual. Dalam perencanaan pembelajaran, guru menilai bahwa pencapaian kompetensi kebahasaan perlu disertai dengan pembiasaan sikap bekerja sama dan saling menghargai perbedaan. Atas dasar pertimbangan tersebut, guru memilih mengembangkan materi ajar berbasis tugas kontekstual yang memungkinkan peserta didik berkolaborasi secara bertahap, namun tetap memberi ruang diferensiasi sesuai karakteristik belajar masing-masing. Berdasarkan praktik pedagogi tersebut, pengembangan materi ajar yang paling tepat untuk dirumuskan dalam tujuan pembelajaran terkait nilai-nilai P5 adalah...",
    "o": [
      "mengembangkan materi ajar kolaboratif berfokus aktivitas kelompok untuk menanamkan nilai P5 sesuai tujuan pembelajaran bahasa.",
      "menyusun materi ajar berbasis tugas individu terstruktur untuk memastikan pencapaian kompetensi kebahasaan peserta didik secara optimal.",
      "mengembangkan materi ajar kontekstual dengan variasi tugas kolaboratif dan individual untuk mengintegrasikan nilai P5 secara adaptif.",
      "merancang materi ajar berorientasi kompetensi bahasa dengan penekanan capaian akademik sebagai tujuan pembelajaran utama.",
      "menyusun materi ajar berbasis proyek kolaboratif menyeluruh sebagai strategi pembelajaran nilai P5 dalam kelas."
    ],
    "a": 2
  },
  {
    "q": "Dalam perencanaan pembelajaran Bahasa Arab kelas X dengan tema al-ta'āyush wa al-tasāmuḥ (kehidupan bersama dan toleransi), materi yang digunakan berupa kosakata dan teks sederhana tentang interaksi sosial sehari-hari, seperti menyampaikan pendapat, menyetujui, dan menanggapi perbedaan secara santun. Hasil refleksi menunjukkan bahwa peserta didik mampu memahami makna kosakata dan isi teks, namun belum konsisten menerapkan ungkapan sopan dan sikap menghargai saat berdialog dalam Bahasa Arab. Oleh karena itu, pengembangan materi ajar perlu diarahkan pada aktivitas berbahasa yang memungkinkan peserta didik mempraktikkan ungkapan toleransi dan adab berbicara dalam konteks komunikasi nyata, bukan sekadar memahami teks atau kaidah kebahasaan. Berdasarkan refleksi perencanaan pembelajaran tersebut, pengembangan materi ajar Bahasa Arab yang paling tepat untuk mengintegrasikan nilai Profil Pelajar Rahmatan lil 'Alamin (PPRA) adalah...",
    "o": [
      "Menyusun daftar mufradāt tentang toleransi lalu peserta didik menghafal kosakata dan menjelaskan artinya secara lisan.",
      "Mengembangkan teks qirā'ah berjudul al-ta'āyush al-silmī kemudian peserta didik menjawab pertanyaan pemahaman secara tertulis individual.",
      "Menyajikan kaidah nahwu dari teks toleransi lalu mengevaluasi pembelajaran melalui latihan soal struktur kalimat objektif.",
      "Merancang ḥiwār bertema al-ta'āyush disertai tugas kalām reflektif sehingga peserta didik mempraktikkan ungkapan terkait toleransi secara kontekstual.",
      "Menyediakan teks kitābah bertema al-tasāmuḥ lalu peserta didik mengembangkan paragraf deskriptif sesuai struktur dan kosakata tersedia."
    ],
    "a": 3
  },
  {
    "q": "Seorang guru Bahasa Arab di madrasah menghadapi peserta didik dengan latar belakang pemahaman keagamaan yang beragam. Dalam pembelajaran, guru tersebut tidak menyajikan materi secara normatif-doktrinal semata, tetapi mengaitkan teks-teks Bahasa Arab bertema kehidupan sosial dengan contoh praktik toleransi, keseimbangan sikap beragama, dan penghargaan terhadap perbedaan yang terjadi di lingkungan masyarakat sekitar. Pada tahap evaluasi, guru tidak hanya menilai penguasaan unsur kebahasaan, tetapi juga mengamati kemampuan peserta didik dalam merefleksikan nilai wasathiyah secara logis sesuai dengan pengalaman belajar mereka. Berdasarkan praktik tersebut, pengembangan materi ajar nilai-nilai Islam sebagai agama moderat paling tepat dilakukan dengan cara...",
    "o": [
      "Menyusun materi ajar yang menekankan penguatan hafalan teks keagamaan tanpa mengaitkannya dengan realitas sosial peserta didik.",
      "Mengembangkan materi ajar kontekstual yang mengintegrasikan teks Bahasa Arab dengan refleksi nilai toleransi dan keseimbangan.",
      "Memfokuskan materi ajar pada penjelasan konseptual moderasi beragama melalui definisi dan istilah tanpa contoh penerapan.",
      "Menyajikan materi ajar berbasis perbandingan mazhab secara teoritis untuk memperluas wawasan keagamaan peserta didik.",
      "Mengarahkan materi ajar pada penguasaan kaidah kebahasaan secara intensif sebelum membahas nilai moderasi."
    ],
    "a": 1
  },
  {
    "q": "Di sebuah madrasah yang berada pada lingkungan masyarakat majemuk, guru Bahasa Arab mendapati bahwa dalam pembelajaran teks bacaan dan dialog berbahasa Arab, sebagian peserta didik cenderung memahami kosakata dan struktur kalimat secara literal sehingga memaknai isi teks keagamaan tanpa mengaitkannya dengan konteks sosial. Kondisi tersebut berimplikasi pada munculnya sikap keagamaan yang kaku ketika peserta didik menafsirkan ungkapan-ungkapan berbahasa Arab yang berkaitan dengan kehidupan bermasyarakat. Menyikapi hal tersebut, guru mengembangkan materi ajar Bahasa Arab tematik bertema al-ta'āyush al-ijtimā'ī dengan mengintegrasikan pemahaman kosakata, struktur kalimat, dan makna teks berbahasa Arab dengan contoh praktik sosial di masyarakat, seperti kerja sama lintas kelompok dalam kegiatan kemanusiaan dan musyawarah warga dalam penyelesaian konflik. Pengembangan materi ajar ini dilakukan untuk membimbing peserta didik memahami makna teks berbahasa Arab secara utuh dan menerapkannya secara proporsional dalam kehidupan bermasyarakat. Berdasarkan deskripsi tersebut, penilaian yang paling tepat terhadap pengembangan materi ajar tersebut sebagai representasi Islam moderat (wasathiyah) adalah bahwa pengembangan materi ajar yang dilakukan oleh guru Bahasa Arab telah...",
    "o": [
      "menekankan penguasaan kosakata (mufradāt) dan struktur (tarkīb) kalimat bahasa Arab agar peserta didik memahami teks tepat.",
      "berfokus pada penyajian teks utama berbahasa Arab agar pemahaman peserta didik terhadap isi bacaan konsisten.",
      "mengarahkan peserta didik menafsirkan makna implisit teks bahasa Arab dengan menyesuaikan konteks sosial masyarakat lokal.",
      "mengintegrasikan pemahaman teks berbahasa Arab dengan realitas sosial secara proporsional sesuai konteks kehidupan peserta didik.",
      "menekankan penggunaan contoh nyata sosial keagamaan sebagai ilustrasi untuk menjelaskan makna inferensial teks bahasa Arab."
    ],
    "a": 3
  },
  {
    "q": "Seorang guru Bahasa Arab di Madrasah Aliyah yang menyelenggarakan program peminatan keagamaan merancang pembelajaran Ilmu Sharaf pada materi Mīzān ṣarfī. Peserta didik memiliki kemampuan beragam; sebagian telah mengenal wazan secara terpisah, tetapi belum mampu menjelaskan alasan perubahan bentuk kata ketika menemukan kata baru dalam teks. Dengan alokasi waktu satu pertemuan, guru perlu merancang pembelajaran yang mendorong peserta didik memecahkan masalah linguistik secara sistematis. Berdasarkan kondisi tersebut, rancangan pembelajaran berbasis masalah yang paling tepat untuk materi Mīzān ṣarfī adalah...",
    "o": [
      "Guru menyajikan daftar wazan mizan sharfi, menjelaskan pola perubahan secara langsung, lalu memberi latihan terbimbing agar peserta didik menirukan bentuk kata benar.",
      "Guru membagi peserta didik dalam kelompok heterogen, meminta menghafalkan wazan mizan sharfi dari buku, lalu mempresentasikan hasil hafalan secara lisan.",
      "Guru menyajikan teks pendek bermasalah, meminta peserta didik mengidentifikasi perubahan wazan, menelusuri pola mizan sharfi, lalu merumuskan kaidah inti bersama.",
      "Guru menjelaskan konsep mizan sharfi secara ringkas, menuliskan contoh perubahan bentuk kata, kemudian memberikan latihan individu untuk memastikan pemahaman peserta didik.",
      "Guru menugaskan peserta didik mencari definisi mizan sharfi dari sumber pembelajaran, mendiskusikan hasil temuan, lalu menyimpulkan konsep di akhir pembelajaran."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran Bahasa Arab, seorang guru menemukan bahwa peserta didik mampu menyebutkan unsur mubtada' dan khabar pada kalimat terpisah, tetapi menghasilkan penafsiran makna yang saling bertentangan ketika dihadapkan pada satu teks yang memuat beberapa jumlah ismiyyah dengan variasi bentuk khabar. Sebagian peserta didik menafsirkan makna kalimat secara lepas dari konteks, sementara yang lain hanya berpegang pada rumus gramatikal tanpa mampu menjelaskan implikasi maknanya. Guru kemudian menjadikan teks tersebut sebagai titik awal pembelajaran, meminta peserta didik mengidentifikasi masalah kebahasaan yang muncul, merumuskan pertanyaan terkait struktur jumlah ismiyyah, serta menguji dugaan pemaknaan mereka melalui diskusi sebelum guru memberikan penguatan konsep secara terarah. Berdasarkan stimulus tersebut, rancangan pembelajaran yang paling tepat mencerminkan pendekatan pembelajaran berbasis masalah dan pengetahuan pedagogik adalah...",
    "o": [
      "Guru menyajikan penjelasan konsep jumlah ismiyyah secara sistematis, memberikan contoh tambahan kontekstual, lalu meminta peserta didik menyimpulkan kaidah secara mandiri.",
      "Guru memaparkan perbedaan jenis khabar dalam jumlah ismiyyah secara terarah, mencontohkan penerapannya, kemudian melatih peserta didik melalui soal terstruktur bertahap.",
      "Guru meminta peserta didik membaca ulang teks jumlah ismiyyah secara kolaboratif, mencatat bentuk mubtada dan khabar, lalu mempresentasikan hasil analisis kelompok.",
      "Guru mengulas kembali kaidah jumlah ismiyyah yang relevan secara ringkas, membahas kesalahan umum peserta didik, kemudian melakukan evaluasi tertulis individual.",
      "Guru memulai dari persoalan makna dalam teks jumlah ismiyyah, memfasilitasi perumusan pertanyaan dan pengujian dugaan, lalu menautkannya dengan kaidah nahwu secara terintegrasi."
    ],
    "a": 4
  },
  {
    "q": "Seorang guru Bahasa Arab merancang pembelajaran Ilmu Ma'ani dalam konteks pendalaman keilmuan Bahasa Arab (peminatan keagamaan) dengan tujuan melatih peserta didik memahami ketepatan penggunaan kalimat deklaratif dan non-deklaratif (kalām khabarī dan kalām insyā'ī) berdasarkan tujuan tutur (speech act) dan konteks situasi (maqām), bukan sekadar bentuk kalimat. Guru menyajikan teks digital kontekstual yang memuat beberapa tuturan dengan bentuk kalimat serupa, tetapi digunakan dalam konteks komunikasi yang berbeda. Dalam teks tersebut, terdapat tuturan berbentuk deklaratif yang bermaksud memerintah, serta tuturan berbentuk interogatif (alistifhām) yang berfungsi menegaskan atau menyindir. Guru kemudian mengajukan masalah kebahasaan berupa ketidaktepatan penafsiran makna tuturan karena peserta didik hanya mengklasifikasikan jenis kalimat tanpa mempertimbangkan tujuan tutur dan situasi komunikatifnya. Peserta didik diminta menelusuri contoh serupa melalui sumber digital, menganalisis perbedaan fungsi makna tuturan berdasarkan konteks, serta merumuskan solusi kebahasaan yang tepat sesuai maqām. Selama proses tersebut, guru memfasilitasi pemecahan masalah secara kolaboratif dengan memanfaatkan teknologi pembelajaran dan menutup kegiatan dengan refleksi terhadap hubungan antara bentuk kalimat, tujuan tutur, dan konteks makna. Berdasarkan deskripsi kasus tersebut, rancangan pembelajaran manakah yang paling tepat untuk mengembangkan pemahaman peserta didik tentang fungsi makna tuturan dalam Ilmu Ma'ani melalui pendekatan pembelajaran berbasis masalah yang terintegrasi dengan teknologi?",
    "o": [
      "Penyajian masalah perbedaan fungsi makna tuturan dalam konteks nyata → eksplorasi contoh tuturan melalui sumber digital → diskusi kolaboratif tentang tujuan tutur dan maqām → perumusan solusi makna tuturan berbantuan teknologi pembelajaran.",
      "Penyajian definisi kalimat deklaratif dan interogatif → pengelompokan jenis kalimat berdasarkan bentuk → latihan identifikasi struktur kalimat melalui media digital → evaluasi pemahaman menggunakan kuis daring.",
      "Pemaparan teori kalām khabarī dan kalām insyā'ī → analisis contoh tuturan dari bahan ajar → diskusi terbimbing mengenai jenis kalimat → penugasan individu melalui platform pembelajaran.",
      "Penyediaan teks sebagai bahan bacaan → penandaan kalimat deklaratif dan non-deklaratif → presentasi hasil klasifikasi kelompok → umpan balik guru menggunakan aplikasi pembelajaran.",
      "Penyampaian tujuan pembelajaran di awal kegiatan → demonstrasi penggunaan kalimat dalam konteks → latihan penerapan tuturan secara tertulis → refleksi hasil belajar berbasis jurnal digital."
    ],
    "a": 0
  },
  {
    "q": "Seorang guru Bahasa Arab di MA peminatan keagamaan melaksanakan pembelajaran pada materi Bahasa Arab di antara rumpun Semit dengan menekankan posisi bahasa Arab dibandingkan bahasa Ibrani dan Aram dari sisi asal-usul, karakter fonologis, dan kekhasan struktur morfologisnya. Dalam kelas tersebut, guru menghadapi peserta didik dengan karakteristik yang beragam: sebagian memiliki minat kuat pada kajian keilmuan bahasa dan turats, sebagian lebih mudah memahami konsep melalui visualisasi dan perbandingan sistematis, sementara sebagian peserta didik mengalami kesulitan ketika materi disajikan dalam bentuk paparan teoretis naratif. Guru ingin memastikan bahwa seluruh peserta didik dapat memahami konsep keilmuan secara proporsional tanpa menghilangkan kedalaman materi, sekaligus memberikan ruang belajar yang sesuai dengan perbedaan karakteristik individu. Berdasarkan kasus tersebut, rancangan pembelajaran yang paling tepat untuk materi Bahasa Arab di antara rumpun Semit dengan pendekatan pembelajaran berbasis perbedaan individu adalah...",
    "o": [
      "Penyampaian materi melalui orasi sistematis tentang rumpun Semit disertai penugasan rangkuman individu untuk menyeragamkan pemahaman konsep keilmuan.",
      "Penyajian materi melalui diskusi kelas besar dengan fokus pada sejarah bahasa Semit agar seluruh peserta didik memperoleh sudut pandang akademik yang sama.",
      "Perancangan pembelajaran diferensiatif melalui kombinasi teks ringkas, tabel perbandingan linguistik, dan visual fonologis sesuai karakteristik belajar siswa.",
      "Penggunaan satu media presentasi digital terpadu agar seluruh peserta didik mengikuti alur penjelasan materi secara seragam dan dengan kontrol kuat.",
      "Pemberian tugas membaca literatur linguistik tingkat lanjut sebagai strategi untuk menyesuaikan kedalaman materi dengan standar akademik."
    ],
    "a": 2
  },
  {
    "q": "Seorang guru Bahasa Arab di Madrasah Tsanawiyah melaksanakan pembelajaran keterampilan interaktif melalui dialog bertema al-ḥayāh al-madrasiyyah (kehidupan di madrasah). Dalam kegiatan dialog berpasangan, peserta didik diminta saling bertanya dan menanggapi tentang aktivitas belajar dan fasilitas madrasah. Guru menemukan bahwa sebagian peserta didik mampu merespons ujaran secara spontan, sementara sebagian lainnya masih memerlukan waktu dan bantuan untuk menanggapi lawan bicara. Guru ingin menjaga agar pembelajaran tetap mencerminkan hakikat interaksi berbahasa, sekaligus mengakomodasi perbedaan individu peserta didik. Rancangan pembelajaran yang paling tepat sesuai dengan pendekatan pembelajaran berbasis perbedaan individu adalah...",
    "o": [
      "Menyajikan satu pola dialog bertema al-ḥayāh al-madrasiyyah dan meminta seluruh peserta didik mempraktikkannya bersama agar interaksi kelas seragam secara konsisten.",
      "Mengelompokkan peserta didik secara fleksibel dan memberikan variasi peran dialog bertema al-ḥayāh al-madrasiyyah dengan tuntutan respons berbeda sesuai kesiapan berbahasa.",
      "Memusatkan pembelajaran pada peniruan dialog bertema al-ḥayāh al-madrasiyyah yang dicontohkan guru agar struktur interaksi lisan tetap terkontrol selama proses pembelajaran.",
      "Melaksanakan latihan dialog bertema al-ḥayāh al-madrasiyyah secara klasikal dengan alokasi waktu sama agar peserta didik memperoleh kesempatan seimbang berbicara proporsional.",
      "Menugaskan peserta didik menghafal dialog bertema al-ḥayāh al-madrasiyyah di luar kelas untuk meminimalkan perbedaan kemampuan berbicara antar peserta didik."
    ],
    "a": 1
  },
  {
    "q": "Dalam satu pertemuan pembelajaran Bahasa Arab, hasil kerja peserta didik menunjukkan produk mediasi yang berbeda-beda. Sebagian peserta didik mampu menyampaikan kembali isi teks Arab secara ringkas dan komunikatif, sebagian lain hanya memindahkan makna secara harfiah, dan sebagian masih kesulitan menata ulang informasi meskipun memahami teks sumber. Perbedaan tersebut juga tampak pada cara peserta didik memanfaatkan media digital selama pembelajaran berlangsung. Jika tujuan pembelajaran diarahkan pada penguasaan keterampilan mediatif sesuai struktur keilmuannya serta mempertimbangkan perbedaan individu dan pemanfaatan teknologi, rancangan pembelajaran yang paling tepat adalah...",
    "o": [
      "Guru menugaskan peserta didik menyusun ringkasan teks Arab tertulis menggunakan aplikasi pengolah kata untuk penilaian akhir.",
      "Guru mengelompokkan peserta didik heterogen untuk menerjemahkan teks Arab bersama melalui forum daring terstruktur.",
      "Guru menayangkan satu media penjelasan teks Arab kemudian meminta seluruh peserta didik mempresentasikan ulang isi teks.",
      "Guru menyediakan variasi bentuk produk mediasi berbasis teknologi dan menyesuaikannya dengan karakteristik belajar peserta didik.",
      "Guru memanfaatkan aplikasi penerjemah digital untuk membantu pemahaman teks Arab sebelum penugasan lanjutan."
    ],
    "a": 3
  },
  {
    "q": "Seorang guru Bahasa Arab di Madrasah Aliyah kelas X mengajar 36 peserta didik dengan kemampuan bahasa Arab sangat heterogen. Sebagian lulusan MTs telah mengenal huruf Arab dan kaidah dasar, sedangkan lulusan SMP masih berada pada silent period dan kesulitan literasi huruf. Hasil asesmen diagnostik menunjukkan banyak peserta didik berada pada tahap pemerolehan bahasa awal, ditandai pemahaman berbasis konteks, peniruan ungkapan formulaik, serta keterbatasan produksi bahasa mandiri. Guru menghadapi tekanan waktu, supervisi akademik, serta kewajiban menyediakan bukti asesmen terstandar yang adil, dapat dibandingkan, dan akuntabel. Tugas seragam berisiko tidak adil bagi pemula, sementara tugas berbeda berpotensi dipersoalkan validitasnya. Rancangan pembelajaran dan asesmen yang paling tepat adalah...",
    "o": [
      "Menetapkan tugas dan rubrik seragam untuk seluruh peserta didik agar objektivitas penilaian terjaga, meskipun berisiko mengabaikan kesiapan linguistik berbeda pada tahap pemerolehan awal bahasa siswa.",
      "Memberikan tugas berbeda kepada setiap kelompok tanpa rubrik setara sehingga penilaian terasa adil, namun validitas dan kesetaraan hasil belajar sulit dipertanggungjawabkan secara administratif sekolah resmi.",
      "Menilai seluruh peserta didik menggunakan tes objektif tertulis agar hasil mudah dibandingkan, cepat direkap, dan sesuai tuntutan supervisi, meskipun mengabaikan proses pemerolehan bahasa bertahap siswa.",
      "Mengurangi tuntutan asesmen performa dan produksi lisan bagi peserta didik pemula untuk menekan kecemasan, walaupun capaian pembelajaran dan akuntabilitas nilai berpotensi tidak terpenuhi secara optimal.",
      "Menetapkan tugas inti bersama dengan diferensiasi dukungan, rubrik setara, asesmen formatif bertahap, serta bukti performa yang adil, valid, akuntabel, dan sesuai tahap pemerolehan bahasa."
    ],
    "a": 4
  },
  {
    "q": "Seorang guru Bahasa Arab di Madrasah Aliyah peminatan keagamaan sedang menyiapkan pembelajaran balāghah pada topik fungsi makna susunan kalimat (taqdīm–ta'khīr, ḥaṣr, dan tawkīd) dalam teks keagamaan klasik dan kontemporer. Berdasarkan refleksi pembelajaran sebelumnya, guru menemukan bahwa peserta didik mampu menguasai aspek gramatikal secara terpisah—seperti mengidentifikasi jenis jumlah, unsur mubtada–khabar, dan pola fi'liyyah—namun mengalami kesulitan ketika harus menautkan susunan kalimat dengan pemaknaan pragmatik dalam wacana dakwah, khutbah, dan diskusi keagamaan. Kondisi tersebut menunjukkan bahwa peserta didik belum mencapai kemampuan menafsirkan makna ujaran secara kontekstual, khususnya memahami bagaimana susunan kalimat berperan dalam penekanan makna, maksud penutur, dan efek retoris. Guru ingin merancang pembelajaran yang berangkat dari struktur keilmuan balāghah, tetapi sekaligus mendorong keterlibatan kognitif tinggi, analisis teks secara holistik, serta konstruksi makna berdasarkan konteks penggunaan bahasa, sejalan dengan prinsip pembelajaran mendalam (al-ta'allum al-mut'ammiq). Berdasarkan kasus tersebut, rancangan pembelajaran yang paling tepat adalah...",
    "o": [
      "Mengajak peserta didik menganalisis teks dakwah autentik, menautkan struktur kalimat dengan konteks penggunaannya, lalu merefleksikan fungsi penekanan makna dalam situasi komunikasi keagamaan nyata.",
      "Menyajikan konsep balāghah secara sistematis, kemudian meminta peserta didik mengidentifikasi susunan kalimat dan unsur kebahasaan melalui latihan tertulis terstruktur serta terarah oleh guru.",
      "Menugaskan peserta didik menghafal definisi dan klasifikasi balāghah, kemudian menguji pemahaman melalui tes tertulis berbasis istilah dan contoh kalimat baku sederhana.",
      "Menampilkan contoh kalimat balāghah terpilih tanpa konteks wacana, lalu meminta peserta didik menentukan kategori susunan kalimat berdasarkan ciri kebahasaan formal yang tampak.",
      "Mengarahkan peserta didik menyimpulkan konsep balāghah dari penjelasan guru, kemudian mencocokkannya dengan contoh kalimat yang telah disediakan sebelumnya secara terbatas."
    ],
    "a": 0
  },
  {
    "q": "Seorang guru Bahasa Arab di Madrasah Ibtidaiyah mengajarkan tema an-nashāṭātu al-yaumiyyatu fī al-madrasah. Pembelajaran tidak hanya menargetkan penguasaan kosakata dan ungkapan sederhana, tetapi juga penanaman nilai kejujuran (aṣ-ṣidq) melalui konteks penggunaan bahasa. Peserta didik mengamati gambar dan video kegiatan madrasah, mendengarkan ḥiwār basīṭ, lalu mendiskusikan perilaku jujur yang tampak dalam kegiatan tersebut. Guru memanfaatkan media digital interaktif dan membimbing peserta didik menyampaikan kembali pemahaman melalui aktivitas sederhana berbasis teknologi. Berdasarkan kasus tersebut, rancangan pembelajaran yang paling mencerminkan pendekatan pembelajaran mendalam (deep learning) yang terintegrasi dengan pendidikan karakter dan pemanfaatan teknologi pada jenjang MI adalah...",
    "o": [
      "Pembelajaran yang menekankan latihan pengulangan kosakata kegiatan madrasah melalui aplikasi digital interaktif untuk membantu peserta didik menghafal ungkapan sederhana secara lebih bertahap.",
      "Pembelajaran yang berfokus pada penjelasan nilai kejujuran dalam kegiatan madrasah dengan memanfaatkan video pembelajaran sebagai ilustrasi pendukung selama proses memahami materi dasar.",
      "Pembelajaran yang menghubungkan pengamatan media digital, ḥiwār basīṭ, dan praktik perilaku jujur agar peserta didik memahami makna bahasa serta nilai secara kontekstual terpadu.",
      "Pembelajaran yang mengutamakan latihan evaluasi berbentuk soal digital untuk mengukur penguasaan kosakata tentang kegiatan madrasah secara terstruktur bagi seluruh peserta didik.",
      "Pembelajaran yang meminta peserta didik menonton video kegiatan madrasah secara mandiri sambil tetap memperoleh arahan guru untuk memastikan pemahaman bahasa yang tepat."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran Bahasa Arab jenjang MTs, guru mengajarkan fungsi sosial tindak tutur menyatakan persetujuan dan penolakan secara santun (al-muwāfaqah wa al-rafḍ) melalui dialog sederhana kehidupan madrasah. Hasil asesmen formatif sebelumnya menunjukkan bahwa sebagian peserta didik mampu menirukan ungkapan persetujuan dan penolakan ketika diberi contoh, namun belum mampu menggunakannya secara mandiri dalam dialog lisan yang kontekstual, serta cenderung menghafal pola tanpa memahami situasi tutur. Kondisi kelas bersifat heterogen, waktu tatap muka terbatas, dan sarana pembelajaran yang tersedia meliputi LMS madrasah aktif, papan tulis digital, koneksi internet stabil, serta perangkat digital peserta didik yang beragam. Guru menetapkan bahwa keberhasilan pembelajaran ditentukan oleh kemampuan peserta didik memproduksi tindak tutur secara lisan, kontekstual, dan mandiri, sehingga penilaian yang digunakan harus bersifat autentik berbasis performa berbicara (kalām). Rancangan pembelajaran manakah yang PALING TEPAT dipilih guru untuk mengatasi permasalahan pembelajaran tersebut dengan tetap menjaga keselarasan antara tujuan, proses, asesmen, dan pemanfaatan teknologi (TPACK)?",
    "o": [
      "Guru menampilkan video dialog kehidupan madrasah; peserta didik mengidentifikasi ungkapan persetujuan dan penolakan melalui papan tulis digital; latihan dilakukan secara klasikal melalui tanya jawab; penilaian akhir berupa tes lisan singkat saat tatap muka.",
      "Guru menyediakan contoh dialog digital di LMS; peserta didik menganalisis ungkapan persetujuan dan penolakan secara mandiri; latihan dilanjutkan dengan penulisan dialog sederhana; penilaian dilakukan melalui unggahan teks dialog ke LMS.",
      "Guru memulai dengan video dialog kontekstual; peserta didik menelaah ungkapan persetujuan dan penolakan melalui papan tulis digital; peserta didik merekam role-play dialog lisan berpasangan berdasarkan situasi berbeda dan mengunggahnya ke LMS; penilaian menggunakan rubrik performa berbicara.",
      "Guru memanfaatkan video dialog sebagai pemodelan; peserta didik menyusun dialog bersama guru; latihan dilakukan dengan presentasi lisan di kelas; penilaian dilakukan melalui observasi langsung tanpa dokumentasi digital.",
      "Guru menampilkan dialog audio; peserta didik mengidentifikasi ungkapan persetujuan dan penolakan; latihan dilakukan dengan membuat poster dialog digital; penilaian difokuskan pada kesesuaian isi dialog dengan tema."
    ],
    "a": 2
  },
  {
    "q": "Seorang guru Bahasa Arab kelas XI pada Madrasah Aliyah mendapati bahwa materi Bina al-Kalimah dalam buku ajar masih didominasi kosakata dan konteks klasik yang kurang relevan dengan kehidupan peserta didik generasi Z. Kondisi tersebut menyebabkan rendahnya keterlibatan peserta didik dan kecenderungan memandang pembelajaran sebagai aktivitas hafalan semata. Guru berencana menerapkan pendekatan Project-Based Learning (PBL) agar pembelajaran Bina al-Kalimah tidak hanya mencapai tujuan kebahasaan, tetapi juga mendorong kolaborasi, berpikir kritis, serta keterkaitan bahasa dengan realitas kontemporer. Guru memiliki akses terhadap perangkat digital dan koneksi internet yang memadai. Langkah awal manakah yang paling tepat dilakukan guru untuk menerapkan pendekatan Project-Based Learning (PBL) dalam konteks permasalahan tersebut?",
    "o": [
      "Guru menentukan kosakata modern relevan kehidupan generasi Z lalu menugaskan peserta didik menyusun latihan pembentukan kata secara mandiri.",
      "Guru bersama peserta didik merumuskan masalah nyata sebagai tema proyek lalu mengidentifikasi kebutuhan kosakata dan pola Bina al-Kalimah.",
      "Guru menampilkan media digital berisi kosakata modern lalu meminta peserta didik menganalisis pola pembentukan kata secara individual.",
      "Guru membagi peserta didik dalam kelompok kecil lalu menugaskan penyusunan daftar kosakata Bina al-Kalimah berdasarkan tema tertentu.",
      "Guru menyajikan materi Bina al-Kalimah melalui aplikasi pembelajaran daring dan memberikan penugasan berbasis kuis untuk meningkatkan partisipasi belajar peserta didik."
    ],
    "a": 1
  },
  {
    "q": "Pak Hasan adalah guru Bahasa Arab kelas VIII di sebuah Madrasah Tsanawiyah yang memiliki sarana TIK memadai. Pada pembelajaran materi Isim Majrur, ia selama ini menggunakan metode ceramah dan latihan i'rāb sederhana dari buku teks. Hasil refleksi menunjukkan bahwa sebagian peserta didik memahami Isim Majrur secara mekanis, sulit mengaitkannya dengan konteks kehidupan sehari-hari, serta kurang terlibat aktif dalam proses pembelajaran. Untuk memperbaiki kondisi tersebut, Pak Hasan berencana menerapkan pembelajaran berbasis Proyek (Project Based Learning/PjBL) dalam alokasi waktu tiga pertemuan (6 JP) dengan tujuan menciptakan pembelajaran yang kontekstual, kolaboratif, dan menyenangkan sesuai karakteristik peserta didik MTs. Berdasarkan stimulus di atas, rancangan penerapan PjBL manakah yang paling tepat untuk pembelajaran materi Isim Majrur di Madrasah Tsanawiyah?",
    "o": [
      "Guru menugaskan peserta didik secara berkelompok membuat video sederhana berbahasa Arab yang menjelaskan pengertian dan contoh Isim Majrur, kemudian menayangkannya di kelas untuk mendapatkan tanggapan guru dan teman.",
      "Guru meminta peserta didik secara individu menyusun peta konsep tentang Isim Majrur dan huruf jar beserta contohnya, lalu menempelkannya di kelas sebagai media belajar visual.",
      "Guru memfasilitasi peserta didik secara berkelompok menyusun proyek kamus visual Isim Majrur berbasis lingkungan madrasah, dengan menyajikan benda nyata dalam kalimat berbahasa Arab disertai penjelasan fungsi jar.",
      "Guru mengarahkan peserta didik melakukan permainan peran sederhana bertema aktivitas sekolah dengan menggunakan kalimat yang mengandung Isim Majrur, kemudian mendiskusikannya bersama.",
      "Guru menugaskan setiap kelompok menulis teks pendek berbahasa Arab tentang kegiatan sehari-hari dengan mencantumkan beberapa contoh Isim Majrur yang benar secara struktur."
    ],
    "a": 2
  },
  {
    "q": "Seorang guru Bahasa Arab di Madrasah Aliyah Peminatan mendapati bahwa peserta didik kurang antusias dan mengalami kesulitan dalam memahami materi Ilmu Bayan, khususnya Tasybih dan Majaz. Hal tersebut disebabkan oleh penggunaan contoh-contoh klasik dalam buku teks yang tidak lagi selaras dengan realitas kehidupan digital peserta didik generasi Z. Guru tersebut berupaya menerapkan pendekatan Digital-Based Learning (DBL) agar pembelajaran menjadi lebih kontekstual, bermakna, dan membahagiakan. Langkah strategis yang paling tepat dilakukan guru tersebut adalah...",
    "o": [
      "Menugaskan peserta didik menelusuri definisi Tasybih dan Majaz melalui sumber digital lalu merangkumnya dalam dokumen daring secara individual.",
      "Menggunakan aplikasi kecerdasan buatan untuk menerjemahkan teks-teks balaghah klasik agar peserta didik memahami makna secara cepat dan praktis.",
      "Menugaskan peserta didik secara berkelompok memproduksi konten digital yang merepresentasikan fenomena populer dengan menerapkan Tasybih atau Majaz secara tepat.",
      "Menayangkan video ceramah ahli balaghah dari platform digital lalu memberikan kuis daring untuk mengukur penguasaan konsep peserta didik.",
      "Mengarahkan peserta didik menggunakan kamus digital untuk menemukan makna kosakata saat menganalisis teks balaghah klasik di kelas."
    ],
    "a": 2
  },
  {
    "q": "Seorang guru Bahasa Arab di MTs kelas VII mengajarkan materi struktur kalimat sederhana (mubtada'–khabar dan fi'il–fā'il) dengan menekankan hafalan kaidah dan contoh kalimat buatan. Pembelajaran didominasi penjelasan guru, pencatatan definisi, serta latihan tertutup yang menuntut satu jawaban benar. Hasil pemantauan pembelajaran menunjukkan bahwa peserta didik mampu menyebutkan istilah tata bahasa secara terpisah, tetapi mengalami kesulitan memahami fungsi struktur kalimat ketika dihadapkan pada teks Arab sederhana yang sering dijumpai dalam kehidupan sehari-hari. Selain itu, sebagian peserta didik tampak pasif dan kurang percaya diri dalam menafsirkan makna kalimat secara mandiri. Padahal, kurikulum MTs menuntut pembelajaran Bahasa Arab yang akomodatif terhadap karakteristik peserta didik awal remaja, mendorong kemandirian berpikir, serta relevan dengan perkembangan zaman. Madrasah juga memiliki akses terhadap teks Arab autentik sederhana berbasis digital yang dapat dimanfaatkan sebagai sumber belajar. Guru diminta merancang ulang pembelajaran dengan pendekatan Discovery Learning agar pembelajaran tidak hanya berorientasi pada penguasaan kaidah, tetapi juga mendukung pembentukan karakter unggul dan kesiapan peserta didik menghadapi jenjang pendidikan berikutnya. Pertimbangan pedagogik yang paling tepat dalam memilih model pembelajaran Discovery Learning pada kasus tersebut adalah...",
    "o": [
      "Discovery Learning memungkinkan peserta didik kelas VII menemukan fungsi struktur kalimat melalui pengamatan teks Arab autentik sederhana sehingga tumbuh kemandirian berpikir, sikap percaya diri, dan kesiapan menghadapi tantangan belajar bahasa secara berkelanjutan.",
      "Discovery Learning memberi ruang kepada peserta didik kelas VII untuk berdiskusi dalam kelompok kecil, mengamati contoh kalimat, dan mempresentasikan hasil kerja agar pembelajaran berlangsung aktif menarik serta mendorong keterlibatan belajar bersama berkelanjutan.",
      "Discovery Learning membantu peserta didik kelas VII memahami kaidah tata bahasa tradisional dan modern melalui kegiatan eksplorasi bertahap dengan bimbingan guru hingga konsep dipahami secara benar kontekstual sistematis reflektif berkelanjutan efektif utuh.",
      "Discovery Learning menempatkan peserta didik kelas VII sebagai pusat pembelajaran melalui penggunaan media digital, aktivitas pencarian informasi, dan variasi kegiatan kelas yang bersifat interaktif fleksibel kolaboratif adaptif reflektif kontekstual bermakna terarah berkelanjutan.",
      "Discovery Learning digunakan agar peserta didik kelas VII terlibat dalam kegiatan menemukan pola bahasa dari sumber belajar yang tersedia sehingga pembelajaran terasa lebih kontekstual bermakna menantang reflektif adaptif kolaboratif sistematis terarah."
    ],
    "a": 0
  },
  {
    "q": "Seorang guru Bahasa Arab kelas XI mengajarkan keterampilan reseptif berupa istimā' (menyimak) dan qirā'ah (membaca) dengan menggunakan rekaman lama dari buku paket serta teks-teks klasik bertema al-Madrasah dan al-Usrah. Berdasarkan refleksi pembelajaran dan hasil asesmen, peserta didik menunjukkan kejenuhan serta kesulitan mengaitkan materi dengan realitas digital mereka sebagai generasi Z. Pembelajaran tersebut juga belum melatih kemampuan menyaring informasi dari berbagai sumber serta belum membekali keterampilan reseptif yang dibutuhkan untuk studi lanjut maupun dunia kerja kontemporer. Guru ingin merancang pembelajaran baru dengan mengintegrasikan teknologi secara bermakna melalui pendekatan TPACK agar pembelajaran lebih adaptif, kontekstual, dan berorientasi daya saing. Berdasarkan kasus tersebut, rancangan model pembelajaran berpendekatan TPACK yang paling tepat untuk mengembangkan keterampilan reseptif secara adaptif adalah...",
    "o": [
      "Guru menggunakan platform kuis daring untuk menyajikan soal istimā' dan qirā'ah berbasis audio serta teks digital, peserta didik menjawab melalui gawai pribadi, dan guru memberi umpan balik sesuai skor hasil kuis.",
      "Guru menugaskan peserta didik menelusuri podcast atau vlog berbahasa Arab bertema isu kontemporer secara kolaboratif, menyusun rangkuman dari isi audio, lalu mempresentasikan hasilnya memakai media digital kelas daring.",
      "Guru membagikan artikel berita Arab bertema isu global melalui platform kelas digital, peserta didik membaca mandiri lalu mengerjakan tugas analisis kritis berorientasi HOTS, dan guru menilai kinerjanya dengan rubrik.",
      "Guru merancang pembelajaran berbasis WebQuest bertema profesi melalui platform digital, peserta didik berkolaborasi menjalankan peran tertentu menyimak audio dan membaca teks autentik, lalu menyusun portofolio digital.",
      "Guru menggunakan video pendek atau animasi berbahasa Arab dengan subtitel digital, peserta didik menyimak audio dan membaca teks terpadu, kemudian mengerjakan latihan pemahaman kosakata melalui lembar kerja digital."
    ],
    "a": 3
  },
  {
    "q": "Seorang guru Bahasa Arab di Madrasah Tsanawiyah (MTs) mendapati bahwa pembelajaran keterampilan produktif (kalam dan kitabah) masih berpusat pada hafalan dialog dan penugasan menulis tanpa ruang ekspresi diri. Banyak peserta didik enggan berbicara dan menulis karena takut melakukan kesalahan serta merasa kurang percaya diri. Guru menyadari bahwa hambatan tersebut berkaitan dengan aspek psikologis remaja awal dan tidak cukup diselesaikan melalui latihan linguistik semata. Oleh karena itu, guru berupaya menerapkan pendekatan pembelajaran yang lebih sesuai dengan perkembangan peserta didik dan mampu membangun keberanian, refleksi diri, serta motivasi belajar. Model pembelajaran yang paling tepat untuk diterapkan dalam kondisi tersebut adalah...",
    "o": [
      "Mengoptimalkan latihan kalam dan kitabah melalui drill intensif berbasis pengulangan terstruktur agar siswa terbiasa menggunakan pola bahasa Arab yang benar konsisten.",
      "Mengintegrasikan pembelajaran keterampilan produktif dengan layanan bimbingan konseling yang menekankan pendampingan emosional refleksi diri serta penguatan kepercayaan diri peserta didik.",
      "Menerapkan penilaian keterampilan produktif secara ketat menggunakan rubrik analitik rinci agar akurasi kebahasaan peserta didik meningkat sesuai standar pembelajaran.",
      "Menugaskan peserta didik menghasilkan produk lisan dan tulisan secara individual untuk melatih kemandirian belajar serta mengukur tanggung jawab personal secara objektif.",
      "Mengintegrasikan pembelajaran keterampilan produktif dengan pendekatan reflektif berbasis aktivitas komunikasi autentik guna meningkatkan motivasi belajar tanpa layanan bimbingan konseling."
    ],
    "a": 1
  },
  {
    "q": "Seorang guru Bahasa Arab kelas V Madrasah Ibtidaiyah mengembangkan bahan ajar keterampilan membaca (qirā'ah) dengan tema aktivitas sehari-hari di lingkungan madrasah. Bahan ajar tersebut disusun dalam satu teks bacaan berjudul: Anā fī al-madrasah. Teks memuat kosakata dasar yang dekat dengan kehidupan peserta didik, seperti kitābun, kursiyyun, sā'atun, mu'allimun, dan ṣadīqun. Namun, bahan ajar hanya disajikan dalam satu bentuk teks tertulis tanpa ilustrasi pendukung, tanpa variasi tingkat kesulitan, dan tanpa pilihan aktivitas alternatif. Dalam pelaksanaannya, guru menemukan bahwa sebagian peserta didik mengalami hambatan pemahaman karena perbedaan kecepatan membaca, keterbatasan konsentrasi, serta kebutuhan belajar yang beragam. Guru bermaksud merevisi bahan ajar tersebut agar tetap mencapai tujuan pembelajaran Bahasa Arab Madrasah Ibtidaiyah sekaligus mampu mengakomodasi kebutuhan belajar peserta didik. Berdasarkan kasus tersebut, pendekatan pengembangan bahan ajar berbasis pelayanan ABK yang paling tepat diterapkan oleh guru adalah...",
    "o": [
      "Menyederhanakan isi teks bacaan agar seluruh peserta didik mempelajari materi yang sama tanpa perbedaan bentuk penyajian.",
      "Menambahkan latihan kosakata secara tertulis dengan pola pengerjaan yang sama bagi seluruh peserta didik di kelas.",
      "Menyajikan bahan ajar dalam bentuk teks bertingkat, dilengkapi visual pendukung, serta aktivitas alternatif sesuai kebutuhan siswa.",
      "Menyesuaikan target capaian membaca dengan menurunkan tingkat kesulitan materi bagi peserta didik tertentu.",
      "Mengelompokkan peserta didik berdasarkan kemampuan membaca lalu memberikan bahan ajar yang berbeda untuk setiap kelompok."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran keterampilan qirā'ah di kelas VII Madrasah Tsanawiyah, guru Bahasa Arab melaksanakan tes diagnostik awal dan menemukan perbedaan kemampuan membaca peserta didik. Sebagian siswa masih kesulitan memahami makna umum teks sederhana, sebagian telah mampu mengidentifikasi gagasan utama, dan sebagian lainnya mulai mampu menafsirkan informasi tersirat dalam teks pendek. Berdasarkan temuan tersebut, guru ingin merancang pembelajaran membaca yang berpusat pada peserta didik agar proses belajar lebih efektif dan sesuai kebutuhan belajar siswa. Berdasarkan kasus tersebut, tindakan pedagogik guru paling tepat adalah...",
    "o": [
      "Menyampaikan materi membaca yang sama kepada seluruh siswa agar capaian pembelajaran tetap seragam di kelas tersebut.",
      "Memberikan latihan membaca tambahan secara individual tanpa membedakan bahan ajar agar siswa beradaptasi secara mandiri.",
      "Menugaskan siswa berkemampuan membaca tinggi membantu teman lain menggunakan bahan ajar sama dalam satu kelompok.",
      "Mengelompokkan peserta didik berdasarkan kemampuan membaca serta menyediakan bahan ajar berbeda sesuai kebutuhan kelompok.",
      "Memberikan bahan bacaan yang lebih sulit kepada semua siswa agar kemampuan membaca meningkat secara merata."
    ],
    "a": 3
  },
  {
    "q": "Di Madrasah Tsanawiyah, guru Bahasa Arab tidak hanya mengajarkan keterampilan berbahasa, tetapi juga secara struktural bertanggung jawab terhadap pendidikan karakter melalui proses pembelajaran. Namun, tanggung jawab tersebut menuntut pendekatan yang relevan dengan realitas peserta didik. Seorang guru Bahasa Arab menyajikan pendidikan karakter melalui ceramah dan hafalan definisi nilai kejujuran, disiplin, dan tanggung jawab. Peserta didik mampu menjelaskan konsep nilai tersebut, tetapi dalam praktik pembelajaran Bahasa Arab masih menunjukkan perilaku kurang sesuai, seperti menyalin tugas dari grup WhatsApp kelas, kurang santun menggunakan ungkapan bahasa Arab sederhana dalam forum daring, serta kurang bertanggung jawab dalam kerja kelompok berbasis proyek. Kondisi tersebut menunjukkan bahwa pendekatan pembelajaran yang digunakan belum membantu peserta didik menghubungkan nilai karakter dengan pengalaman nyata mereka. Guru perlu menentukan pendekatan pembelajaran yang tepat agar pendidikan karakter benar-benar terinternalisasi melalui pembelajaran Bahasa Arab. Pendekatan pembelajaran paling tepat untuk digunakan pada konteks tersebut adalah...",
    "o": [
      "Pendekatan kontekstual-reflektif yang mengaitkan nilai karakter dengan pengalaman nyata melalui analisis kasus, refleksi terbimbing, dan pengambilan keputusan bersama.",
      "Pendekatan tekstual-deduktif yang menguatkan pemahaman nilai karakter melalui penjelasan konsep, pengayaan definisi, dan contoh perilaku ideal dari buku ajar.",
      "Pendekatan instruksional langsung yang menanamkan nilai karakter melalui penegasan aturan kelas, keteladanan guru, dan pengawasan perilaku peserta didik di kelas.",
      "Pendekatan latihan terstruktur yang membiasakan nilai karakter melalui pengulangan tugas tertulis, latihan rutin, dan kepatuhan terhadap prosedur pembelajaran.",
      "Pendekatan afektif-normatif yang menumbuhkan nilai karakter melalui nasihat moral, pembiasaan sikap positif, dan penguatan norma perilaku peserta didik."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran Bahasa Arab di Madrasah Aliyah, Ustadz Ubaidillah Humaid mengajarkan materi teks deskriptif (waṣfu al-ḥayāti al-ijtimā'iyyati fī al-mujtama') dengan pendekatan text-oriented yang berfokus pada pembacaan teks, analisis struktur kebahasaan, dan pemahaman makna secara literal. Pembelajaran dilaksanakan melalui penjelasan guru dan latihan tertulis tanpa mengaitkan isi teks dengan pengalaman sosial peserta didik maupun realitas kehidupan digital yang mereka hadapi sehari-hari. Akibatnya, peserta didik cenderung pasif, diskusi tidak berkembang, dan pembelajaran terasa monoton. Ustadz tersebut ingin memperbaiki pendekatan pembelajaran agar peserta didik lebih terlibat, merasa nyaman, dan mampu menggunakan bahasa Arab secara bermakna. Pendekatan pembelajaran paling relevan untuk digunakan ustadz tersebut agar tujuan pembelajaran tercapai secara optimal adalah...",
    "o": [
      "Pendekatan pembelajaran yang menekankan analisis struktur kebahasaan teks serta latihan tertulis secara sistematis.",
      "Pendekatan pembelajaran yang memfokuskan kegiatan pada teks melalui penguatan makna dan unsur kebahasaan.",
      "Pendekatan pembelajaran yang mengutamakan ketepatan kosakata dan pola kalimat melalui latihan berbasis teks.",
      "Pendekatan pembelajaran yang menitikberatkan pemahaman isi teks secara literal melalui tugas individual.",
      "Pendekatan pembelajaran yang mengaitkan pemahaman teks dengan konteks kehidupan peserta didik."
    ],
    "a": 4
  },
  {
    "q": "Dalam pembelajaran Bahasa Arab di Madrasah Aliyah, Ustadz Ubaidillah Humaid mengajarkan materi teks deskriptif (waṣfu al-ḥayāti al-ijtimā'iyyati fī al-mujtama') dengan pendekatan text-oriented. Pembelajaran berfokus pada pembacaan teks dan latihan tertulis tanpa mengaitkan isi teks dengan pengalaman sosial peserta didik maupun realitas kehidupan digital yang mereka hadapi sehari-hari. Akibatnya, peserta didik kurang terlibat aktif dan pembelajaran terasa monoton. Ustadz tersebut ingin memperbaiki pendekatan pembelajaran agar proses belajar lebih hidup, mendorong keterlibatan aktif peserta didik, serta mendukung pembentukan karakter unggul dan daya saing. Pendekatan pembelajaran paling relevan untuk digunakan ustadz tersebut agar permasalahan pada kasus di atas dapat diatasi adalah...",
    "o": [
      "Pendekatan Audiolingual",
      "Pendekatan Grammar–Translation",
      "Pendekatan Struktural",
      "Pendekatan Drill-Based",
      "Pendekatan Context-Oriented, karena bisa membantu ustadz itu menjadikan pembelajaran berubah lebih aktif, bermakna, dan relevan."
    ],
    "a": 4
  },
  {
    "q": "Ustadzah Aminah Zahira merancang pembelajaran berbasis proyek (PjBL) pada materi fi'il muḍāri' al-majzūm melalui syair Arab. Peserta didik menganalisis hubungan struktur gramatikal dan makna, kemudian mengekspresikannya melalui video puisi, poster digital, dll. Berdasarkan konteks tersebut, instrumen asesmen manakah yang paling tepat digunakan untuk menilai capaian belajar peserta didik sesuai karakter mereka?",
    "o": [
      "Sikap dinilai melalui observasi guru saat diskusi, pengetahuan melalui tes tertulis, keterampilan melalui produk akhir dengan rubrik bahasa.",
      "Sikap diukur melalui jurnal refleksi mingguan, pengetahuan lewat tes lisan, keterampilan melalui presentasi.",
      "Sikap dinilai melalui penilaian sejawat berbasis rubrik kerja sama, pengetahuan diukur melalui portofolio analisis fi'il muḍāri' majzūm, keterampilan dinilai menggunakan rubrik autentik kualitas adaptasi kreatif pesan.",
      "Sikap diukur menggunakan angket Likert, pengetahuan melalui presentasi kelompok digital, keterampilan ditentukan lewat voting.",
      "Sikap dinilai melalui wawancara terstruktur, pengetahuan melalui rangkuman tertulis materi majzūm, keterampilan dinilai menggunakan daftar cek keterlibatan."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran Ilmu Ma'ani (fashl dan washl), Ustadzah Fatimah ingin memilih rancangan asesmen yang paling bertanggung jawab secara pedagogik, selaras dengan kedalaman berpikir, kolaborasi, dan refleksi. Rancangan teknik asesmen yang paling dapat dipertanggungjawabkan adalah...",
    "o": [
      "Tes tulis terstruktur pada akhir pembelajaran dan angket kemandirian belajar.",
      "Penilaian proyek kelompok berupa analisis teks pada galeri digital menggunakan rubrik konseptual dan partisipasi diskusi daring.",
      "Observasi keaktifan pada sesi sinkron dan penilaian portofolio tugas individu.",
      "Kombinasi asesmen formatif dan sumatif melalui kuis awal, penilaian proses diskusi kolaboratif berbasis rubrik, presentasi analisis sinkron, serta jurnal refleksi berkala.",
      "Penilaian autentik berbasis proyek individu melalui pembuatan video kreatif berbahasa Arab."
    ],
    "a": 3
  },
  {
    "q": "Sebagai dosen Linguistik Terapan, Anda mengajarkan topik Analisis Kesalahan Berbahasa Arab. Instrumen asesmen yang paling tepat digunakan untuk mengukur keterampilan mahasiswa dalam menganalisis kesalahan berbahasa Arab (identifikasi, pola, dan rekomendasi) adalah...",
    "o": [
      "Ujian tertulis esai analitis untuk mengukur pemahaman teori secara sistematis.",
      "Portofolio tugas analisis kesalahan berbahasa dikumpulkan bertahap berisi hasil analisis dan revisi umpan balik dosen melalui LMS.",
      "Tes objektif pilihan ganda untuk mengukur kemampuan mengenali konsep klasifikasi secara cepat.",
      "Lembar observasi keaktifan mahasiswa selama diskusi kelas dan praktik laboratorium.",
      "Angket refleksi diri mahasiswa mengenai kesulitan dialami saat menganalisis."
    ],
    "a": 1
  },
  {
    "q": "Ustadz Faris mengajarkan topik 'Ibdā' al-Ra'y fī al-Ḥayāh' dengan tujuan mencakup sikap (tasamuh), pengetahuan (struktur ungkapan), dan keterampilan (interaksi lancar). Kombinasi teknik asesmen manakah yang paling tepat dan konsisten untuk mengukur ketiga tujuan tersebut?",
    "o": [
      "Observasi partisipan dengan rubrik sikap selama dialog berlangsung, tes lisan menganalisis fungsi ungkapan siswa, serta penilaian kinerja simulasi dialog direkam sebagai portofolio pembelajaran.",
      "Tes tertulis menganalisis struktur, presentasi kelompok kesantunan, serta angket sikap refleksi diri.",
      "Proyek video dialog berbahasa Arab dinilai menggunakan rubrik holistik menilai kesantunan, pemahaman fungsi, dan kelancaran berbicara.",
      "Portofolio reflektif individu memuat catatan dialog, analisis teks, dan jurnal sikap siswa.",
      "Tes praktik dialog menilai keterampilan berbicara, penilaian sikap teman sebaya, serta kuis daring mengukur pemahaman."
    ],
    "a": 0
  },
  {
    "q": "Dalam mata pelajaran Bahasa Arab, seorang guru menerapkan Metode Pengajaran Bahasa Arab yang berorientasi pada keterampilan berbahasa mediatif. Pembelajaran diawali dengan kesepakatan kelas yang menekankan komunikasi santun, sikap moderat, dan penghargaan terhadap perbedaan pendapat. Guru menyajikan teks Arab populer bertema sosial... Berdasarkan skenario pembelajaran tersebut, kombinasi instrumen asesmen yang paling tepat digunakan oleh guru bahasa Arab itu adalah...",
    "o": [
      "Guru menilai sikap menggunakan angket sikap tertutup, mengukur pengetahuan melalui tes pilihan ganda tentang konsep mediatif, dan menilai keterampilan video berfokus pada kelengkapan teknis.",
      "Guru menilai sikap melalui penilaian diri, mengukur pengetahuan dengan kuis benar–salah konsep al-Ḥiṭāb al-Ijābī, dan menilai keterampilan menggunakan tes tertulis analisis teks.",
      "Guru menilai sikap melalui jurnal refleksi peserta didik, mengukur pengetahuan menggunakan lembar analisis teks tentang struktur kebahasaan ajakan, serta menilai keterampilan dengan rubrik unjuk kerja produk mediatif.",
      "Guru menilai sikap berdasarkan kehadiran, mengukur pengetahuan melalui tes uraian kaidah sharaf, serta menilai keterampilan menggunakan penilaian proyek video berbasis jumlah ismiyyah.",
      "Guru menilai sikap melalui pengamatan ekspresi, mengukur pengetahuan dengan kuis lisan istilah balaghah, dan menilai keterampilan berdasarkan durasi minimal presentasi."
    ],
    "a": 2
  },
  {
    "q": "Pada mata kuliah Pengembangan Bahan Ajar Bahasa Arab, mahasiswa merancang bahan ajar digital bertema al-ḥayāh al-madrasiyyah. Hasil asesmen formatif menunjukkan dominasi individu dalam kelompok, pemahaman fungsi na't dan iḍāfah yang terbatas, serta alur mediasi yang belum runtut. Teknik asesmen yang paling tepat digunakan dosen untuk menindaklanjuti ketiga aspek tersebut secara terpadu adalah...",
    "o": [
      "Observasi kolaborasi kelompok berbasis rubrik sikap, tes analisis teks tertulis, serta penilaian produk infografik.",
      "Observasi terstruktur proses kerja kelompok, tes berbasis studi kasus untuk menafsirkan fungsi na't dan iḍāfah dalam wacana, serta penilaian kinerja mediasi melalui proyek infografik bertahap yang merekam proses dan hasil.",
      "Observasi partisipasi diskusi kelas, kuis aplikasi gramatika pilihan ganda, serta penilaian portofolio infografik.",
      "Penilaian antar teman terhadap kerja sama tim, tes uraian analisis kaidah, serta penilaian proyek infografik.",
      "Observasi sikap kerja individu, tes penugasan analisis struktur kalimat, serta penilaian unjuk kerja presentasi."
    ],
    "a": 1
  },
  {
    "q": "Mahasiswa PPG diminta mengembangkan media interaktif berbasis Canva untuk unit al-ta'āruf. Temuan menunjukkan masalah pada tanggung jawab (sikap), analisis kesesuaian media (pengetahuan), dan kohesi alur media (keterampilan). Instrumen asesmen yang paling tepat untuk menindaklanjuti temuan tersebut adalah...",
    "o": [
      "Lembar observasi umum, tes pilihan ganda definisi strategi, dan daftar cek kelengkapan file.",
      "Skala penilaian persepsi diri, kuis istilah strategi berbasis hafalan, serta formulir penilaian durasi slide.",
      "Lembar observasi sikap tanggung jawab dengan indikator perilaku terukur, lembar soal analisis kesesuaian strategi-media dengan tujuan dan karakter murid, serta rubrik kinerja produk yang menilai kohesi alur, keterbacaan, dan kejelasan.",
      "Daftar hadir untuk sikap, tes uraian kaidah terpisah konteks, serta form penilaian popularitas media.",
      "Catatan refleksi bebas dosen, lembar rangkuman materi, serta format penilaian standar teknis."
    ],
    "a": 2
  },
  {
    "q": "Guru mengajarkan materi 'Keluarga' terintegrasi nilai birrul walidain. Asesmen awal menunjukkan masalah pada kesantunan bahasa, refleksi nilai, dan adab komunikasi nyata. Teknik asesmen lanjutan yang paling tepat adalah...",
    "o": [
      "Angket sikap pemahaman, tes pilihan ganda kosakata, dan penilaian naskah dialog tertulis.",
      "Refleksi tertulis individu, tes uraian struktur kalimat, dan penilaian kelengkapan dialog tertulis.",
      "Observasi umum, kuis pemahaman teks, dan penilaian produk dialog tanpa simulasi.",
      "Penilaian diri dan teman sejawat, tes objektif kaidah bahasa, dan penilaian rekaman dialog.",
      "Observasi terstruktur dengan indikator adab komunikasi keluarga untuk sikap, tes analitik yang menilai penerapan kosakata dan struktur dalam konteks birrul wālidain untuk pengetahuan, serta penilaian kinerja simulasi dialog keluarga untuk keterampilan."
    ],
    "a": 4
  },
  {
    "q": "Pembelajaran bertema Moderasi Beragama menunjukkan analisis nilai yang dangkal dan kurangnya tasāmuḥ dalam diskusi. Instrumen asesmen yang paling tepat untuk menilai sikap, pengetahuan, dan keterampilan pada konteks tersebut adalah...",
    "o": [
      "Observasi terstruktur sikap toleransi saat interaksi kalām, tes analisis kritis isi teks qirā'ah tentang moderasi beragama, serta rubrik kinerja berbicara yang menilai adab al-ḥiwār dan kejelasan argumen moderat.",
      "Skala sikap Likert, soal pilihan ganda konsep moderasi, serta penilaian ringkasan tertulis.",
      "Catatan anekdot non-terstruktur, tes benar–salah isi bacaan, serta ceklis kelancaran membaca.",
      "Rekap kehadiran, tes hafalan isi teks, dan pengukuran durasi berbicara.",
      "Refleksi tertulis sikap, soal uraian deskriptif, serta penilaian naskah dialog."
    ],
    "a": 0
  },
  {
    "q": "Guru merancang pembelajaran Jumlah Ismiyyah dengan slide animasi, namun tanpa latihan manipulasi struktur dan scaffolding pembeda dengan Jumlah Fi'liyyah. Praktik baik (best practice) yang seharusnya dilakukan guru adalah...",
    "o": [
      "Memperbanyak teks autentik tanpa gradasi kesulitan dan menggunakan teknologi sebatas visual.",
      "Guru memilih contoh Jumlah Ismiyyah bertahap, merancang scaffolding analisis mubtada'–khabar, serta menyiapkan teknologi interaktif berbasis manipulasi kalimat agar perencanaan terintegrasi dan berkelanjutan.",
      "Mengganti pembelajaran dengan latihan terjemahan struktural dan menekankan hafalan kaidah nahwu.",
      "Menambah waktu diskusi kelompok dan menyajikan video penjelasan tanpa tahapan analisis pemandu.",
      "Memfokuskan perencanaan pada variasi gaya belajar dan menggunakan teknologi sebagai media motivasional semata."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran gaya bahasa Balaghah menggunakan sumber digital, siswa kesulitan membedakan kategori karena teks tidak diperbandingkan dan teknologi hanya sebagai penyajian materi. Keputusan pedagogik praktik baik (best practice) adalah...",
    "o": [
      "Menghadirkan beragam teks digital secara terbuka melalui diskusi kolaboratif.",
      "Menata ulang urutan melalui penguatan konsep teoretis dan kuis daring.",
      "Mengembangkan proyek eksplorasi sumber digital tanpa mekanisme pembuktian eksplisit.",
      "Merancang contoh ujaran yang dapat diperbandingkan secara fungsional, memfasilitasi analisis perbedaan melalui pertanyaan berjenjang dan anotasi terarah, serta memanfaatkan teknologi sebagai alat verifikasi ciri kebahasaan secara kolaboratif.",
      "Mengoptimalkan platform untuk klasifikasi otomatis tanpa prosedur analisis manual."
    ],
    "a": 3
  },
  {
    "q": "Ustadz Rasyid mengajarkan istimā' pengumuman layanan umum. Hasil kuis menunjukkan siswa gagal paham, namun guru hanya memutar ulang audio tanpa strategi baru. Praktik terbaik (best practice) dalam evaluasi reseptif secara berkelanjutan adalah...",
    "o": [
      "Mengulang kuis digital yang sama memanfaatkan data skor sebagai indikator.",
      "Menyesuaikan tempo audio namun tetap mempertahankan kuis yang sama.",
      "Menganalisis hasil kuis awal untuk mengenali kesulitan pemahaman siswa, menyusun evaluasi formatif baru berbasis tugas menyimak bertahap, dan menggunakan hasilnya sebagai dasar perbaikan pembelajaran berikutnya.",
      "Mengganti teks lisan menjadi teks tulis agar lebih mudah dipahami siswa.",
      "Mengajak siswa merefleksikan kesulitan secara klasikal namun tetap menggunakan instrumen yang sama."
    ],
    "a": 2
  },
  {
    "q": "Ustaz Salman menggunakan AI untuk membantu pembelajaran namun tetap membandingkan hasilnya dengan kaidah Nahwu-Sharaf dan mendiskusikan bias AI dengan siswa. Penilaian paling tepat terhadap kemampuan Ustaz Salman adalah...",
    "o": [
      "Guru menunjukkan penguasaan materi yang reflektif dan kritis dengan memanfaatkan AI sebagai objek analisis pedagogis, bukan otoritas final, sehingga membuka ruang pembelajaran adaptif dan pengembangan profesional berkelanjutan.",
      "Guru telah mengoptimalkan AI untuk efisiensi sehingga fokus selanjutnya cukup pada penguasaan aplikasi terbaru.",
      "Guru memiliki kecakapan teknologi dan kolaborasi yang baik sehingga fokus pada peningkatan produktivitas.",
      "Guru menunjukkan loyalitas pada kaidah klasik dengan membatasi peran AI.",
      "Guru mampu memadukan teknologi sehingga fokus selanjutnya adalah pada variasi media."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran kitabah, tulisan siswa menjadi mirip gaya AI dan kehilangan ekspresi personal. Analisis masalah dan keputusan pedagogis ilmiah paling tepat untuk menunjukkan jati diri guru profesional adalah...",
    "o": [
      "Membatasi penggunaan AI sepenuhnya dan mengembalikan pada latihan manual.",
      "Masalah utama terletak pada hilangnya agency kognitif siswa akibat desain tugas yang menempatkan AI sebagai standar kebenaran, sehingga solusinya adalah merancang tugas reflektif-metakognitif yang memosisikan AI sebagai objek analisis dan negosiasi makna.",
      "Menambah variasi topik menulis dan meningkatkan kompleksitas prompt.",
      "Memperketat kontrol penggunaan AI dan memberikan sanksi akademik pada kemiripan teks.",
      "Melatih teknik prompt engineering agar siswa menghasilkan teks yang lebih beragam."
    ],
    "a": 1
  }
]
