[
  {
    "q": "Dalam pembelajaran Bahasa Arab pada materi klasifikasi kata (isim, fi'il, dan ḥarf), Ustadzah Laily menggunakan potongan ayat dari Q.S. Al-Hujurāt ayat 10: إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ فَأَصْلِحُوا بَيْنَ أَخَوَيْكُمْ وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُرْحَمُونَ. Rumusan tujuan pembelajaran ranah sikap manakah yang paling tepat untuk menggambarkan integrasi antara materi linguistik dan nilai-nilai ayat tersebut?",
    "o": [
      "Peserta didik membiasakan diri untuk saling memaafkan dan memperbaiki hubungan dengan teman sekelas.",
      "Peserta didik membiasakan diri untuk bekerja sama dan saling membantu dalam kelompok belajar.",
      "Peserta didik membiasakan diri untuk berkata sopan dan menjaga etika saat berdiskusi kelompok.",
      "Peserta didik membiasakan diri untuk menjaga persaudaraan dan menghindari permusuhan dengan teman sekelas.",
      "Peserta didik membiasakan diri untuk menyalin ayat dengan rapi dan menjaga kebersihan buku."
    ],
    "a": 3
  },
  {
    "q": "Pak Fadhil menggunakan teks pengumuman: إِعْلَانٌ عَاجِلٌ! أَيُّهَا الطُّلَّابُ، تَوَجَّهُوا إِلَى قَاعَةِ الْمُحَاضَرَاتِ فَوْرًا. سَيَبْدَأُ الْاِمْتِحَانُ بَعْدَ دَقَائِقَ قَلِيلَةٍ. رَاجِعُوا الْمَعْلُومَاتِ الْمُهِمَّةَ، وَكُونُوا مُسْتَعِدِّينَ تَمَامًا. untuk mengenalkan struktur jumlah fi'liyyah dan mengembangkan kemampuan analisis peserta didik terhadap bentuk fi'il dan maknanya. Rumusan tujuan pembelajaran manakah yang paling tepat untuk ranah pengetahuan yang mengembangkan kemampuan berpikir kritis peserta didik?",
    "o": [
      "Peserta didik mampu menyebutkan bentuk fi'il yang terdapat dalam kalimat secara berurutan dan tepat.",
      "Peserta didik mampu menilai variasi bentuk jumlah fi'liyyah dan menarik makna hubungan antarunsurnya.",
      "Peserta didik mampu menjelaskan perbedaan bentuk jumlah fi'liyyah berdasarkan jenis fi'il yang digunakan.",
      "Peserta didik mampu mengidentifikasi struktur jumlah fi'liyyah dalam setiap kalimat pengumuman.",
      "Peserta didik mampu menyalin kalimat dalam teks dan menyusunnya berdasarkan pola nahwu yang benar."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran Fashahah, Ustadzah Maryam menayangkan video berbahasa Arab tentang kegiatan bersih-bersih masjid oleh para pemuda. Cuplikan narasi berbunyi: شَارَكَ الشَّبَابُ فِي تَنْظِيفِ الْمَسْجِدِ وَتَنْسِيقِ الْأَحْذِيَةِ، وَكَانُوا سُعَدَاءَ بِهَذَا الْعَمَلِ التَّطَوُّعِيِّ. Setelah menonton video, siswa diminta membuat kalimat lisan bertema kerja sosial dengan gaya bahasa yang fasih dan lugas. Jika guru hendak merumuskan Tujuan Pembelajaran keterampilan dari kegiatan tersebut, manakah rumusan yang paling sesuai untuk membina semangat kerja sama melalui penguasaan fashahah?",
    "o": [
      "Peserta didik mampu menyalin kalimat kerja sosial dari video dengan tulisan Arab yang baik dan benar.",
      "Peserta didik mampu menyusun ringkasan isi video dalam bentuk paragraf sederhana dan komunikatif.",
      "Peserta didik mampu menguraikan makna dan contoh kata syāraka dari isi video pembelajaran.",
      "Peserta didik mampu membandingkan gaya ungkapan kerja sosial dari video dengan teks lain yang serupa.",
      "Peserta didik mampu mengucapkan kalimat lugas bertema kerja sosial dengan meniru gaya teks video."
    ],
    "a": 4
  },
  {
    "q": "Dalam pembelajaran Ilmu Lughah, Ustadzah Hana menayangkan video wawancara santri dari berbagai negara yang menjelaskan tradisi Ramadhan di daerah masing-masing. Berikut ini cuplikan narasi: نُزَيِّنُ الشَّوَارِعَ بِالْفَوَانِيسِ وَنُوَزِّعُ التَّمْرَ عَلَى الْجِيرَانِ قَبْلَ الْإِفْطَارِ. نَقْرَأُ الْقُرْآنَ جَمَاعِيًّا بَعْدَ صَلَاةِ التَّرَاوِيحِ، وَهَذَا مِنْ عَادَاتِنَا الرَّمَضَانِيَّةِ. Siswa diminta membuat poster digital berisi kutipan tradisi Ramadhan dalam bahasa Arab dan menyampaikan pendapat mereka secara lisan. Rumusan indikator tujuan pembelajaran ranah sikap manakah yang paling sesuai agar peserta didik memiliki sikap penerimaan terhadap tradisi?",
    "o": [
      "Peserta didik menyebutkan berbagai tradisi Ramadhan dari berbagai wilayah tanpa menilai kandungan budayanya.",
      "Peserta didik membuat daftar perbandingan antara tradisi Ramadhan Arab dan lokal secara sistematis.",
      "Peserta didik menunjukkan rasa hormat terhadap tradisi Ramadhan yang beragam melalui ekspresi berbahasa.",
      "Peserta didik menyelesaikan tugas poster tradisi secara tertib tanpa kesalahan dalam penulisan teks Arab.",
      "Peserta didik menunjukkan ketertarikan dalam menghafal dan menyebutkan istilah tradisi Ramadhan saat presentasi."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran keterampilan reseptif bahasa Arab, Ustadzah Layyinah memutar audio percakapan antara dua pelajar Arab tentang kegiatan belajar mereka. Setelah mendengarkan, siswa diminta mengidentifikasi teknik memahami informasi dari audio dan teks transkrip. Manakah rumusan indikator tujuan pembelajaran yang paling tepat untuk membantu peserta didik mengembangkan kemampuan berpikir dinamis dan inovatif dalam ranah pengetahuan bahasa Arab?",
    "o": [
      "Peserta didik dapat memahami teknik membaca dan mendengarkan dalam bahasa Arab untuk meningkatkan kelancaran berbicara di kelas.",
      "Peserta didik dapat mengidentifikasi berbagai teknik membaca dan mendengarkan dalam bahasa Arab untuk mengolah informasi secara efisien.",
      "Peserta didik dapat menerapkan teknik membaca dan mendengarkan dalam bahasa Arab untuk memperoleh informasi yang relevan dalam kehidupan sehari-hari.",
      "Peserta didik dapat mengenali berbagai tipe pembelajaran reseptif bahasa Arab dan memilih yang sesuai dengan gaya belajar mereka.",
      "Peserta didik dapat menyusun strategi membaca dan mendengarkan dalam bahasa Arab untuk meningkatkan kemampuan menulis akademik."
    ],
    "a": 1
  },
  {
    "q": "Ustadzah Hanifah merancang pembelajaran sharaf dengan pendekatan proyek. Siswa diminta menonton video vlog berbahasa Arab tentang kegiatan harian pelajar di Kairo. Tujuan pembelajaran: Peserta didik mampu mengidentifikasi fi'il mudhari' dalam konteks komunikasi nyata dan memvisualisasikannya dalam bentuk tabel digital. Pendekatan manakah yang paling tepat menggambarkan perencanaan guru?",
    "o": [
      "Menggunakan diskusi kelompok untuk memudahkan pemahaman bentuk fi'il mudhari' dalam kalimat.",
      "Menggabungkan metode proyek, media digital, dan analisis konten kebahasaan secara terpadu.",
      "Memanfaatkan teknologi tabel digital sebagai alat utama analisis bentuk fi'il mudhari'.",
      "Menekankan penguasaan bentuk fi'il mudhari' melalui contoh kontekstual dari video.",
      "Menghindari metode konvensional agar siswa lebih tertarik belajar sharaf."
    ],
    "a": 1
  },
  {
    "q": "Ustadzah Zahra menerapkan pembelajaran Jumlah Ismiyyah dengan pendekatan proyek. Siswa diminta membuat video pendek berisi deskripsi tempat tinggal dalam bahasa Arab, dengan minimal 5 contoh Jumlah Ismiyyah. Guru menyediakan template skrip digital dan aplikasi editing. Contoh kalimat dari siswa: الْبَيْتُ جَمِيلٌ، الْغُرْفَةُ وَاسِعَةٌ، النَّوَافِذُ مَفْتُوحَةٌ، الطَّاوِلَةُ نَظِيفَةٌ، وَالسَّتَائِرُ زُرْقَاءُ. Tujuan pembelajaran: Peserta didik mampu menganalisis struktur Jumlah Ismiyyah dalam konteks komunikasi nyata melalui proyek video. Manakah aspek yang paling tidak efektif dalam mendukung pencapaian tujuan pembelajaran tersebut?",
    "o": [
      "Penggunaan template skrip digital untuk memandu identifikasi mubtada' dan khabar.",
      "Pembuatan video deskripsi sebagai sarana kontekstualisasi struktur kalimat.",
      "Penilaian berdasarkan ketepatan penggunaan struktur Jumlah Ismiyyah dalam video.",
      "Kolaborasi antar siswa dalam menyusun dialog dan editing video.",
      "Pemberian contoh Jumlah Ismiyyah hanya dari teks buku tanpa variasi."
    ],
    "a": 4
  },
  {
    "q": "Ustadzah Maryam melaksanakan evaluasi materi tasybīh dengan pendekatan DBL. Siswa diminta membuat poster digital yang menampilkan contoh tasybīh dari syair Arab klasik dan mempresentasikannya di kelas virtual. Contoh kutipan syair: الْفَتَاةُ كَالْقَمَرِ فِي جَمَالِهَا. Tujuan evaluasi: Mengukur kemampuan peserta didik dalam menginterpretasi dan memvisualisasikan tasybīh secara kreatif sesuai konteks sastra Arab. Guru hanya menilai poster berdasarkan jumlah emoji reaksi di forum. Aspek evaluasi manakah yang paling lemah dalam mendukung tujuan pembelajaran tersebut?",
    "o": [
      "Penggunaan platform digital untuk mempresentasikan hasil karya siswa.",
      "Penekanan pada kreativitas visual dalam mendesain poster tasybīh.",
      "Integrasi konteks sastra Arab klasik dalam tema poster.",
      "Penilaian berbasis popularitas (emoji) daripada kedalaman pemahaman konsep.",
      "Kolaborasi antar siswa saat proses desain dan diskusi makna."
    ],
    "a": 3
  },
  {
    "q": "Ustadzah Nabila menyusun materi ajar tentang 'Peran Ilmu Sharaf dalam Memahami Derivasi Kata Kerja Bahasa Arab' menggunakan pendekatan TPACK. Ia menggunakan aplikasi Wordwall untuk latihan mencocokkan fi'il madhi dan mudhari', namun tidak menjelaskan pola wazan yang membentuk kata kerja. Contoh latihan: يَكْتُبُ – كَتَبَ، يَذْهَبُ – ذَهَبَ. Tujuan pembelajaran: Peserta didik mampu menganalisis pola perubahan fi'il dalam bahasa Arab berdasarkan struktur morfologis. Manakah kelemahan utama dalam perencanaan materi ajar tersebut?",
    "o": [
      "Kurangnya penggunaan teknologi interaktif selain Wordwall.",
      "Fokus pada hafalan tanpa mengaitkan dengan analisis morfologis.",
      "Tidak adanya contoh fi'il dalam konteks kalimat utuh.",
      "Materi wazan yang terlalu kompleks untuk tingkat peserta didik.",
      "Penggunaan Wordwall dinilai kurang menarik bagi generasi Z."
    ],
    "a": 1
  },
  {
    "q": "Dalam kelas kitabah, Ustadzah Hana menayangkan video proses pembuatan brosur digital bertema 'الصِّحَّةُ فِي الْمَدْرَسَةِ'. Langkah-langkah pembelajaran: 1) Siswa mengamati contoh brosur bahasa Arab dari internet. 2) Siswa mendiskusikan struktur teks brosur secara kelompok. 3) Siswa membuat kerangka isi dan memilih gaya bahasa. 4) Siswa menulis ulang brosur dengan kreativitas sendiri. 5) Siswa saling merevisi dan mempresentasikan hasil karya. Guru menekankan pentingnya berpikir kritis, kolaborasi, dan menghasilkan karya bahasa yang bermakna. Berdasarkan praktik pembelajaran di atas, alur materi ajar keterampilan produktif manakah yang paling sesuai untuk menunjang pencapaian tujuan pembelajaran dengan pendekatan Deep Learning?",
    "o": [
      "Menyajikan materi menulis berdasarkan contoh dan diakhiri dengan tugas individu tanpa kolaborasi.",
      "Memberikan penjelasan kaidah menulis kemudian langsung meminta siswa menyalin teks brosur.",
      "Mengajak siswa menganalisis teks autentik lalu menulis ulang dengan ide sendiri secara kelompok.",
      "Menugaskan siswa membaca teks brosur lalu menghafalkannya untuk latihan presentasi.",
      "Menyusun soal pilihan ganda tentang isi brosur dan menilai berdasarkan skor."
    ],
    "a": 2
  },
  {
    "q": "Ustadzah Fatimah merancang pembelajaran berbasis aktivitas riil bertema 'التحدث في المطعم' (berbicara di restoran). Siswa diminta menulis jurnal refleksi tentang kesulitan menggunakan ungkapan memesan makanan dan rasa gugup saat berbicara dengan pelayan. Guru melakukan konseling individual, namun memberikan latihan lisan yang sama untuk semua siswa tanpa mempertimbangkan tingkat kemampuan dan kepercayaan diri masing-masing. Tujuan pembelajaran: Peserta didik mampu menggunakan ungkapan layanan makanan secara lisan dalam situasi sosial sesuai karakteristik individu. Manakah aspek paling tidak sesuai dengan alur materi ajar berbasis teori pemerolehan bahasa Arab sesuai karakteristik peserta didik?",
    "o": [
      "Penggunaan jurnal refleksi untuk memetakan kesulitan siswa secara mandiri tanpa strategi lanjutan.",
      "Pemberian latihan lisan berulang tanpa mempertimbangkan tingkat kecemasan dan kemampuan siswa.",
      "Pembagian waktu konseling yang tidak merata dan tidak mempertimbangkan kebutuhan belajar tiap siswa.",
      "Tidak melibatkan media visual interaktif dalam penjelasan ungkapan layanan makanan.",
      "Metode diskusi privat yang dilakukan tanpa pendekatan fleksibel dianggap terlalu formal bagi siswa."
    ],
    "a": 1
  },
  {
    "q": "Ustadzah Mufidah merancang proyek 'Mengenal Nilai Toleransi melalui Cerita Rakyat Arab dan Indonesia' untuk menguatkan nilai P5 Bernalar Kritis dan Mandiri. Siswa diminta membuat buku cerita bergambar bilingual Arab-Indonesia bertema 'الاحترام بين الجيران' (saling menghormati antar tetangga). Namun, rubrik penilaian hanya menilai ketepatan struktur kalimat dan kosakata Arab, tanpa mempertimbangkan pemahaman nilai sosial dalam cerita. Manakah kelemahan utama dalam pengembangan materi ajar tersebut berdasarkan prinsip P5?",
    "o": [
      "Penggunaan cerita rakyat bilingual dianggap terlalu kompleks untuk siswa pemula.",
      "Proyek ini tidak melibatkan teknologi digital dalam pembuatan buku.",
      "Kurangnya contoh cerita Arab-Indonesia sebagai referensi siswa.",
      "Tidak ada indikator penilaian yang mengukur pemahaman nilai sosial dan toleransi.",
      "Tema toleransi tidak relevan dengan budaya Indonesia."
    ],
    "a": 3
  },
  {
    "q": "Ustadzah Nabila merancang proyek integratif bertajuk 'Cerita Inspiratif Tokoh Muslim Dunia dalam Bahasa Arab' untuk siswa kelas XI. Siswa diminta membuat e-book bilingual Arab-Indonesia tentang tokoh Muslim yang menginspirasi, seperti Ibnu Sina atau Malala Yousafzai, dan mengaitkan nilai-nilai perjuangan mereka dengan konteks kehidupan siswa. Namun, materi ajar yang disiapkan guru hanya berupa daftar kosakata dan struktur kalimat biografi, tanpa menyertakan bahan reflektif tentang nilai-nilai perjuangan dan kemanusiaan. Manakah pengembangan materi ajar yang paling tepat untuk mendukung pencapaian tujuan pembelajaran berbasis nilai-nilai rahmatan lil 'alamin dalam proyek tersebut?",
    "o": [
      "Menambahkan latihan menulis biografi tokoh Muslim dengan struktur kalimat baku dan kosakata formal.",
      "Mewajibkan siswa menghafal frasa biografi dalam bahasa Arab dan mempresentasikannya secara individu.",
      "Menambah latihan menulis narasi sejarah tokoh menggunakan pola fi'il madhi dan mudhari'.",
      "Mengganti proyek e-book menjadi ringkasan satu halaman tanpa melibatkan refleksi nilai perjuangan.",
      "Menyediakan video dokumenter tentang perjuangan tokoh Muslim, lalu mendiskusikan nilai-nilai kemanusiaan yang relevan."
    ],
    "a": 4
  },
  {
    "q": "Ustadzah Hanifah meminta siswa membuat dialog sederhana bertema 'Menghargai Pendapat Teman dalam Diskusi Kelas'. Dialog ditulis dalam bahasa Arab menggunakan ungkapan seperti: رَأْيِي مُخْتَلِفٌ، لَكِنِّي أَحْتَرِمُ رَأْيَكَ (Pendapatku berbeda, tapi aku menghormati pendapatmu) dan هَلْ يُمْكِنُنَا أَنْ نُنَاقِشَ بِهُدُوءٍ؟ (Bisakah kita berdiskusi dengan tenang?). Namun, guru hanya menilai aspek tata bahasa dan pelafalan, tanpa mengevaluasi sikap toleran dalam isi dialog. Manakah kelemahan utama dalam evaluasi pembelajaran ini berdasarkan prinsip moderasi beragama?",
    "o": [
      "Penggunaan ungkapan sopan dianggap terlalu mudah untuk siswa SMP.",
      "Penilaian fokus pada kebenaran bahasa, bukan sikap menghargai perbedaan.",
      "Tidak ada contoh dialog tentang toleransi dalam bahasa Arab.",
      "Topik diskusi kelas kurang terkait dengan nilai agama.",
      "Siswa tidak diberi waktu cukup untuk berlatih dialog."
    ],
    "a": 1
  },
  {
    "q": "Ustadzah Salamah meminta siswa membuat poster motivasi berbahasa Arab bertema 'Menghargai Perbedaan', dengan contoh kalimat seperti: الاختلاف لا يفسد للود قضية (Perbedaan tidak merusak persahabatan) dan كُلٌّ لَهُ رَأْيُهُ، فَلْنُحْتَرِمِ الْجَمِيعَ (Setiap orang punya pendapat, mari kita hormati semuanya). Namun, guru hanya menilai aspek visual dan ketepatan bahasa, tanpa membahas makna nilai toleransi dalam kehidupan. Manakah alasan yang tepat yang menunjukkan bahwa aktivitas ini belum mengimplementasikan nilai moderasi beragama?",
    "o": [
      "Tidak ada diskusi tentang makna isi poster itu dalam konteks kehidupan beragama.",
      "Guru tidak menyertakan contoh poster bertema agama Islam sebagai referensi.",
      "Penggunaan kalimat bahasa Arab dianggap terlalu sulit untuk siswa SMP.",
      "Siswa tidak diajarkan cara menggunakan aplikasi desain grafis untuk membuat poster.",
      "Topik poster tidak terkait langsung dengan materi tata bahasa."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran mizan sharfi, Ustadzah Laila menyajikan ayat: وَذَكِّرْهُمْ بِأَيَّامِ اللَّهِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِكُلِّ صَبَّارٍ شَكُورٍ (QS. Ibrahim: 5). Beliau meminta siswa menimbang kata ذَكِّرْ dan mengidentifikasi pola fi'il-nya. Guru tidak langsung menjelaskan jawabannya, melainkan meminta siswa menemukan pola dengan membandingkan bentuk fi'il amar dari fi'il tsulatsi. Rancangan pembelajaran berbasis masalah yang paling tepat untuk kegiatan ini adalah...",
    "o": [
      "Guru langsung menjelaskan bahwa ذَكِّرْ berwazan فَعِلْ tanpa meminta analisis dari siswa.",
      "Siswa diminta menghafalkan daftar fi'il amar tanpa menganalisis penggunaannya dalam ayat.",
      "Siswa diajak menemukan wazannya dengan membandingkannya pada pola kata serupa dalam ayat lain.",
      "Guru memberikan seluruh teori fi'il amar kemudian meminta siswa mengerjakan latihan tertulis.",
      "Siswa membaca terjemahan kata ذَكِّرْ tanpa mengkaji bentuk struktur bahasa Arabnya."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran tentang Jumlah Ismiyyah, Ustadzah Hanifah menampilkan ayat: اللَّهُ غَفُورٌ رَّحِيمٌ (QS. Al-Baqarah: 173). Beliau bertanya kepada mahasiswa: 'Bagaimana strategi membimbing siswa untuk mengembangkan kalimat Jumlah Ismiyyah ini dengan menambahkan syarat atau keterangan tambahan, tanpa mengubah struktur pokok kalimat?' Mahasiswa diminta merancang langkah pembelajaran yang mendorong siswa menemukan sendiri bentuk pengembangan kalimat. Rancangan pembelajaran berbasis masalah yang paling sesuai adalah...",
    "o": [
      "Dosen menjelaskan semua teori pengembangan kalimat dan siswa hanya mencatat.",
      "Siswa diajak mengeksplorasi tambahan informasi dalam kalimat melalui diskusi kasus, lalu membuat contoh baru.",
      "Siswa diminta menghafal contoh kalimat pengembangan Jumlah Ismiyyah tanpa menganalisis struktur.",
      "Dosen langsung memberikan tabel tambahan kata-kata untuk dihafal.",
      "Mahasiswa membuat terjemahan bebas dari kalimat tanpa mengkaji bentuk gramatikalnya."
    ],
    "a": 1
  },
  {
    "q": "Dalam pembelajaran Ilmu Ma'ani, Ustadzah Zahra memperlihatkan ayat: وَرَبُّكَ يَخْلُقُ مَا يَشَاءُ وَيَخْتَارُ ۗ مَا كَانَ لَهُمُ الْخِيَرَةُ ۚ سُبْحَانَ اللَّهِ وَتَعَالَىٰ عَمَّا يُشْرِكُونَ (QS. Al-Qashash: 68). Beliau memberi tugas: 'Analisis bagaimana struktur taqdim dan ta'khir digunakan dalam ayat ini untuk memperkuat makna. Buatlah rekaman podcast pendek (audio) yang berisi hasil analisis kalian, lalu unggah ke platform digital agar dapat diakses oleh teman-teman.' Strategi pembelajaran berbasis masalah dan teknologi yang paling sesuai untuk mendukung tugas ini adalah...",
    "o": [
      "Siswa membuat podcast berisi analisis taqdim wa ta'khir, lalu membagikannya melalui platform digital untuk diperdengarkan di kelas.",
      "Siswa menuliskan analisis hasil pembelajaran secara manual di buku tulis dan mengumpulkannya tanpa memanfaatkan media digital.",
      "Siswa hanya menghafalkan ayat dan menirukan ulang bacaan secara berulang tanpa memahami teknik retoris yang terkandung dalam struktur kalimat tersebut.",
      "Siswa mendengarkan contoh podcast guru tanpa membuat produk kreatif sendiri yang menunjukkan pemahaman mereka terhadap pola taqdim wa ta'khir.",
      "Siswa menggambar bagan alur makna ayat menggunakan media kertas dan pensil warna tanpa memanfaatkan aplikasi atau perangkat digital apa pun."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran fonetik bahasa Arab, Ustadzah Laila menjelaskan perbedaan bunyi antara huruf ض، ظ، غ، ذ yang khas dalam bahasa Arab dan tidak ditemukan dalam bahasa lain. Sebagian siswa lebih cepat memahami melalui latihan mendengarkan audio, sementara yang lain lebih nyaman berlatih pengucapan langsung secara berpasangan. Rancangan pembelajaran berbasis perbedaan individu yang paling tepat adalah...",
    "o": [
      "Siswa diminta hanya membaca teori fonetik dalam buku tanpa praktik audio.",
      "Semua siswa wajib menyalin daftar bunyi fonetik Arab tanpa latihan mendengarkan.",
      "Siswa hanya disuruh mengerjakan soal pilihan ganda tentang bunyi tanpa praktik berbicara.",
      "Siswa dipaksa membuat teks pidato tanpa pembelajaran fonetik.",
      "Siswa bebas memilih antara mendengarkan audio atau berlatih pengucapan langsung."
    ],
    "a": 4
  },
  {
    "q": "Dalam kelas Bahasa Arab, Bu Rania membagi siswa menjadi dua kelompok. Kelompok pertama diminta mempraktikkan dialog berpasangan tentang pengalaman belajar Bahasa Arab. Kelompok kedua diminta berdiskusi dalam kelompok kecil mengenai pertanyaan: 'Apa tantangan terbesar yang kamu hadapi saat belajar Bahasa Arab, dan bagaimana kamu mengatasinya?' Sebagian siswa merasa lebih nyaman dengan dialog berpasangan, sementara yang lain lebih percaya diri saat berdiskusi kelompok. Strategi pembelajaran yang paling tepat untuk mengakomodasi perbedaan tersebut adalah...",
    "o": [
      "Semua siswa hanya mempraktikkan dialog berpasangan tanpa alternatif lain.",
      "Siswa diberi pilihan untuk berlatih melalui dialog berpasangan atau diskusi.",
      "Siswa hanya diminta menyalin dialog tanpa praktik berbicara.",
      "Semua siswa diwajibkan diskusi kelompok besar tanpa memperhatikan preferensi individu.",
      "Siswa hanya membaca dialog tanpa latihan berbicara."
    ],
    "a": 1
  },
  {
    "q": "Dalam kelas keterampilan mediatif Bahasa Arab, Ustadz Rudi memberikan tugas kepada mahasiswa untuk menyampaikan kembali materi tentang adawat al-istifham (kata tanya). Sebagian mahasiswa memilih membuat infografis digital menggunakan aplikasi seperti Canva, sementara yang lain lebih suka membuat video pendek berisi penjelasan dan contoh penggunaan kata tanya dalam kehidupan sehari-hari. Strategi pembelajaran berbasis perbedaan individu berbasis teknologi yang paling sesuai untuk situasi ini adalah...",
    "o": [
      "Mahasiswa diberi pilihan untuk membuat media sesuai gaya belajarnya masing-masing.",
      "Mahasiswa hanya diperbolehkan membuat infografis digital tanpa alternatif lain.",
      "Mahasiswa harus membuat ringkasan teks saja tanpa menggunakan media teknologi.",
      "Semua mahasiswa wajib mengikuti tes lisan tanpa proyek teknologi kreatif.",
      "Mahasiswa hanya diminta membaca materi tanpa memediasi informasi dalam bentuk apa pun."
    ],
    "a": 0
  },
  {
    "q": "Dalam program magang mengajar, Ustadzah Nabila mengamati kelas Bahasa Arab tingkat pemula. Ia mencatat bahwa siswa mampu menyebutkan kosakata seperti: كِتَابٌ، مِقْعَدٌ، سَبُّورَةٌ، قَلَمٌ، namun mereka kesulitan menyusun kalimat seperti: الْكِتَابُ عَلَى الْمَقْعَدِ. Strategi pembelajaran berbasis pembelajaran mendalam yang paling sesuai untuk mengatasi masalah ini adalah...",
    "o": [
      "Memberikan daftar kosakata baru setiap pertemuan tanpa latihan menyusun kalimat.",
      "Membacakan daftar kosakata kepada siswa setiap hari untuk meningkatkan hafalan.",
      "Menugaskan siswa menerjemahkan kata benda ke Bahasa Indonesia tanpa praktik kalimat.",
      "Memberikan tugas menghafal paragraf panjang tanpa memperhatikan kemampuan siswa.",
      "Mengarahkan siswa menyusun kalimat sederhana menggunakan kosakata yang sudah mereka hafal melalui proyek membuat deskripsi benda sekitar."
    ],
    "a": 4
  },
  {
    "q": "Dalam pembelajaran Nahwu, Ustadz Usman memberikan tugas: 'Mahasiswa mempelajari bentuk i'rab isim (kata benda) dalam jumlah ismiyyah.' Dosen menyadari sebagian mahasiswa memahami lebih cepat dengan latihan membedakan mubtada' dan khabar melalui peta konsep, sementara sebagian lain memahami dengan praktik membuat contoh kalimat. Strategi pembelajaran berbasis pembelajaran mendalam yang paling tepat untuk kondisi ini adalah...",
    "o": [
      "Meminta semua siswa membuat tabel i'rab tanpa membangun kalimat nyata.",
      "Memberikan daftar istilah nahwu untuk dihafal tanpa aplikasi dalam kalimat.",
      "Membimbing siswa membedakan mubtada' dan khabar melalui peta konsep dan pembuatan kalimat sederhana.",
      "Menugaskan siswa menerjemahkan definisi mubtada' tanpa praktik membangun kalimat.",
      "Memberikan pilihan soal pilihan ganda tentang pengertian mubtada' dan khabar."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran Bahasa Arab, Ustadz Rosyid menampilkan ayat: يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَكُونُوا مَعَ الصَّادِقِينَ (QS. At-Taubah: 119). Kemudian beliau mengarahkan siswa untuk: 1) Membaca ayat tersebut dengan tajwid yang benar, 2) Mengidentifikasi kosakata kunci seperti ittaqū dan ṣādiqīn, 3) Menyusun percakapan pendek bertema kejujuran menggunakan kosakata dari ayat, dan 4) Membuat proyek video dialog singkat. Langkah berikut mendukung pembelajaran mendalam yang tepat dalam konteks ini, kecuali...",
    "o": [
      "Siswa membangun percakapan sederhana bertema kejujuran berdasarkan kosakata ayat.",
      "Siswa membuat video pendek percakapan menggunakan Bahasa Arab.",
      "Siswa melakukan peer review terhadap percakapan teman.",
      "Siswa memilih sendiri aplikasi sederhana untuk merekam dan mengedit videonya.",
      "Siswa hanya menghafalkan ayat tanpa mempraktikkan kosakata ke dalam konteks komunikatif."
    ],
    "a": 4
  },
  {
    "q": "Dialog: أَمِينَة: قَرَأْتُ أَنَّ مَدْرَسَتَنَا سَتُنَظِّمُ حَمْلَةً عَنْ حِمَايَةِ الْبِيئَةِ. سَارَة: مُمْتَازٌ! يُمْكِنُنَا اسْتِخْدَامُ اللُّغَةِ الْعَرَبِيَّةِ لِكِتَابَةِ شِعَارَاتٍ مِثْلَ: النَّظَافَةُ مِنَ الْإِيمَانِ. أَمِينَة: نَعَمْ، وَنُسَجِّلُ فِيدْيُو قَصِيرًا نُقَدِّمُ فِيهِ نَصَائِحَ بِيئِيَّةً. Konteks: Kegiatan kampanye lingkungan hidup di sekolah. Kosakata Kunci: حِمَايَة، النَّظَافَة، نَصَائِح. Rancangan pembelajaran istimā' berbasis TPACK yang sesuai untuk melatih pemahaman siswa tentang dialog di atas adalah, kecuali...",
    "o": [
      "Siswa hanya menyalin dialog tanpa membuat proyek kampanye lingkungan dalam Bahasa Arab.",
      "Siswa membuat video pendek berisi pesan lingkungan menggunakan Bahasa Arab.",
      "Siswa menjawab pertanyaan pemahaman melalui Google Form setelah menyimak dialog.",
      "Siswa membuat poster digital bertema kebersihan dengan kutipan dari dialog.",
      "Siswa melakukan refleksi tertulis tentang pentingnya menjaga lingkungan dalam Bahasa Arab."
    ],
    "a": 0
  },
  {
    "q": "Dalam pembelajaran Bina Al-Kalimah, Pak Usman menyajikan studi kasus dalam sebuah ayat: يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَكُونُوا مَعَ الصَّادِقِينَ (QS. At-Taubah: 119). Selanjutnya, ia meminta siswa untuk menganalisis i'rab dan tashrif dari kata-kata dalam ayat tersebut. Namun, siswa merasa materi ini terlalu klasik dan kurang menghubungkan Bahasa Arab dengan konteks zaman now. Strategi pembelajaran berbasis Problem-Based Learning (PBL) yang paling tepat digunakan oleh Pak Usman untuk mengatasi ketidakrelevanan materi ini dengan perkembangan zaman adalah...",
    "o": [
      "Siswa hanya diberi latihan menulis dan menghafal bentuk tashrif tanpa menghubungkannya dengan situasi dunia modern.",
      "Siswa diminta untuk membuat percakapan tema kejujuran dalam konteks kehidupan sehari-hari menggunakan kata dari ayat itu.",
      "Siswa diberi soal pilihan ganda tentang i'rab kata dalam ayat ini tanpa mencoba mengaitkan ke konteks sosial.",
      "Siswa hanya membaca teks klasik tanpa membuat refleksi atau aplikasi dalam percakapan modern.",
      "Siswa diminta menghafal kalimat dalam ayat tanpa menjelaskan relevansinya dengan kehidupan sosial."
    ],
    "a": 1
  },
  {
    "q": "Dalam kelas Bahasa Arab, Ustadz Rizal memberikan kalimat untuk mengembangkan pembelajaran agar siswa tidak hanya memahami teori majrūrāt al-asmā', tetapi juga mampu menggunakannya dalam komunikasi nyata. Strategi pembelajaran berbasis PjBL yang paling tepat untuk mendukung tujuan tersebut adalah...",
    "o": [
      "Siswa hanya diminta menyalin kalimat tanpa membuat proyek visual atau interaktif.",
      "Siswa membuat video tur kelas dalam Bahasa Arab, menjelaskan posisi benda menggunakan harf jar dan isim majrūr.",
      "Siswa hanya menghafal daftar harf jar tanpa latihan berbicara.",
      "Siswa hanya membaca teks tanpa membuat produk atau refleksi.",
      "Siswa diberi soal pilihan ganda tentang harf jar tanpa praktik menyusun kalimat."
    ],
    "a": 1
  },
  {
    "q": "Pak Raswan mengenalkan konsep tasybīh dalam Ilmu Balaghah dengan contoh: فَجَعَلَتِ الشَّمْسُ جَمْرَةً لَهِيبًا. Contoh tersebut dianggap masih terlalu kaku dan tidak relevan dengan cara berkomunikasi masa kini. Siswa kesulitan mengaitkan penggunaan tasybīh dalam konteks kehidupan modern. Jika Pak Raswan menggunakan strategi Discovery-Based Learning (DBL), langkah yang paling tepat untuk mengatasi ketidakrelevanan materi ini dan menciptakan suasana belajar yang membahagiakan adalah...",
    "o": [
      "Siswa hanya diberi soal pilihan ganda tentang pengertian tasybīh tanpa keterlibatan aktif.",
      "Siswa diminta untuk menciptakan kalimat tasybīh yang menggambarkan kehidupan modern, seperti media sosial.",
      "Siswa menghafal seluruh definisi tasybīh dan contohnya dari buku tanpa aplikasi praktis.",
      "Siswa diberi teks klasik tentang tasybīh tanpa berdiskusi tentang relevansinya di zaman sekarang.",
      "Siswa hanya diberi latihan soal yang memuat tasybīh tanpa membuat percakapan atau teks kreatif."
    ],
    "a": 1
  },
  {
    "q": "Di sebuah kelas Bahasa Arab, Ustadz Shobri menyajikan materi tata bahasa tradisional tentang struktur jumlah ismiyyah, sebagai berikut: الرَّجُلُ طَبِيبٌ. Sebetulnya, dosen ingin memperkenalkan pendekatan linguistik modern yang lebih aplikatif, di mana mahasiswa dapat membandingkan penggunaan kalimat nominal dalam percakapan sehari-hari. Namun, materi yang disajikan dinilai mahasiswa terlalu kaku dan kurang menggambarkan perkembangan zaman yang mengarah ke komunikasi digital dan teknologi. Jika guru tersebut ingin menjadikan pembelajaran ini lebih relevan dengan perkembangan zaman dan menciptakan suasana belajar yang akomodatif, strategi Discovery Learning (DL) yang paling tepat adalah...",
    "o": [
      "Siswa diberi tugas untuk membandingkan penggunaan jumlah ismiyyah dalam teks Arab klasik dan teks digital, kemudian mendiskusikan perbedaan penggunaannya dalam kelompok.",
      "Siswa membuat proyek percakapan yang menggambarkan penggunaan jumlah ismiyyah dalam kehidupan sehari-hari melalui video atau aplikasi chat.",
      "Siswa diberikan soal pilihan ganda untuk menyusun kalimat dengan jumlah ismiyyah tanpa aplikasinya dalam percakapan.",
      "Siswa diberi penugasan interaktif untuk membuat percakapan dengan jumlah ismiyyah yang relevan dengan teknologi dan dunia digital.",
      "Siswa diberi materi untuk menganalisis penggunaan jumlah ismiyyah dalam media sosial atau percakapan digital."
    ],
    "a": 0
  },
  {
    "q": "Dalam kelas Bahasa Arab, Bu Zahra masih menggunakan rekaman audio lama bertema kehidupan desa dan pasar tradisional. Siswa merasa sulit memahami istilah-istilah baru yang sering muncul di media sosial atau aplikasi digital. Penerapan TPACK yang paling tepat untuk meningkatkan relevansi pembelajaran istimā' adalah...",
    "o": [
      "Mengganti audio lama dengan podcast Arab modern yang membahas topik teknologi dan kehidupan digital.",
      "Memberikan latihan mendengarkan lagu Arab klasik tanpa membahas makna liriknya.",
      "Menugaskan siswa menghafal daftar kosakata dari rekaman lama tanpa praktik berbicara.",
      "Meminta siswa menonton drama Arab lawas tanpa diskusi konteks kekinian.",
      "Mengadakan tes mendengarkan tentang kehidupan desa tanpa memperbarui materi."
    ],
    "a": 0
  },
  {
    "q": "Di Madrasah Aliyah Al-Falah, siswa kelas XI memiliki minat tinggi dalam dunia konten digital. Namun, pembelajaran menulis Bahasa Arab masih terbatas pada imla' klasik dan hafalan kaidah nahwu-sharaf. Siswa belum pernah diminta menulis artikel blog, membuat caption media sosial, atau naskah presentasi. Pembelajaran berbicara pun hanya berupa hafalan dialog dari buku teks. Model pembelajaran berbasis bimbingan konseling yang paling efektif untuk meningkatkan relevansi keterampilan produktif Bahasa Arab adalah...",
    "o": [
      "Mengintegrasikan konseling karir dengan pelatihan menulis dan berbicara dalam konteks profesional seperti konten digital.",
      "Menambah jam hafalan kaidah nahwu-sharaf dan memperbanyak latihan menyalin teks Arab klasik.",
      "Mengadakan lomba pidato Bahasa Arab dengan tema yang sama setiap tahun tanpa variasi bentuk teks.",
      "Mengganti buku teks dengan video ceramah tanpa pelatihan menulis atau berbicara mandiri.",
      "Memberikan tugas menyalin paragraf Arab sebagai bentuk hukuman bagi siswa yang tidak lancar berbicara."
    ],
    "a": 0
  },
  {
    "q": "Di Madrasah Aliyah Al-Hikmah, guru Bahasa Arab masih menggunakan buku ajar yang memuat dialog seperti 'membeli kaset di toko' dan 'mengirim surat melalui pos'. Sementara itu, siswa generasi Z lebih akrab dengan platform seperti Spotify dan WhatsApp. Selain itu, tidak ada adaptasi materi untuk siswa disleksia atau tunarungu yang kesulitan mengakses konten audio. Pendekatan pembelajaran berbasis pelayanan ABK yang paling tepat untuk mengatasi masalah relevansi dan inklusivitas materi ajar tersebut adalah...",
    "o": [
      "Pendekatan pembelajaran berbasis proyek digital yang memungkinkan siswa membuat konten sesuai minat.",
      "Pendekatan kontekstual dengan memanfaatkan media sosial sebagai sumber utama pembelajaran.",
      "Pendekatan komunikatif melalui simulasi percakapan dari buku teks tanpa modifikasi.",
      "Pendekatan pembelajaran berbasis pelayanan ABK tanpa integrasi teknologi digital.",
      "Pendekatan STEM terintegrasi teknologi tanpa fokus pada keterampilan bahasa."
    ],
    "a": 0
  },
  {
    "q": "Di Madrasah Aliyah Nurul Huda, siswa belajar menulis Bahasa Arab dengan menyalin surat formal dan laporan kuno. Tidak ada latihan menulis caption media sosial, artikel blog, atau naskah presentasi. Siswa merasa kesulitan mengaitkan keterampilan menulis dengan dunia digital. Pendekatan pembelajaran yang paling tepat untuk meningkatkan keterampilan menulis kontekstual adalah...",
    "o": [
      "Pendekatan Komunikatif dengan latihan menyalin surat resmi dari buku teks.",
      "Pendekatan Kontekstual yang mengaitkan materi dengan kehidupan surat-menyurat tradisional.",
      "Metode Grammar-Translation untuk memperkuat struktur kalimat formal.",
      "Integrasi Teknologi Augmented Reality untuk menampilkan surat Arab klasik.",
      "Pembelajaran Berbasis Proyek membuat artikel blog dan caption media sosial dalam Bahasa Arab."
    ],
    "a": 4
  },
  {
    "q": "Ustadz Salman mengajarkan kosakata religius seperti التقوى، الإخلاص، الأمانة melalui metode hafalan dan terjemahan literal. Namun, siswa merasa materi tersebut tidak membantu mereka memahami bagaimana nilai-nilai itu diterapkan dalam kehidupan digital, seperti saat menghadapi hoaks atau konflik di media sosial. Pendekatan pembelajaran yang paling tepat untuk menjadikan nilai-nilai tersebut lebih bermakna dan aplikatif adalah...",
    "o": [
      "Pendekatan kontekstual dengan studi kasus tentang perilaku sosial di lingkungan sekitar.",
      "Pendekatan behavioristik melalui pemberian skor tertinggi bagi siswa yang hafal definisi kosakata.",
      "Pendekatan ekspositori dengan ceramah tentang pentingnya nilai-nilai Islam dalam kitab kuning.",
      "Pendekatan audiolingual melalui latihan pengucapan dan pengulangan kosakata seperti 'الأمانةُ أَسَاسُ الثِّقَةِ'.",
      "Pendekatan tradisional dengan menyalin teks Arab klasik عن الأخلاق tanpa diskusi aplikatif."
    ],
    "a": 0
  },
  {
    "q": "Di Madrasah Aliyah Al-Falah, Ustadz Yunus menggunakan materi percakapan Bahasa Arab yang hanya menampilkan perspektif satu kelompok keagamaan. Contoh dialog seperti: عَلِيّ: أُحِبُّ أَنْ أَذْهَبَ إِلَى الْمَسْجِدِ فِي كُلِّ يَوْمِ جُمُعَةٍ. سَعِيد: نَعَمْ، هَذَا أَمْرٌ مُهِمٌّ لِلْمُسْلِمِينَ. Siswa dari latar belakang berbeda merasa tidak terwakili dan kurang tertarik mempraktikkan Bahasa Arab dalam konteks nyata. Strategi apa yang efektif untuk meningkatkan inklusivitas sekaligus melatih keterampilan berbahasa Arab?",
    "o": [
      "Mengembangkan modul percakapan Bahasa Arab yang mencakup skenario komunikasi dengan ragam budaya dan agama.",
      "Menugaskan siswa menerjemahkan teks khutbah dari berbagai organisasi keagamaan tanpa diskusi.",
      "Mengadakan kompetisi pidato Bahasa Arab bertema persatuan nasional tanpa refleksi budaya.",
      "Mengundang native speaker Arab dari berbagai negara untuk berbagi pengalaman lintas budaya.",
      "Memakai film Arab klasik untuk studi kebahasaan tanpa konteks keberagaman Indonesia."
    ],
    "a": 0
  },
  {
    "q": "Ustadzah Laila mengajarkan materi tentang klasifikasi kata dalam Bahasa Arab. Ia membagikan teks pendek berjudul 'فِي الْمَدْرَسَةِ' dan meminta siswa bekerja dalam kelompok untuk mengidentifikasi kata benda (ism), kata kerja (fi'l), dan huruf (harf). Siswa berdiskusi dan mencatat hasil klasifikasi mereka, lalu mempresentasikannya di depan kelas. Guru mengamati proses dan memberikan umpan balik setelah presentasi. Berdasarkan deskripsi di atas, teknik asesmen mana yang paling tepat untuk mengukur keterampilan peserta didik dalam melakukan klasifikasi kata dalam Bahasa Arab?",
    "o": [
      "Penilaian proyek berupa laporan tertulis hasil klasifikasi kata dari teks yang dibaca.",
      "Ujian tertulis dengan soal pilihan ganda tentang jenis-jenis kata dalam Bahasa Arab.",
      "Observasi selama presentasi kelompok untuk menilai kemampuan siswa dalam menyampaikan hasil analisis.",
      "Penilaian diri (self-assessment) tentang peran siswa dalam kerja kelompok saat diskusi.",
      "Penilaian teman sebaya (peer-assessment) terhadap keaktifan anggota kelompok saat presentasi."
    ],
    "a": 2
  },
  {
    "q": "Dalam pembelajaran Majzūmāt, Bu Zahra meminta siswa membuat video edukasi tentang perubahan fi'il mudhari' setelah masuk partikel jazm. Siswa harus: 1) Menjelaskan konsep jazm, 2) Memberi contoh dari ayat seperti 'لَمْ يَلِدْ وَلَمْ يُولَدْ' (QS. Al-Ikhlas: 3), 3) Menjelaskan alasan perubahan bentuk kata kerja, 4) Menayangkan video di kelas dan berdiskusi. Instrumen asesmen yang paling tepat untuk menilai keterampilan siswa dalam proyek video ini adalah...",
    "o": [
      "Rubrik penilaian dengan aspek 'kelengkapan penjelasan' dan 'kreativitas video' pada produk kelompok.",
      "Lembar observasi sikap aktif siswa saat presentasi dan diskusi kelompok, misalnya saat menjelaskan perubahan bentuk fi'il seperti 'يَلِد' atau 'يُولَد'.",
      "Tes tertulis tentang ciri-ciri fi'il mudhari' majzum dan partikel jazm.",
      "Jurnal refleksi siswa tentang proses pembuatan video edukasi kelompok.",
      "Kuis lisan tentang contoh partikel jazm dan perubahan bentuk kata kerja."
    ],
    "a": 0
  },
  {
    "q": "Ustadzah Hasnah mengajarkan konsep الاقتباس dalam Balaghah. Ia menyajikan kutipan dari sebuah puisi Arab klasik: 'فَصَبْرٌ جَمِيلٌ وَاللَّهُ الْمُسْتَعَانُ'. Siswa diminta mengidentifikasi ayat yang dikutip, menganalisis fungsi kutipan dalam teks sastra, dan mendiskusikan makna retorisnya. Setelah diskusi, siswa mempresentasikan hasil analisis di kelas. Teknik asesmen yang paling tepat untuk mengukur pemahaman mahasiswa tentang konsep Iqtibas adalah...",
    "o": [
      "Ujian tertulis yang menguji pemahaman konsep Iqtibas dan penerapannya dalam teks sastra.",
      "Penilaian proyek berupa analisis puisi Arab yang mengandung kutipan ayat Al-Qur'an.",
      "Penilaian teman sebaya untuk mengevaluasi pemahaman mahasiswa dalam diskusi kelompok.",
      "Observasi langsung saat presentasi untuk menilai kemampuan menjelaskan kutipan.",
      "Penilaian diri untuk mengevaluasi pemahaman pribadi mahasiswa tentang gaya bahasa badi'."
    ],
    "a": 0
  },
  {
    "q": "Pak Ari mengajarkan teori pemerolehan bahasa Arab dengan merujuk prinsip Input yang Bermakna (Krashen). Ia meminta mahasiswa untuk membuat jurnal refleksi tentang pengalaman mereka menggunakan Bahasa Arab dalam kegiatan sehari-hari di pesantren, seperti berdiskusi, beribadah, atau berbelanja di kantin. Instrumen asesmen yang paling tepat untuk mengukur pemahaman mahasiswa terhadap penerapan teori pemerolehan bahasa adalah...",
    "o": [
      "Angket evaluasi minat terhadap budaya Arab dan metode hafalan.",
      "Tes pilihan ganda tentang definisi pemerolehan bahasa dan teori Krashen.",
      "Simulasi percakapan formal dalam suasana akademik.",
      "Penilaian diri melalui jurnal refleksi tentang pengalaman berbahasa Arab dalam konteks nyata.",
      "Observasi partisipasi dalam seminar teori linguistik Arab."
    ],
    "a": 3
  },
  {
    "q": "Ustadz Salim mengadakan simulasi jual beli di pasar tradisional Arab (السوق التقليدي), di mana mahasiswa berperan sebagai pedagang dan pembeli. Tujuan pembelajaran: 1) Mahasiswa mampu menggunakan ungkapan transaksi seperti: بِكَمْ هَذَا؟ هَلْ يُمْكِنُ الْمُسَاوَمَةُ؟ أُرِيدُ كِيلُو مِنَ التُّفَّاحِ. 2) Mahasiswa menunjukkan gestur nonverbal yang sesuai dengan budaya Arab saat tawar-menawar. Teknik asesmen yang paling tepat untuk menilai kedua indikator tersebut adalah...",
    "o": [
      "Tes lisan berupa praktik transaksi di kelas.",
      "Observasi langsung dengan rubrik performa komunikasi.",
      "Kuis tertulis tentang kosakata jual beli.",
      "Penilaian teman sebaya melalui rekaman video simulasi.",
      "Refleksi tertulis tentang pengalaman bernegosiasi."
    ],
    "a": 1
  },
  {
    "q": "Dalam sesi diskusi daring antara siswa madrasah Indonesia dan siswa Tunisia, topik yang dibahas adalah 'Peran Bahasa Arab dalam Identitas Nasional'. Beberapa siswa Indonesia merasa bingung saat siswa Tunisia menggunakan istilah lokal seperti 'بَرْشَة' (banyak) yang tidak umum dalam Fusha. Guru ingin menilai bagaimana siswa Indonesia merespons perbedaan tersebut dengan sikap terbuka dan tetap berusaha menggunakan ungkapan sopan seperti: 'هَلْ يُمْكِنُكَ أَنْ تُشْرِحَ لِي هَذَا؟' atau 'أَعْتَقِدُ أَنَّ هَذَا مُثِيرٌ لِلِاهْتِمَامِ'. Instrumen asesmen apa yang paling tepat untuk menilai sikap siswa dalam konteks tersebut?",
    "o": [
      "Observasi langsung dengan rubrik penggunaan bahasa Arab standar.",
      "Tes tertulis tentang perbedaan antara Fusha dan dialek Tunisia.",
      "Penilaian video diskusi dengan fokus pada kesalahan bahasa.",
      "Jurnal refleksi tentang kesulitan memahami dialek Arab.",
      "Angket terbuka tentang sikap terhadap keberagaman dialek Arab."
    ],
    "a": 4
  },
  {
    "q": "Dalam diskusi daring antara siswa madrasah Indonesia dan siswa dari Suriah tentang topik 'دَوْرُ اللُّغَةِ الْعَرَبِيَّةِ فِي تَعْزِيزِ الْهُوِيَّةِ الْإِسْلَامِيَّة' (Peran bahasa Arab dalam memperkuat identitas Islam), guru menemukan: 1) Siswa Indonesia yang aktif sering menggunakan bahasa campuran Arab-Indonesia. 2) Siswa Suriah tetap menggunakan Fusha dan menunjukkan sikap terbuka. 3) Beberapa siswa Indonesia merasa tidak percaya diri untuk berbicara dalam bahasa Arab. Guru ingin merancang asesmen sikap yang dapat mendorong keberanian berpartisipasi, empati, dan kesetaraan dalam komunikasi lintas budaya. Teknik asesmen sikap yang paling efektif untuk mencapai tujuan tersebut adalah...",
    "o": [
      "Observasi langsung dengan rubrik keaktifan dan penggunaan bahasa Arab.",
      "Tes esai tentang pentingnya menjaga bahasa Arab Fusha dalam komunikasi.",
      "Self-assessment berbasis jurnal refleksi tentang pengalaman diskusi lintas budaya.",
      "Penilaian video diskusi dengan fokus pada ekspresi dan intonasi.",
      "Kuis tertulis tentang ungkapan sopan dalam diskusi bahasa Arab."
    ],
    "a": 2
  },
  {
    "q": "Di sebuah Madrasah Mumtazah, Ustadzah Nuri merekam interaksi siswa saat mereka berbincang di perpustakaan. Beberapa ungkapan yang digunakan: 'هَلْ قَرَأْتَ هَذَا الْكِتَابَ؟' 'إِنَّهُ مُمْتِعٌ جِدًّا!' 'تُرِيدُ أَنْ نَسْتَعِيرَهُ مَعًا؟' Guru menggunakan video ini sebagai bahan ajar keterampilan berbicara. Setelah asesmen awal, ditemukan bahwa siswa memahami isi dialog, tetapi kurang percaya diri saat berbicara di depan umum. Instrumen asesmen yang paling tepat digunakan guru pada tahap berikutnya adalah...",
    "o": [
      "Memberikan tes pilihan ganda kepada siswa yang berisi arti kosakata dialog beserta konteks penggunaannya secara tertulis.",
      "Menugaskan siswa untuk menyalin dan melengkapi teks dialog sebagai latihan tambahan.",
      "Menilai rekaman tugas berbicara siswa dengan rubrik kelancaran dan ekspresi.",
      "Mengadakan kuis tertulis tentang struktur kalimat dalam dialog.",
      "Memberikan soal uraian tentang pengalaman berbicara di depan umum."
    ],
    "a": 2
  },
  {
    "q": "Ustadzah Maimunah menyampaikan materi tentang الصِّدْق (kejujuran) melalui kisah Nabi Muhammad SAW. Kuis awal menunjukkan bahwa 90% siswa mampu menjelaskan makna الصِّدْق dan memberikan contoh dalam bahasa Arab. Namun, saat praktik dialog berpasangan, beberapa siswa terlihat mencontek teks dari teman. Instrumen asesmen yang paling tepat untuk menilai kesenjangan antara pemahaman konsep dan penerapan nilai kejujuran siswa adalah...",
    "o": [
      "Memberikan tes pilihan ganda tentang makna الصِّدْق dan penggunaannya dalam kalimat.",
      "Menugaskan siswa menulis esai tentang pentingnya kejujuran dalam kehidupan sehari-hari.",
      "Observasi partisipatif selama aktivitas dialog dengan fokus pada spontanitas dan kejujuran.",
      "Self-assessment berbasis jurnal refleksi berbahasa Arab.",
      "Kuis ulang tentang struktur kalimat yang mengandung nilai الصِّدْق."
    ],
    "a": 2
  },
  {
    "q": "Dalam mata kuliah tafsir teks Arab klasik, mahasiswa membaca hikayat tentang tokoh sufi yang menolak kekerasan atas nama agama. Sebagian besar mampu menerjemahkan teks dengan baik. Namun, saat diskusi, beberapa mahasiswa menyimpulkan bahwa tokoh tersebut 'lemah' karena tidak membalas kekerasan, tanpa mempertimbangkan nilai tasamuh (toleransi). Instrumen asesmen yang paling tepat untuk mengukur kemampuan mahasiswa dalam mengintegrasikan nilai moderasi beragama ke dalam interpretasi teks Arab adalah...",
    "o": [
      "Tes tertulis tentang makna tasamuh dan penggunaannya dalam kalimat Arab.",
      "Penugasan menyalin teks hikayat dan membuat glosarium kosakata.",
      "Diskusi kelompok tentang makna tasamuh dalam teks sastra Arab.",
      "Kuis pilihan ganda tentang sinonim dan antonim kata tasamuh.",
      "Penilaian presentasi analisis teks dengan rubrik nilai moderasi dan kontekstualisasi."
    ],
    "a": 4
  },
  {
    "q": "Dalam pembelajaran, Ustadzah Layla menampilkan dialog berikut di kelas: الْعَدْلُ فِي الْمَدْرَسَةِ الْيَوْمَ. نَعَمْ، وَالطُّلَّابُ نَشِيطُونَ فِي السَّاحَةِ. Siswa diminta membuat video percakapan kelompok dengan jumlah ismiyyah. Namun, guru belum membuat rubrik penilaian dan tidak mengecek keaktifan siswa dalam kelompok. Praktik terbaik yang seharusnya dilakukan guru untuk meningkatkan kualitas pembelajaran adalah...",
    "o": [
      "Menyusun rubrik penilaian dan mengevaluasi keaktifan siswa dalam kelompok.",
      "Menugaskan siswa menghafal dialog dan mengulangnya bersama-sama.",
      "Mengganti tugas video dengan latihan menulis agar lebih mudah dinilai.",
      "Memberikan latihan tambahan tanpa pendampingan guru.",
      "Mengulang materi secara klasikal agar semua siswa mendapat penjelasan ulang."
    ],
    "a": 0
  },
  {
    "q": "Ustadzah Salwa mengajarkan Ijaz melalui flipped classroom. Siswa diminta menonton video tentang ayat yang menyoroti makna padat melalui hadzf. Di kelas, guru menggunakan Kahoot untuk kuis: 'Apa fungsi hadzf dalam ayat ini?' Namun, 55% siswa menjawab keliru karena video hanya membahas terjemahan. Setelah itu, siswa membuat contoh Ijaz bertema lingkungan, tetapi banyak yang salah memahami konsep dasar. Faktor utama kegagalan pencapaian tujuan pembelajaran Ijaz adalah...",
    "o": [
      "Video tidak menjelaskan ciri hadzf secara rinci.",
      "Tidak ada refleksi setelah kuis kelompok.",
      "Kahoot kurang cocok untuk analisis makna tersirat.",
      "Materi tidak dikaitkan dengan tema lingkungan.",
      "Tugas kelompok dan kuis tidak diikuti klarifikasi konsep."
    ],
    "a": 4
  },
  {
    "q": "Dalam sesi menyimak, Ustadz Amir memperdengarkan rekaman dialog santri di asrama: مَنْ نَظَّفَ الْغُرْفَةَ؟ أَنَا، لِأَنَّ دَوْرِي الْيَوْمَ. جَزَاكَ اللَّهُ خَيْرًا، الْغُرْفَةُ نَظِيفَةٌ جِدًّا. Siswa menjawab soal pilihan ganda melalui platform digital. Guru menampilkan skor otomatis, tetapi tidak membahas kesalahan, tidak memberi umpan balik reflektif, dan tidak mengaitkan makna sosial percakapan dengan pengalaman keseharian. Faktor utama yang menghambat efektivitas evaluasi keterampilan menyimak dalam kasus tersebut adalah...",
    "o": [
      "Teknologi: Platform kuis tidak mendukung fitur audio interaktif.",
      "Pedagogi: Tidak ada proses refleksi atau klarifikasi terhadap makna sosial dalam dialog.",
      "Konten: Rekaman terlalu pendek dan tidak mencakup variasi struktur kalimat.",
      "Teknologi: Hasil kuis tidak dapat disimpan sebagai portofolio.",
      "Pedagogi: Guru tidak memberikan soal lanjutan setelah kuis."
    ],
    "a": 1
  },
  {
    "q": "Ustadzah Hanifah, guru Bahasa Arab di MTs, aktif mengikuti komunitas daring pengajar Bahasa Arab internasional. Ia sering berdiskusi tentang pendekatan pengajaran berbasis teks otentik dan tren kosakata Arab modern. Ia juga mengadaptasi materi dari sumber digital seperti berita Arab dan forum daring, lalu menyusunnya menjadi bahan ajar yang kontekstual bagi siswa. Namun, ia belum menyusun strategi pembelajaran jangka panjang yang mengintegrasikan sumber digital ini secara berkelanjutan. Kemampuan Ustadzah Hanifah ini paling mencerminkan...",
    "o": [
      "Kemampuan menyusun bahan ajar yang menarik dan sesuai minat siswa.",
      "Kemampuan mengakses sumber belajar Bahasa Arab dari berbagai platform digital.",
      "Kemampuan mengembangkan konten pembelajaran berbasis budaya Arab kontemporer.",
      "Kemampuan beradaptasi terhadap tuntutan profesionalisme guru melalui integrasi sumber digital secara berkelanjutan.",
      "Kemampuan memanfaatkan teknologi untuk asesmen berbasis teks otentik."
    ],
    "a": 1
  },
  {
    "q": "Ustadzah Rania menggunakan aplikasi AI untuk melatih siswa kelas III MI mengenali kosakata Arab tentang benda-benda di kelas. Aplikasi ini menampilkan gambar dan terjemahan otomatis. Siswa cepat menghafal, tetapi saat diminta menyusun kalimat sendiri, mereka bingung menggunakan kata dalam struktur yang berbeda. Guru menyadari bahwa pemahaman siswa masih terbatas pada bentuk hafalan. Masalah utama dan pendekatan ilmiah yang paling relevan untuk menunjukkan jati diri guru profesional adalah...",
    "o": [
      "Masalah: Aplikasi AI tidak menyediakan fitur latihan menulis. Solusi: Mengganti aplikasi dengan yang memiliki fitur menulis kalimat.",
      "Masalah: Siswa belum terbiasa menyusun kalimat sendiri. Solusi: Memberikan latihan menulis manual tanpa bantuan AI.",
      "Masalah: Hafalan kosakata tidak cukup untuk membangun kompetensi komunikatif. Solusi: Melakukan studi tindakan kelas dengan pendekatan kontekstual berbasis tugas.",
      "Masalah: Guru belum mengajarkan struktur kalimat secara eksplisit. Solusi: Mengulang materi nahwu secara klasikal.",
      "Masalah: Aplikasi AI terlalu fokus pada visual. Solusi: Menggunakan metode audio-lingual konvensional."
    ],
    "a": 2
  }
]
